[
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "5 days",
        "role": "Financial Software Developer",
        "details": "An hour long interview process with 2 interviewers. It started off with them asking questions about my resume and then two technical questions. Both interviewers were very nice and gave many hints in solving the problem. Overall a positive experience, and interviewers made the process enjoyable as they helped me solve the problem.",
        "questions": [
            "How to check if a string has matching parentheses.  "
        ],
        "date": "Mar 12, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Financial Software Developer",
        "details": "Flew down to New York for an in-person interview after a 45 minute phone screen. The ons-ite interview consisted of two technical, one manager, and one HR interview. Lasted about 4-5 hours total. People were very nice. Office is super nice.",
        "questions": [
            "If you were to receive an offer from Google as well as Bloomberg, what could we do to get you?  "
        ],
        "date": "Dec 15, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "Dropped off resume at career fair, then applied online. Got on campus interview. Met for one round with two software engineers, who asked data structures and algorithms questions. Some of the questions were quite difficult.",
        "questions": [
            "Tell me about your resume  "
        ],
        "date": "Dec 15, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Financial Software Developer",
        "details": "Phone interview, followed by on-site interview with developers, manager and HR. The questions were mostly brainteasers, no financial knowledge were required. HR asked general behavioral questions and desired salary, starting date, etc. Was told that they contact me within 2 weeks, but haven't heard back for a while, so I followed up with the internal recruiter and he replied that they were not moving forward with me.",
        "questions": [
            "Some brainteasers  "
        ],
        "date": "Dec 1, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "Phone interview then got flown out to their office in New York where I had 2 on-site interviews. The phone interview was on HackerRank where I was asked a question about LinkedLists. The one site interview involved writing code on paper involving mostly algorithms and answering some logic and math questions.",
        "questions": [
            "Q. Tic Tac Toe game keep track of board state  "
        ],
        "date": "Jan 14, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Easy Interview",
        "length": "2+ months",
        "role": "Financial Software Developer",
        "details": "Interview was easy but process was very irritating. Interviewer rescheduled over 3x times. Interviewer was not very friendly. Did not care to ask about my name or discuss my resume.",
        "questions": [
            "Traverse through a binary tree  "
        ],
        "date": "Nov 15, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "really smooth—talked to recruiter at university career fair, got a phone interview (hackerrank) afterwards with two questions. got an onsite offer a few weeks later, they fly you out and pay for hotel etc. onsite involves two 2-on-1 technical interviews with engineers. mine switched off asking questions, we probably got through 2-3 questions each time. then was a shorter interview with a group manager, who gave a more open ended…  design question, then a brief \"why Bloomberg\" type thing with HR.",
        "questions": [
            "find common parents in a binary tree  "
        ],
        "date": "Nov 11, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Financial Software Developer",
        "details": "Came to career fair, asked some data structure questions. Got an interview offer the next week. Interview was an hour long, and there were 3 rounds in the same day, and they'd ask you to come back in a couple hours if they liked you",
        "questions": [
            "Find a thing in a linkedList. Then find thing in a Linked List that has multiple nodes.  "
        ],
        "date": "Oct 17, 2015"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "Two technical interviews on my campus, and a behavioral and manager interview on-site. Technical interviews were heavily focused on data-structures. Behavioral and manager interviews were pretty relaxed and felt like conversations.",
        "questions": [
            ".  "
        ],
        "date": "Dec 11, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 days",
        "role": "Financial Software Developer",
        "details": "Interviews were held in the university after Career Fair. There was one round of technical interview per day, for 3 days (they were eliminating candidates each day)They asked simple coding question (Cracking the coding interview book would be helpful)",
        "questions": [
            "Explain the projects on your resume, Some questions on tree traversal  "
        ],
        "date": "Oct 8, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "Phone interview after applying online. They asked pretty easy questions and I messed up a few of the later questions. Introductory algorithms experience is probably sufficient to do well. Interviewer seemed knowledgeable and fair. Didn't touch too much on anything other than programming experience and skills. The interviewer gave time to ask questions at the end about Bloomberg.",
        "questions": [
            "Fairly straighforward streaming algorithm questions in Java.  "
        ],
        "date": "Aug 28, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "4 weeks",
        "role": "Financial Software Developer",
        "details": "1 phone round - 1hour, asked me to code in HackerRank.Onsite 4 rounds - 2 technical followed by one with a manager and one with a hr. If you perform well in first 2 rounds,you go to further rounds.Else,you're out.Overall they look for smart candidates with not so much focus on perfect coding skills,which is good I guess.",
        "questions": [
            "Web browser history implementation without duplicates,a couple of c++ questions and some standard algorithm and data structure questions.  "
        ],
        "date": "Apr 15, 2015"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "2 days",
        "role": "Financial Software Developer",
        "details": "It was the standard procedure. First a phone interview and then interview at their headquarters in NYC. Not particularly difficult. I enjoyed the trip to NYC. They asked me brain teasers some programming questions in C++ and some algorithms questions.",
        "questions": [
            "It was a brainteaser with monks.  "
        ],
        "date": "Mar 18, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "I got an on campus interview and the recruiter ask me several technical questions. I think it is a basic algorithm and I answered it. The people are very nice and friendly.",
        "questions": [
            "find the largest number in a array  "
        ],
        "date": "Mar 6, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "Applied online. Got a technical coding question on phone interview and a question on general data structures. After two days, heard back from them asking me to fly to NY for an in-house interview.",
        "questions": [
            "Find repeating characters in string. Count occurrences of number in a stream of numbers. Print elements of a linked list in a particular order. Eg: 2-4-5-6-7-10-13 . output - \"2,4-7,10,13\". If the numbers are consecutive print the starting and ending number of the range, otherwise print the numbers as such in the form of string  "
        ],
        "date": "Feb 16, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "I talked with representatives of Bloomberg at a career fair on campus. They had me do a quick coding test in person – how to find the character that occurred the most in an array. I handed them my resume and they said they’d look it over. After about a week or so of applying I was emailed about a phone interview. I was asked almost exclusively about C++, including…  questions about pointers, inheritance, and polymorphism.Ultimately I was a bit too nervous and stumbled over some easy problems.",
        "questions": [
            "How do you find the middle of a linked list, rounding up in the case of an odd number of items but with no differentiation between an even or odd number?  "
        ],
        "date": "Feb 5, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "I have applied online to Bloomberg L.P. Later I got an email Scheduling my Telephonic Interview.Total, One Telephonic Round and after that I was called for In house interview where I attended , two in person interviews.",
        "questions": [
            "Telephonic Round was basically regarding my college projects, I was asked implement the logic on the project.In house interview, First round, 1) output of a/b in string format, incase it has recursion output that part between ( ). 2) First largest and second largest number in a series.Second Round 1) Logic to implement the feature Frequently used websites on a browser.2) How to find a cycle in a linked list…  and why use fast pointer that goes twice as fast as the slow one and not thrice it speed or four times its speed.  "
        ],
        "date": "Feb 7, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "Got an on-campus interview after talking to them at the career fair. First round technical with two people passed and the second round is the very next day, again with two other people. After that, its supposed to be another techinical interview with their manager. I just had the second round and not yet received any feedback.",
        "questions": [
            "Reverse Integer, Two LinkedList intersects with each other, general question about heap, Buy and sell stock, Fabonacci, find the smallest common mutiples of two numbers.  "
        ],
        "date": "Feb 9, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "On campus interview. I applied through career fair. They gave me an on campus the next day. Interview was with two people. Fairly direct and straightfoward. The interview itself was about 45 minutes. I assume if you continued they would have a back to back interview afterwards",
        "questions": [
            "Find the smallest two values in an array  ",
            "How to tell if a series of parenthesis is valid  "
        ],
        "date": "Mar 12, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "Applied online through my schools job portal. A couple months later I received an email asking for a phone interview. My first interview was cancelled so I then had to reschedule to a couple weeks later. The interview was 45 minutes long and not to bad. Asked questions about past experience and related course work. Was a strictly technical interview.",
        "questions": [
            "Write a function that calculates the specific value in a tree.  "
        ],
        "date": "Jan 15, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "1 phone screen and 1 on-site. At on-site, I had two interviews and was asked to leave after the second interview. It was a fairly standard technical interview, but I feel my answers in the on-site interview took me a little longer than it should have.",
        "questions": [
            "Given a list of integers, all from 1 to n, except for 2 which are marked as \"0\", find the 2 values that are missing.For example, for n = 5: arr = [1,5,0,0,3] =&gt; the two missing values are 2 and 4.  "
        ],
        "date": "Jan 5, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Financial Software Developer",
        "details": "Applied online, got through the phone interview and went to an in-house interview. First round was with two interviewers, two questions: one designing a hash function and the other writing a function to determine if the input is a palindrome. Then the second round only one interviewer came in, and at that moment I knew that I didn't get the position, because normally there are two interviewers. Second round ended…  quick like in 30 minutes and the interviewer let me out saying HR will contact in a few weeks.",
        "questions": [
            "Designing a hash function.Determining if the input is a palindrome.  "
        ],
        "date": "Feb 10, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "Got a call to come to an interview for technical skills and learn about what Bloomberg software engineering has to offer me. This all started from putting my name in their pool at an on-campus career fair. The interview itself was very friendly and they helped me through problems and I enjoyed the interview proccess, unfortunately I did not do as well as I would have liked because it was…  my first coding interview.",
        "questions": [
            "Given an array of 99 numbers 1-100 find the missing number.  "
        ],
        "date": "Feb 18, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "2 weeks",
        "role": "Financial Software Developer",
        "details": "They contacted me after I applied online about a technical interview. It took about 45 minutes and I had to code online while I was on the phone with the interviewer.",
        "questions": [
            "Write a non-recursive fibonacci method.  "
        ],
        "date": "Apr 12, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2+ weeks",
        "role": "Financial Software Developer",
        "details": "The process was smooth. More than 50 candidates were called for onsite interview. Four onsite interviews were kind of elimination round. One has to give a good interview to get into next round. The interview questions were not typical but interesting problems.",
        "questions": [
            "Algorithms and datastructure  "
        ],
        "date": "Sep 18, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Easy Interview",
        "difficulty": "-",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "The interviewer seemed a pretty chilled out guy. He started with basic stuff and never entered the zone of difficult problems. First question was writing a method for detecting if a string is a palindrome. The second question was printing a linked list in reverse. Third was reversing the linked list. Language was no barrier and I could use the language of my choice. He only allowed me to code…  after he was convinced by my approach",
        "questions": [
            "There were not difficult questions  "
        ],
        "date": "Jan 5, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Financial Software Developer",
        "details": "The interview was a phone screen. It started with introduction and questions over resume and projects undertaken followed by asking choice of language. On a shared editor, I was asked to write a function for itoa(). It ended with questions about Bloomberg and why bloomberg?",
        "questions": [
            "write function for itoa() in c++  "
        ],
        "date": "Feb 13, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "5 weeks",
        "role": "Financial Software Developer",
        "details": "I met the Bloomberg team at a YHack 2014, and was immediately impressed by the product. I applied that year, and received a phone interview, which contained mostly algorithmic questions. This year, I applied again, received a phone interview, and was asked questions questions of the same variety (difference between C++ and Java, difference between a BST and a hash table). They also covered some aspects of my resume, and…  asked me to describe a project I had worked on, some challenges I faced, and how I overcame them. I heard back that same week that I'd received a campus interview with them in New York, which I've yet to attend.",
        "questions": [
            "What is the difference between stack and heap memory  "
        ],
        "date": "Nov 23, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "Some basic buddy coding on one of the many sites with an engineer, then some basic personal questions, in-person interview follows that. The process itself is straightforward and standard, but that's about the only bonus to this thing.I ended up dropping out right after the initial buddy coding over the phone. The guy clearly didn't want to do it. He sounded like he wanted to die over the phone, and…  when he'd ask questions, he'd constantly interrupt my thoughts by huffing and puffing and letting out long, drawn out sighs into the phone receiver while I was trying to work. The questions weren't even hard, but when you're already nervous, having someone sound like he's letting out dramatic groans of death on the phone really doesn't help you think. If working at the company is anything like this interview, I'm not interested at all.",
        "questions": [
            "Write code to reverse a string.  "
        ],
        "date": "Apr 14, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 days",
        "role": "Financial Software Developer",
        "details": "Had four on-campus interviews following a career fair--three technical and one with an HR guy. I was allowed to use any language. There were six questions. Two were about implementing some common function, such as a String class constructor. One required partitioning a list around a given element. One required merging two schedules that might overlap in some parts into one schedule. The last two are described below.",
        "questions": [
            "You're given a binary tree--not necessarily complete or proper--and you need to give each node a \"friend\" pointer that points to the node to its right in the tree. This node is on the same level but is not necessarily a sibling, which makes the problem a little tricky. The friend pointer of the node farthest to the right on each level should be null.  ",
            "You're given two arrays of the same size filled with positive integers, and an integer 0 &lt;= N &lt;= 255. You need to determine whether N can be written as the sum of some number from the first array and some number from the second array.  "
        ],
        "date": "Oct 1, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4 weeks",
        "role": "Financial Software Developer",
        "details": "Applied Online. Scheduled 1st phone interview within two weeks of applying. Scheduled on-site a week later. Heard back about an offer two days after the on-site.Very satisfied with the entire process. HR was fast and competent.Phone screen consisted of two questions on HackerRank. First question was coding a typical technical question. Second question was a design question, no code.Onsite was an onsite-day so there were many applicants interviewing at the…  same time (you still interview by yourself though). Four rounds in total. First two are 2:1 with engineers and very technical. You write code on pads of ~6x8 paper (wouldn't have been my medium of choice). 3rd round is a 1:1 with a senior engineer/engineer manager(?); no coding. 4th round is with HR.Interviewers were very friendly and willing to nudge you if it looked like you were getting stuck. They all seemed very intelligent which was a bit intimidating. The questions were also interesting and fun. First round was more algorithms and second round more data structures but that may have just been a coincidence.",
        "questions": [
            "Data Structures and algorithms.  "
        ],
        "date": "Oct 21, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Financial Software Developer",
        "details": "One 45 min phone interview followed by on site interview with three team members.The phone interview was quite easy. Standard technical C++ questions related to exceptions (what happens when a destructor or constructor throw one, what are virtual functions, etc). Nothing very difficult. He also asked what books about C++ and which important C++ people/blogs I follow.In person interview went well I thought. The first interviewer asked me to implement…  merge sort. The other question was to find k largest values in a very big vector efficiently. The second interviewer asked me to design an interface to a function (or a class) that finds a zero of a give function and he wanted to see the most general interface possible. The third interviewer, the guy who I had the phone interview with asked me about smart pointers and writing an exception safe assignment operator. All three were very nice and guided me through the process. I did stumble on few of the questions but eventually ended up answering all of them.",
        "questions": [
            "C++ template metaprogramming (that team was into functional programming and compile time computations). Standard, find nth Fibonacci number using recursive templates.  "
        ],
        "date": "Oct 8, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "6 weeks",
        "role": "Financial Software Developer",
        "details": "I applied online near the end of August and they got back to me about 2 weeks later to schedule a phone interview. The phone interview was scheduled for about a week later. He asked a pretty standard interview question, and I coded it up online where he could see (I think it was on a HackerRank page). I thought they prefered C++, but he asked me if I wanted…  to do it in Java and I said yes because I'm more comfortable with that. I don't actually think that hurt my chances in any way. That question went fine, and then he asked me a few follow ups about scalability and bugs to check for. Then he went into some very specific C++ questions, which I stumbled through since I had only taken a semester of C++. Somehow I passed that interview and made it to the in-house. About a week later, my recruiter asked me which of 3 days I preferred to come to NYC and interview. A few days later they made travel arrangements. During the in-house interview, they give you a little tour of the office first then you meet with your interviewers and go to a conference room. Again, questions were very standard. You have to do them on a sheet of paper. The first interview there were 2 engineers, and they asked me 3 technical questions. I blanked out especially on the first question even though it was pretty easy. The second interview was just one person, and he asked me a fairly easy question, which I got right away and he said that was all he had for me so we talked for a bit before he let me out. Interviews themselves took about 2 hours total (but there's a small break in between). A week later, I got rejected--not unexpected considering I didn't do well on the first interview.",
        "questions": [
            "The C++ specific things really threw me off. Other than that everything was very standard.  "
        ],
        "date": "Oct 8, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Difficult Interview",
        "length": "2 weeks",
        "role": "Financial Software Developer",
        "details": "I applied online on a whim and got an e-mail response a few weeks later to set up a phone/technical interview. They hold technical interviews online through HackerRank. The interview began with three or four standard interview questions (questions about my resume, why Bloomberg, etc) which took about 5-minutes. The rest of the 45-minutes was all technical / algorithm stuff through HackerRank (see included questions). I struggled with the first…  (never really got anywhere) and then he told me to move on to the next one. Came up with an okay solution to the second one, O(n*log(n)), but he kept asking me if I could do it better. Ended up telling me a solution and then asking me to implement it (super simple).Overall, I felt like I was being grilled the whole time and it seemed like he didn't care about what I was saying unless it was me getting the questions exactly right. I know I didn't do so great on the interview. Got an e-mail a few days later saying they weren't interested in moving forward.",
        "questions": [
            "1. Implement a queue using stacks2. Search through an array of integers and find pairs that add to a target  "
        ],
        "date": "Nov 12, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "over the phone, coding on my computer that was being monitored by my interviewer remotely. did the entire call from my college dorm room. The person on the phone had a thick accent so it was difficult to understand the questions he was asking. the interview tends to be about 5 to 6 coding questions and lasts a full hour.",
        "questions": [
            "given an integer (say 1234), write a function to reverse that number as an integer (ie 4321)  "
        ],
        "date": "Oct 29, 2015"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "7 weeks",
        "role": "Financial Software Developer",
        "details": "Applied online on Bloomberg's website. Got back from an HR in 3 weeks. After that, there were 2 technical phone interviews and 1 on-site interview including technical interviews and behavioral interview. All those people from Bloomberg are patient and super nice. Visited Bloomberg headquarter during on-site interview, great experience! Top 1 choice if you want to work in a financial-related IT company in NYC!",
        "questions": [
            "Design an cache  "
        ],
        "date": "Feb 14, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2+ months",
        "role": "Financial Software Developer",
        "details": "1 round of phone interview(~1h). After that, they sent me an invitation for an onsite. Onsite contains 2 technical interviews, each with 2 engineers, 1 interview with manager(still technical), and 1 interview with HR. My HR interview is kind of an informal chat about their recruiting strategies.",
        "questions": [
            "Questions about if their locations(NYC) matters when I am choosing offers.  "
        ],
        "date": "Oct 13, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Difficult Interview",
        "length": "2 days",
        "role": "Financial Software Developer",
        "details": "I applied through my college - 3 rounds of technical interview1st round : They asked me to select a data structure for storing a dictionary that i have to use for searching words with given letters.It is similar to that of SCRABBLE game.Passing a multi-dimensional array in c89 and other variations.2nd round : Design a class that takes any length integer (memory is the limit) given as string and implement…  constructors , addition by operator overloading (as i've told them about my choice of C++).3rd round : Write a code to find the common letters in two strings. He was more interested in how his input will break my code and how will i overcome it and what will happen at OS level.HR round: You have done some electronics stuff - arduino & stuff then why financial software developer?What are you top 3 priorities?What other companies you have applied for?",
        "questions": [
            "Why Other Company?(unexpected .... i was prepared for Why Bloomberg but not for this)  "
        ],
        "date": "Oct 19, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Financial Software Developer",
        "details": "The interviewer was pretty straight forward. We went over my resume, my current interests and goals. We then went over the technical questions using Hacker rank's Code-pair. The interview questions weren't too hard. The interviewer was pretty helpful though, giving away some hints. Being a freshman, I was underprepared.",
        "questions": [
            "Generate the first n prime numbers and time complexity.  "
        ],
        "date": "Jun 30, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Financial Software Developer",
        "details": "Took 2 weeks for the recruiter to call me and then a week later the interview was scheduled. Questions were easy c/c++ based questions but tricky in the sense that they were not logic based but relied on your level of preparation in that area.",
        "questions": [
            "What happens when you assign a string literal to a pointer using strcpy  "
        ],
        "date": "Oct 14, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "This was in a college on campus career fair. It was not an interview call.How to remove duplicates from a linked list ? Use of HashmapBasics of Depth first search and Breadth first search? Which data structure to represent each of them?",
        "questions": [
            "How to remove duplicates from a linked list  "
        ],
        "date": "Oct 7, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2+ months",
        "role": "Financial Software Developer",
        "details": "From the online application (bloomberg website) to the phone interview took around 4 weeks (a first interview was scheduled within 2 weeks but the interviewer didn't call so we rescheduled). The phone interview was quite straightforward and I was asked the following questions1- Kind of a strange question. Generate all 3-digit combinations of 1-9 but not repeats in the sense that if you have 123, then 231, 321, etc. are…  not allowed. [nested for loops]2- Reverse a given sentence (no use of library methods, arbitrary spaces between words). Make it faster. [start at the end and find and print words one-by-one].3- You are given a 3L and a 5L container and unlimited supply of water. How to make 1L?[I found a longer solution but the short on is pour 3L into 5 twice.]4- A program/algorithm which given mL and nL buckets figures out how (if possible) make kL. [we discussed the solution and the interviewer was nice and gave me a hint. Its a DP problem].The next day, I received and invitation for on-site interview. The travel schedule part was straightforward and convenient.I was invited to the NY office. There was a group of around 30 people like me. They hold you for a few minuts to issue a security badge. Then there is a tour about all the 31 or so aquariums and fishes at bloomberg. Eventually, there is breakfast and then the interviews come find you. There is 4 rounds of interview. Rounds 1-2 are technical, 3 is management, and 4 is HR.Some questions I remember:1- Find shortest path on a chessboard from low left corner to top right. You can move right and top only and some cells are inaccessible (DFS).2- You have sorted arrays A and B with sizes m and n. Assume at the end of array \"A\" you have \"n\" empty slots. How to merge with minimum number of operations (start at the end instead of beginning). Prove it works (induction).3- Some runners running in a field with some \"k\" sensors. We get events of runnings locations. How to print the top \"m\" runners? (array of lists or hash table of lists depending on the location of the sensors. each list is one sensor). Some questions on how to identify the ordering within each list.4- CPU Cache implementation. How to implement the least frequently used procedure.5- Scheduling some jobs over \"m\" servers. Centralized vs distributed implementation? How to implement.The management interview was interesting and I liked the two managers. HR was fine too. I did not do any negotiations.",
        "questions": [
            "The chessboard problem. I first mentioned BFS and use of a Queue but the interviewer kept asking about some data structure with less memory that I could extract due to the simple structure of the graph. I did not understand what he meant. I eventually mentioned DFS and proved it works uses less memory.The cache problem took a long time. I kind of though I failed it at some point.…  I had no prior knowledge of the topic since I am not a CS guy. I eventually, used an array to store the access time to different items and O(n) search through it to find the least frequently used one. The interviewer did not raise the complexity. He wanted me to write code on a paper (which is hard, esp. in C).  "
        ],
        "date": "Jul 11, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "Had two round interview... first round was very straightforward, asked typical data structure, graph search, and object oriented questions (linked lists, depth first search, memoization, classes). Second round was much harder, with algorithmically complicated coding problems (the naive solution was usually easy, but the interviewer would then press on for a much more difficult solution)",
        "questions": [
            "Counting the number of anagrams of one string in another string  "
        ],
        "date": "Jul 20, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Negative Experience",
        "difficulty": "-",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "One phone interview and one on site (3 interviewers) plus HR review. Three interviewers are two developer and one manager. Then you get the offer and they do all background checks etc.",
        "questions": [
            "Why do u apply for this job?  ",
            "Tell me on project you did  ",
            "List three sorting algorithms you know  "
        ],
        "date": "May 7, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "2 weeks",
        "role": "Financial Software Developer",
        "details": "Applied online and was contacted a few days later asking to schedule a phone interview for the following week. The interviewer was very nice - asked mostly about my background and a few simple data structures questions.",
        "questions": [
            "How is memory stored?Difference between array and linked list?Binary search tree traversal  "
        ],
        "date": "Apr 18, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "a week",
        "role": "Financial Software Developer",
        "details": "Technology interview, Very friendly interviewersQ1, What is a static variable? What is a static function? Think of a case where you can make use of static variable or static function.Q2, Implement a basic traverse tree in java. Print out the nodes in a tree from left to right/ from right to left.",
        "questions": [
            "Tree Traversal  "
        ],
        "date": "Apr 17, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "2+ weeks",
        "role": "Financial Software Developer",
        "details": "C++ questions, like sizeof implementation, swap code. Simple questions but they expect thorough answers.Maximize profit given a sequence of daily prices by buying and selling only once each.Describe your most complicated work.One interviewer tried to test my bias for action and if I have an urgency to do something quick and finish the goals",
        "questions": [
            "generic swap  "
        ],
        "date": "Feb 21, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "Applied through college career fare , received a mail to schedule a phone interview , pretty standard coding questions , refer careercup , on site call to new york , kind of cheap on travel and food , my both interviewers were canadians , very friendly kept on dropping hints through out the process wen i was stuck",
        "questions": [
            "gave me a tree of 3 level and provided me a number that contains the level number and asked me to code a program that would print the nodes on that level in the tree.  ",
            "gave me a Uint of 1 byte and asked me to match it with pattern of 10101 bits in the content of Uint given through a function called getbits().  "
        ],
        "date": "Feb 19, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Financial Software Developer",
        "details": "I applied at Career Fair and then I got a phone interview. The phone interview is not hard. All he asked is basic C/C++ question and data structure questions. Q1, merge two sorted array. Q2, pointers in C++. Q3, OO design.",
        "questions": [
            "No  "
        ],
        "date": "Feb 24, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Financial Software Developer",
        "details": "I submit my resume during career fair and through website. Then I got two interviews at campus. Today,i 'm going to NY to have my third interview.",
        "questions": [
            "The first interview has two questions, the first asked me to design an algorithms to draw a spiral with 90 degrees turn. Then second one asked me to design a class to add data to an array and delete data. In the second interview, the first question asked me to design an algorithms to calculate the area of a space. I was given only one function, which return a vector…  contains spaces that randomly splited, or 1 if if contains only one pieces of space with only 1 unit area; The second question is to define how two binary trees are equal, then write a function to define that.  "
        ],
        "date": "Feb 23, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "Met the recruiters at the career fair. The initial screen was pretty easy. The next day met with a panel of interviewers which lasted an hour. Was pretty nervous and stumbled even for easier ones. Did not expect behavioral from technical panel who thought I was nervous and tried to ease the pressure.",
        "questions": [
            "Given a stream of integers, how do you find the median of the numbers? Follow Up: Consider the functionality for a corp., to find the median of company, what is the most time effective way of doing it? Now, if having similar functionalities such as average, min, max, variance, etc. what data structures would you use?  ",
            "Generate a random stream of integers without using rand(). Follow Up: What modifications should be done to the program if to generate random stream of integers within limits (max, min) inclusive?  ",
            "Given a string, find the longest contiguous sequence of strings without using additional memory; one or two variables are fine. Pick any one if a tie. e.g. sbcsdfaaiwer; ans: aa  ",
            "Behavioral: What if your manager goes against your decision? Who will you consult and what is the best thing to do if you think that you are right in this case?  "
        ],
        "date": "Feb 17, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Difficult Interview",
        "difficulty": "-",
        "length": "4 weeks",
        "role": "Financial Software Developer",
        "details": "I filled out an application on the company website and was contacted via email to schedule a phone interview. This took place two or three weeks after applying. Eight days later I had the interview.The interview was technical, consisting of story problems to solve. Some of the questions had multiple parts. Because the interview was meant to last 45 minutes, there was time pressure and the recruiter would not move…  on to the next question until I had answered the current question to his satisfaction. When I suggested a less efficient solution for a problem, he would not move on until I found his solution. If I struggled with a question hints or clarification would be given.",
        "questions": [
            "You have 25 horses and a racetrack where you can only race 5 horses at a time. You can only get qualitative comparisons of horses (e.g. horse A is faster than horse B), not actual race times. How can you determine the three fastest horses with the fewest races?  "
        ],
        "date": "Jan 13, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "2 weeks",
        "role": "Financial Software Developer",
        "details": "Phone Interview",
        "questions": [
            "famous top-k questions and ask about my resume  "
        ],
        "date": "Jan 26, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2+ months",
        "role": "Financial Software Developer",
        "details": "Applied Online...Phone Interview.. Not difficult.Question 1: Why make data members private and access them using getter and setter methods when you can access them directly by making them public.Question 2 : Given stock prices of n days. Find when to buy and when to sell stock in order to gain maximum profitQuestion 3 : Given an array of size greater than 'x' and a range 0 to x . Find…  duplicate elements in the array. Hint. You can destroy the array but the solution should use O(1) space and O(n) time where n is the size of the array.On Site Interview:Interview 1 :Interview with 2 software developersStarted with some questions related to my projectsQ1 : Diamond Inheritance Problem in C++. Use of virtual keyword. And how are things handled internally. Basically checked my understanding of vtableQ2 : Can you use virtual keyword with destructors?Q3 : Given heads of two linked lists. Find if the two linked lists intersect.Solution should not use extra memory.Q4 : Reverse linked list. Tested concepts of double pointers, pass by value and pass by reference.Interview 2 :Interview with 2 software developersQ1 : In what case would you use BST over a hash table..Q2 : Insertion in BSTQ3 : Find 'k'th smallest element in BST. What extra information would you require hereQ4: Given a string which has a lot of spaces beween words . Remove these extra spaces in the string eg: \" I love New York \" --> \"I love New York\"Q4 : You get an input in the form [2 lowercase characters , A number] .. eg [aa,10] , [bd, 12]..Given a two letter input, find the last 10 numbers associated with the string..Design a data structure to implement this without using STL. Basically I was asked to design a hash function.Interview 3 :Interview was with a project managerQ1 : Find the first distinct element in an arrayQ2 : C++ does not have byte datatype. How would you create this datatype.Q3 : Lets say I have a code currently executing on my machine. I overwrite the code with a newer version. But the older version is still executing. Why do you think this is happening.Interview 4 :Interview with HRGeneral HR Interview",
        "questions": [
            "Given heads of two linked lists. Find if the two linked lists intersect.Solution should not use extra memory.  "
        ],
        "date": "Mar 11, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Financial Software Developer",
        "details": "Applied through a career fair. Was contacted in two weeks and finally had a phone interview two weeks later.",
        "questions": [
            "Given four arrays containing any number of random intergers, find the intersection of the four arrays. Asked to improve the time complexity till they were satisfied.  "
        ],
        "date": "Feb 9, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Difficult Interview",
        "length": "2+ weeks",
        "role": "Financial Software Developer",
        "details": "The process was pretty straightforward, I applied through their career link and few days later had a phone interview consisiting of just one technical question and they kept digging into the solution.",
        "questions": [
            "US football teams and ranks based on them? Display the top 10 teams?  "
        ],
        "date": "Feb 11, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "2 days",
        "role": "Financial Software Developer",
        "details": "Met them at the college career fair. called in for an on-campus interview the next day and another the day after that.Got a reject email a week later",
        "questions": [
            "Regular programming type questions. Delete a node from a linked list, sort 2 sorted arrays, reverse the words in a string.Another was to find the longest word (horizontal, vertical or diagonal) in ann x n matrix of letters  "
        ],
        "date": "Dec 15, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Difficult Interview",
        "difficulty": "-",
        "length": "4+ months",
        "role": "Financial Software Developer",
        "details": "Met someone at a campus career fair and left them my resume. Was contacted after a few months via email asking if I wanted an on campus interview.",
        "questions": [
            "Write code for a C program that takes in roman numerals and outputs decimal numbers.  "
        ],
        "date": "Dec 5, 2013"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Negative Experience",
        "difficulty": "Difficult Interview",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "Scheduled oncampus interview and two ppl interviewed for one hour.No introduction of themselves,no introduction of the position for which I was being interviewed and looked uninterested.Asked two coding questions and were continously emphasizing on lowering down the complexity.",
        "questions": [
            "Remove consecutive duplicates in a string inplace and less than O(n)  "
        ],
        "date": "Nov 14, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Financial Software Developer",
        "details": "Bloomberg came to my school career fair. I chatted with a representative, ended up getting an interview out of it. The first two interviews were both about an hour technical. The first one had a few questions about prior experience, while the second one was over an hour straight of writing code. The third interview was half technical and half behavioral. They were very timely in getting back to me…  about the interviews.",
        "questions": [
            "If you have two very large integers, how do you calculate the product if the product is too large to be represented by your computer program.  "
        ],
        "date": "Oct 1, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2 weeks",
        "role": "Financial Software Developer",
        "details": "Submitted my resume at an on-campus career fair, and got a call several days later to schedule a on-campus interview the next morning. Talked with 6 recruiters the next day. After about five days, got the offer.",
        "questions": [
            "Not many, mostly technical questions focusing on coding, two or three behavioral questions such as why Bloomberg and what's most important for you other than money etc. I use Java though Bloomberg uses C++ most.  "
        ],
        "date": "Oct 11, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Financial Software Developer",
        "details": "Met the company reps during the university career fair and was immediately scheduled for on campus interviews. There were three rounds of interviews with the standard set of data structure questions. The third round was mix of HR and tech. I did well in all the three (at least I thought so from my answers and their responses), but got a reject mail 3 days later.",
        "questions": [
            "Find the first non-repeated number in an array.  "
        ],
        "date": "Nov 5, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Average Interview",
        "difficulty": "-",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "First talked about my previous experience, meanly about a project I did last semester. The recruiter generate a problem about sorting and ask me to write the code on a piece of paper and then think of testing cases to test the program. A second question is about find the first duplicated digit in an integer.",
        "questions": [
            "I was not very confident to implement a sorting algorithm, so I just write a bubble sort.  "
        ],
        "date": "Oct 2, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Financial Software Developer",
        "details": "Have phone interview. In that one, I was Asked CS fundamental questions and OOP concepts. Mainly about c++.Next week, I was invited to their company to have an IN-House interview. Have two rounds of tech interviews. And HR came in and told me they will reply me within 5 days.",
        "questions": [
            "Give a function called \"fun\" and imagine what does this function do.  "
        ],
        "date": "Sep 12, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 days",
        "role": "Financial Software Developer",
        "details": "I was interviewed on campus ( University of Maryland ,college park ) . I got a call through career fair . The first interview happened at the fair itself, I was asked a simple mathematical questions , and a simple programming questions .Then there were 2 back to back tech interview . Some of the questions that were asked :          Given a list of exchange rates , between several currencies .…  Find out if it is possible to profit while moving through currency , exchanging , and ending up at the same currency you started with .          There was a question about implementing vectors ( from STL ) .         To implement a queue by using stacks .Third interview was a not really technical although person asked me about python , asked me to write some basic code in python .",
        "questions": [
            "The question about inner workings of templates in C++, syntax etc , was unexpected . I had coded and prepared from a more algorithm and data structure point of view . I knew some these c++ internals , but that was not the skill i was showcasing . I have given other interviews , and such software companies ,rarely ask these language specific questions . As a result whatever interviews…  i gave post this one , i claimed to know only C, lol.  "
        ],
        "date": "Apr 8, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "a week",
        "role": "Financial Software Developer",
        "details": "I went to my school career fair, and I got an interview with Bloomberg by talking to them and solving their problems in place. There were 2 rounds; each round they asked me technical questions about hash tables, linked lists and also behavioral questions like \"Have you ever imagined what you would do in our company?\"",
        "questions": [],
        "date": "Apr 9, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "I got the interview from a on-campus career fair. The first day was pretty easy. The interviewer started off asking me about what I knew about the company, what I would do in the company if I got a job offer. Then, he asked me a simple but required logic thinking + correct implementation on the spot problem that I have never seen. At the end of the interview, he…  set me up to the 2nd interview which was the day right after it. The second interviewer asked me the same behavioral questions, and he gave me a problem about hash table, another problem about linked list. I got a rejection a week after that.",
        "questions": [
            "The 3n + 1 problem on UVA online judge.  "
        ],
        "date": "Dec 3, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Average Interview",
        "difficulty": "-",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "Applied at career fair, got a response after a couple weeks for an in-person interview. Interviewer asked about linked-lists and basic details about what I was interested in. I wrote my answer in Java but the position was for a C++ position. Another person I know was asked questions about bit-shifting and C programming.",
        "questions": [
            "Nothing unexpected or difficult.  "
        ],
        "date": "Dec 18, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "Campus job interview was a streamlined version of actual interview. So it helped me land in a job quickly",
        "questions": [],
        "date": "Aug 2, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Financial Software Developer",
        "details": "The phone interview was mundane and consisted of typical Data Structures and tell me about your projects type of questions, one good question was to when does the compiler necessarily not make a function marked inline as inline. I was also asked a puzzle.Was invited for the onsite interview, had my interviewed scheduled at 12:00 pm. Started the interview at around 12:05 pm, the first few questions where the general…  tell me about yourself and your projects. Then asked me about multithreading and problems associated with it, then asked about when deadlocks would occur. Difference between Semaphores and Mutex, by this time there where two interviewers, one shadow, one fairly senior, enter third interviewer at 12:13-12:15 pm, again, tell me about yourself etc.. The new interviewer asked me how to find the square root of a number without using the square root function, I knew the solution, he however asked me return the closest integer, so I was trying to figure that out, wrote a little code and he suddenly tells that's okay and asks me to write a test utility function for the sqrt function, i.e given a number and a possible guess please return if its actually the sqrt of the number, fair enough, it would just be a simple if else statement once we have used our sqrt function previously written. He had this you-are-wrong kind of face on, I was really worried and got all tensed. In hindsight, I guess he just expected me not to use the sqrt function and return true/false using just the utility function, I feel slightly flustered now, mainly because he could have just asked me that, it was neither a trick question nor a question that required a lot of thought. Anyways, now the senior interviewer asks me how to find if two lists intersect, I explained it to him (the answer is in CareerCup I guess), asked him if I should write the code, he told that wouldn't be needed. Then the other interviewer asks me about String compression, and a simpler version actually, as in aaabbbaacc would be a3b3a2c2, that was simple, told him how I could do it, in the hindsight I feel I should have given a in-place solution ( not a big deal, just required him to ask me a couple of questions on it or clarify if there is an better space efficient code is possible), again, asked him if I should write the code, he says no. The time is 12:52 PM, the guy who came in late wrapped the interview telling its almost time up, I said we could go back to the sqrt function and figure out if the solution I gave would work with a little tweaks (it would work). Then they ask me if I have any questions for them, etc etc. 12:56 PM they wrap up the interview, and they ask me to wait in the room, 15 mins later the recruiter comes in and tells me that they wouldn't continue with the interview. I felt shattered, I did not expect it at all, I did answer their questions. What was depressing was that they judged my performance on a single round of interview, I would have been okay if I actually performed bad, but my performance definitely warranted at-least may be another round to judge me, it was surely not soo off-mark that I had to be sent off immediately. Definitely this was one of the worst interviews I've faced, mainly because their perception of you is that you are a bad candidate and the interview is focused on assuring themselves that you are indeed bad rather than trying to get the best of you assuming you are actually good. Another evident problem I could see was that they just don't care, why?, because the interviews are basically general, once you've finished your training you need to again find a team that is wiling to accept you, since the interviews are general and they know that you may or may not be a part of their team, they don't care losing you. The i-don't-care attitude was so evident when I saw the guy came in late + he yawned in between the interview.The post probably makes you feel that I may be sore loser trying to vent my opinions here, I can assure you I am not, I've gotten over the interview and just wanted to give you guys a big heads-up for your interviews.",
        "questions": [],
        "date": "Apr 9, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Easy Interview",
        "length": "2+ weeks",
        "role": "Financial Software Developer",
        "details": "Applied to 2 new grad positions with identical job description. Got reject for one position and about a week after that got an email that they are interested in scheduling a phone interview for the other position.I have about an year and half of work experience so I was asked a few questions about my current job and explain how the whole system works. Then I was asked some very…  mundane computer science fundamental questions. I felt the interviewer was interested in definitions from the textbook. Then he asked me a simple coding question (Loop in a linked list) and just asked me to explain the algorithm. Finally he asked a puzzle.",
        "questions": [
            "Explain ACID principle of databases.  "
        ],
        "date": "Jul 14, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "Applied at Senior year at the career fair. They called me after 2 weeks and invited me to New York and had interview and I was offered.",
        "questions": [
            "What is the greatest challenge of providing financial information to customers?  "
        ],
        "date": "May 20, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Difficult Interview",
        "length": "2 weeks",
        "role": "Financial Software Developer",
        "details": "Applied online and received an email to set up an initial phone screening. It was frustrating as they contacted me for a different position than the one I applied for, and was unqualified for it.First interview was a typical candidate screening, heavy on work experience and education from my resume, with some behavioral questions.Made it to the next round which was a technical phone interview. The interviewer was very nice,…  guided me trough the questions, even explaining answers to the questions I did not know. As expected I did not move on the further rounds as my background did not fit and thus could not answer all of the questions posed.",
        "questions": [
            "Very in depth CS questions on topics such as binary trees, algorithms, try/catch blocks, OOP, etc. If you come from a CS background (which I did not, despite having programming experience in my current position), these are your run of the mill questions for a software development position.  "
        ],
        "date": "Oct 23, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "Phone Interview",
        "questions": [
            "Questions about resume then 1 Prog Question on Data structures  "
        ],
        "date": "Apr 22, 2013"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "Basic algorithm questions, linked list, find prime numbers, number of zeros in the end of n!. Need to code with paper and pencil. Not very hard comparing to other IT companies.Object oriented design problem. Not hard, just apply the ood principle and proper design patterns.Many behavior question such as why bloomberg, what is 5yrs goal, 10yrs goal, how to be a leader.",
        "questions": [
            "Josephus problem. Not easy to get the trick if see it for the first time.  "
        ],
        "date": "Apr 6, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Financial Software Developer",
        "details": "Posted my resume and cover letter through their website. Got an phone interview three weeks later.The phone interview lasted about 50 minutes. Questions include some details about underlying in JVM and C++.Did not expect them to ask questions on Java, because they seem not working with Java.And he asked me some other very very easy questions on array. HOWEVER, I could not understand his accent. Even though I repeated his…  question twice to him, he said yes, I still misunderstood what he meant.",
        "questions": [
            "1) Differences between C and Java2) Details about JVM3) What are compiler, linker and loader.  "
        ],
        "date": "Apr 11, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Average Interview",
        "difficulty": "-",
        "length": "2 weeks",
        "role": "Financial Software Developer",
        "details": "Algorithms, Big(O), Data Structures",
        "questions": [
            "Hash-tables usage with algorithms and self created questions  "
        ],
        "date": "Sep 30, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Difficult Interview",
        "difficulty": "-",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "on campus interview with 2 interviewed, around 45 mins. Basically all questions are from your resume.... what you did before, what you learned before....also asking the questions about programming from your resumethey seem to like people who can write C++ and database",
        "questions": [
            "they asked questions from what they got from your resume  "
        ],
        "date": "Mar 5, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Financial Software Developer",
        "details": "I applied online and got an email from a recruiter for scheduling a phone interview. The telephonic interview was not very hard, basic C and C++ concepts like1) The difference between struct, union and class2) malloc vs new3) what does malloc return when it cannot allocate memory?After a week or so, I was asked to come to their NYC office for an onsite interview. Bloomberg has interview days and on…  every such day they have around 18-25 candidates for interviews. My interview panel consisted of 3 members, 1 was a shadow interviewer and other 2 were the one's who were actually doing the interviewing.The interview was not very hard. I had a coding question on string reversal. Another one was on data structures and you should absolutely know which data structure is to be used in what situation along with the complexities for each of the operations. If you don't, then you have slim chances of answering such questions. My last question was the hardest one and required databases and multithreading combined together to form the solution. The interviewer had sort of mugged that question and had come for the interview. When I asked her to explain a little bit more, she kept on saying the same things again and again. Finally, the other interviewer had to intercept, reinterpret that question, confirm his understanding with the other interviewer and then had to explain it again to me.Overall, it was a very bad experience. The culture is not very good and you can actually sense it from the interviewers' attitude. One of my interviewers was all the time texting on his cellphone when I was given a chance to ask them questions. That was pretty rude.Warning - Check out the culture from someone inside that you know before you join!",
        "questions": [
            "Nothing was difficult as such  "
        ],
        "date": "Mar 22, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "I went to the Bloomberg table at the campus career fair. They asked me a simple programming question, which I correctly answered. After that they had me schedule an on-campus interview for the next week. The interview was 2 rounds, separated over two days. The first round was more technical, I was interviewed by two software developers who asked me questions about my programming background before getting into the technical…  questions. The next day I talked to a single person, where they asked me one technical question and a lot of basic questions, such as why do you want to work at Bloomberg? etc. Overall, the experience was good, although the interview area seemed to be a bit out of order and hectic.",
        "questions": [
            "Give an algorithm that will calculate and print out all possible combinations of quarters, dimes, nickels, and pennies in order to get a dollar.  "
        ],
        "date": "Oct 2, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "a week",
        "role": "Financial Software Developer",
        "details": "One online test, picking from C/C++/Java/C#, not so easy.Then one phone interview, asked a lot of questions, not hard, but need to be well prepared.Then onsite interview. 3 arounds. Most of the time is solving basic algorithm problems.",
        "questions": [
            "reverse a string by words, find the only duplicates in the range of [1-n]  "
        ],
        "date": "Feb 18, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Difficult Interview",
        "difficulty": "-",
        "length": "2 days",
        "role": "Financial Software Developer",
        "details": "Met the recruiters at a Campus Career Fair. Got shortlisted for an interview. The Interview lasted almost an hour.Two Questions asked.",
        "questions": [
            "Write down the implementation of Polynomial Class in c++, with all possible functions, constructors etc. (You need to accept something of the form 2x^12+5x^2+3 from the user)  ",
            "Implement itoa without using any inbuilt functions.  "
        ],
        "date": "Feb 13, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Average Interview",
        "difficulty": "-",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "There were 3 questions: 1 simple coding, 2nd on data structure and 3rd logic based. I had submitted my resume online, and they replied within 2 weeks, asking for a convenient date to schedule a phone interview. Sp the interview process was smooth.",
        "questions": [
            "I got stuck at the logic question, the answer didn't strike me at that time. The question was :There are 100 bulbs, all off at first. In the 1st round, all bulbs are switched on, in the second round every second bulb changes state, in the third round every third bulb changes state and so on. Which all bulb will be on at the end of 100th round?  "
        ],
        "date": "Feb 20, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Easy Interview",
        "length": "2 days",
        "role": "Financial Software Developer",
        "details": "Three rounds. Two technical and 1 HR.Questions: Clear a linked list, all possible sets of n moves that an elephant can make in a chess board, calling overridden (virtual) method from a constructor in C++Find lowest common ancestor in BST, Return kth largest element in a BST, Two containers each of size 30 ml and 50 ml volumes. How to measure 40 ml in the 50 ml container.",
        "questions": [
            "HR interview was unexpected.  "
        ],
        "date": "Mar 11, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Average Interview",
        "difficulty": "-",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "on campus face to face interview: why bloomberg? some IQ questions.Then phone interview: how to find duplicate number in an array.",
        "questions": [
            "IQ questions  "
        ],
        "date": "Jan 9, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "1+ week",
        "role": "Financial Software Developer",
        "details": "1 online test, 1 phone interview, and followed by an onsite interview",
        "questions": [
            "Questions about multithread  "
        ],
        "date": "Jan 31, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Average Interview",
        "difficulty": "-",
        "length": "3+ months",
        "role": "Financial Software Developer",
        "details": "Bloomberg visited the career fair of my univ in Sept. I visited their booth and was asked some questions about resume and data structures like the intersection of two arrays. I was asked to give very specific description of how to solve the problem. I then was asked to apply on their website.2 month later, I got an email for a phone interview. However, it was delayed by another month,…  because of Sandy. The phone interview is all tech questions about algorithm, data structures, and probability.After a week, I was invited an in-house interview. Since I am in NY state, they refused to book me a flight to nyc and asked me to take bus.The interview was in their headquater in manhattan. I faced 3 developers. And the questions were all technical. I failed in one brain teaser, so I didn't get inot the next round.",
        "questions": [
            "Given 10 cups to locate the bottle poisoned wine from a batch of normal ones, you can make any mixture of them and test your mixtures by mouses. However the density of poison in the mixture, the testing mouse will certainly die. And you must give all the mixtures of the 10 cups before the test. There is only one poisoned bottle.How many bottles of wine you can test at…  most?  "
        ],
        "date": "Dec 8, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "6 weeks",
        "role": "Financial Software Developer",
        "details": "The process started with visiting the Bloomberg LP booth at my university. I gave them my resume and we discussed a project or two. I then asked if they were doing interviews on campus and they told me yes. Before I could get a campus interview, I had to answer a few questions at the booth. These questions were brain teasers and C++ specific language questions. Upon impressing the recruiters…  at the booth, I was offered the on-campus interview.Next, I met with two campus recruiters about a week or two later when they were in town. It was a technical interview with a few HR undertones to see if I had done my research. Questions were mostly based on system architecture: \"how would you design a stock tracking system...?\" and data structures: \"how would you implement a queue using only the stack data structure?\"A couple weeks later, I heard from an HR representative who invited me to an on-site interview. They flew me to New York and I stayed in a hotel the night before the interview. I got to Bloomberg Tower at 10:30 am and the interview was at 11:00 am. You will be asked to check in at the front desk 15 minutes before your interview. You will have your picture taken and they will print a visitors badge for you. Then you will go up to the sixth floor and wait for your host to come greet you. My host came for me a couple minutes later and took me to a conference room on the 23rd floor of the building. The view was phenomenal. I had a fantastic view of Manhattan and Central Park.The first interview was 2-on-1. One of the interviewers was a project lead and the other was more fresh. They started with the some questions about me and my resume. I got to tell them about my favorite project and show some enthusiasm for my work. Next they asked some technical questions. Specifically the questions were algorithms and data structures questions.The next interview was 1-on-1 with someone more senior. From what I gathered he was a team lead - mobile development if I recall correctly. His questions were very direct and he made it clear that he was not trying to trip me up or ask me trick questions. He was very blunt but it was one of the best interviews I have had because the pressure was on and I had to think on my toes. His questions were of an HR nature mostly. The toughest and most surprising question he asked was \"There are many large companies with many of the same things to offer as Bloomberg LP in the city, eg Google. If a friend was there and mentioned they had opportunities available, would you pursue an opportunity there?\" See the answer below. After the HR questions, the interviewer asked me a number of coding questions ie find the bug in this code.The last interview was strictly HR stuff - including the dreaded \"do you have any expectations with respect to compensation?\" I used some of my knowledge from this website to answer with a range and tell her that I expect at least the average salary to be competitive. The HR interviewer said they routinely offer higher than the number I requested.At the end of every interview I was given the opportunity to ask questions.I heard from HR in only 3 business days with an offer.",
        "questions": [
            "There are many large companies with many of the same things to offer as Bloomberg LP in the city, eg Google. If a friend was there and mentioned they had opportunities available, would you pursue an opportunity there?  "
        ],
        "date": "Oct 28, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Difficult Interview",
        "difficulty": "-",
        "length": "3 days",
        "role": "Financial Software Developer",
        "details": "First Contacted by HR, Discussed little technical topics and more on the resume.2nd technical interview for an hour, asked questions listed below:1. about merging in linklist2.cycle in linked list3. Perfect shuffle of cards4. First repeating number in array5. Mising and repeating number in array for different ranges.6. Design of CHESS with some variation.(like intrducng new pieces n new rules)",
        "questions": [
            "Design the ChEss board game- actually askd to write some code.  "
        ],
        "date": "Nov 27, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "5 days",
        "role": "Financial Software Developer",
        "details": "Campus three round",
        "questions": [
            "Nothing difficult, most of the data structure and algorithm could be search from websites. There are three rounds, I went through all and finally got an rejection. No idea....  "
        ],
        "date": "Oct 17, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "4 days",
        "role": "Financial Software Developer",
        "details": "First Round is the online test about C language knowledge.Second Round is the 1:1 technical interview on campus.Third Round is the 1:1 technical interview on campus.Fourth Round is the technical interview with manager and the behavior interview with HR.",
        "questions": [
            "How to reverse a string by word like \"I love California\" to \"California love I\"  ",
            "There is a linked list, only given the pointer of one node, how to delete that node in the linked list.  ",
            "Some knowledge about virtual memory, memory segments, data structure like BST and hash table, write down the binary search code.  ",
            "knowledge about static keyword, write down the itoa function, the difference between memcpy function and memmove function.  "
        ],
        "date": "Apr 7, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2 weeks",
        "role": "Financial Software Developer",
        "details": "I applied to the position online, thinking it would go nowhere like all my other online applications. I got an email a couple days later asking me to take an assessment test (it was basically an IQ test). The test was about 30 questions, 3 minutes per question (it was timed per question) and the questions ranged in difficulty. I certainly didn't get all of them right, far from it.…  After that, I got an email asking me to set up a time for a phone interview. I responded, and then 1 week later they came to campus for a career fair. I went up to them and mentioned that I'd already begun the process online, and they took over the process from there. I interviewed 4 times within a week of approaching them at the career fair, and got my offer the following week. 3 interviews were technical, the last one was HR. The first two were knock-out rounds, and the last 2 were actually back to back, I went from the 3rd interview right to the 4th.",
        "questions": [
            "Say I have a deck of 52 cards, regular deck of cards. I put a joker in the deck somewhere and shuffle it up. Now I start dealing you cards until the joker shows up. Once it shows up, I stop dealing you cards. What is the probability that you have, in your set of cards, all 4 aces?  ",
            "Implement a square root function  ",
            "Can you cover an 8x8 chess board with dominos if two corner squares are removed (not two from the same side, 2 diagonal from each other). A domino covers 2 squares and no dominos can hang over the side of the board.  ",
            "There is a panel containing 3 light switches in front of you. Each switch controls a light in a room somewhere. Doesn't really matter where. You can play with the switches as much as you like, but you're only allowed to enter the room once. How do you tell which switch controls which light? Again, you can only enter the room once, so you cannot play with the switches after…  you enter the room, but you can play with them as much as you want before you enter the room. One entry is all it takes to determine which switch controls which light.  "
        ],
        "date": "Jun 28, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "Standard Interview process, with recruiters visiting my school, there were 4 rounds of on campus interviews, roughly 50 minutes each. First 2 where with 2 software developers, then 1 HR interview and lastly a senior executive interviewed me.",
        "questions": [
            "The exact details are a bit hazy, the basic idea was as follows. Implement a storage class using in c++. The storage class had to store doubles in an array and write to both ends of the array, while recycling the space as efficiently as possible.  "
        ],
        "date": "Oct 24, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "6 weeks",
        "role": "Financial Software Developer",
        "details": "The following are the phases in the interview- C Skills test- Phone Interview- On-Site Interview",
        "questions": [
            "How do you remove extra parenthesis in a given equationEx: ((a+b))*c should be converted to (a+b)*c  ",
            "How do you reverse a number without storing it in an arrayEx: 412 should be printed as 214  ",
            "There are several log files coming by date with product ids and I need to report the top 10 (product ids) during a moving period of 1 month. Discussed about the data structures needed to implement the solution.  ",
            "Differences in application development for a mobile platform and a normal pc platform.  "
        ],
        "date": "Feb 15, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "First they asked questions about my background and then I got basic code problem to ask me to print all repeating characters into the form \" 'the character' '#' ' the number' \". Then a problem about data structure and the time complexity and how to modify the data structure and get a better performance in time complexity.",
        "questions": [
            "What data structure will you use to store all the names of clients and if one name is associate to different people then I have to store the number of people who share the same name?  "
        ],
        "date": "Feb 9, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "2+ months",
        "role": "Financial Software Developer",
        "details": "First, On-line test. Problems are like count the number of letters in a sentence.etc.Then I got a phone interview. probability question, math problems and coding problems. 1. Find the biggest number in an array without sorting. 2. given 99 numbers from 1 to 100 no-duplicate, find the number that is not there between 1 to 100; given 98 numbers from 1 to 100 no-duplicate, find the two numbers missing between 1 to…  100.Then I got an onsite interview.Since I am not CS major, they just ask you given a array, how to find the two biggest number.How to randomize a deck of cards. write a program.",
        "questions": [
            "Find the biggest number in an array without sorting.  ",
            "Given 99 numbers from 1 to 100 no-duplicate, find the number that is not there between 1 to 100; given 98 numbers from 1 to 100 no-duplicate, find the two numbers missing between 1 to 100.  ",
            "Given a array, how to find the two biggest number,write psydo code  ",
            "How to randomize a deck of cards.  "
        ],
        "date": "Jan 24, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2 days",
        "role": "Financial Software Developer",
        "details": "First had to go through an online IQ-type test, then about a week later was scheduled for a phone interview. The phone interview mostly consisted of technical questions and skill-based knowledge, with a little bit of work history. After successfully getting through the phone interview, I was invited for an on-site interview in New York. Bloomberg took care of all the travel arrangements, including flight, hotel, and a car from…  the airport. The building was very nice and easy to find. I was given security clearance to go upstairs where I met the HR person who was my contact for the day who brought me to my two technical interviewers. They asked a lot of programming and algorithm questions, and one design questions. Some of the questions were kind of tough, as they were some things that I learned years ago and hadn't needed or touched since. I would recommend that you really brush up on your fundamentals before the interview. I got an e-mail the next day saying that I didn't get the position, so I'm happy that they got back to me so quickly.",
        "questions": [
            "Design an online library system.  ",
            "Write a function that returns the element x positions from the end of a linked list.  "
        ],
        "date": "Feb 1, 2012"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2+ months",
        "role": "Financial Software Developer",
        "details": "Applied online; first had an online test, then a phone interview and finally an on-site interview with HR and three software developers. Asked common technical questions for software developers. Interview was not too difficult and they often help you with the answer. People were very nice and the office in NY is very impressive.",
        "questions": [
            "There is a row of stones leading across a river; you can either step to the next stone or skip that one; how many possible sequences are there to get across the river with n stones  "
        ],
        "date": "Feb 8, 2016"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "4+ weeks",
        "role": "Financial Software Developer",
        "details": "After applying through Bloomberg's website, I received an email about a week or two later saying that I had made it through a round of resume screening and I was asked to take an online skills assessment test. This test consisted of basic IQ sort of things (shape rotations/reflections), or things you might see on the LSAT exam (given 8 statements, what order did the horses place in a race?)2-3…  days after the IQ Test, I was asked to set up a phone interview which took place the following week. Because I don't have a computer science background, they asked \"Get to know you\" type questions about my past experience, and then asked targeted questions that are basically round-about ways to get you to consider computer science problems.Within a week I had been asked for an on-site interview, which I went to a few weeks later. This interview consisted of three stages. In the first, I met with three interviewers who asked me questions to gauge my understanding of algorithms and high level design, and they asked me to write down a program in full syntax for the language I had the most experience in (Java). In the second round, I met with a senior member and he asked questions to gauge my interest and fit with the company, as well as to gauge my ability to transition into an IT position from an engineering background (What makes you think you would be happy doing this type of job every day when your experience is primarily in research?) The third and last round consisted of meeting with a man from HR and he asked very general questions, then gave me a super-brief tour around 2 floors of the building.",
        "questions": [
            "How would you go about designing Facebook's \"Suggest a friend\" feature? How would you choose WHICH people to suggest as friends?  ",
            "Write a java program that can convert a string of numbers (e.g. \"5387\") into an integer (5387).  ",
            "One question to see if I could understand Linked Lists and how to manipulate them, having never heard of them before.  "
        ],
        "date": "Feb 8, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Financial Software Developer",
        "details": "I submitted application online on both my university`s career website and Bloomberg career site. One week later I received a notification of completing an online assessment test. After finished the test, I was asked to schedule an phone interview. Two weeks later in the phone interview, I was first asked about why Bloomberg? Why do you discontinue current interest and choose financial industry? Then asked some technical questions about c++,…  linked list, hash table and BST. After that, three brain teaser questions. Overall, the interview is not difficult, but I think I screwed up because I did badly in behavior questions",
        "questions": [
            "How do you reverse a linked list  ",
            "There are 10 boxes of apples. Each apple in the boxes weights 1 pound, except that one of the boxes contains bad apples, which weights 0.9 pound each. You are given a digital weight (not a scale), and you can take apples out of the boxes. what is the minimum time of weighs to find out which box has bad apples?I gave one solution of 3 times using divide and…  conquer, but the interviewer said that 1 step is possible. So I couldn`t come up with the solution.  ",
            "How to design a good hash function if the key is a person`s name  "
        ],
        "date": "Jan 13, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "It was a online test, my advice is that don't pick Java or C++, C would be a lot easier.",
        "questions": [
            "Dynamic binding in C++  "
        ],
        "date": "Feb 22, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "3 weeks",
        "role": "Financial Software Developer",
        "details": "I had two rounds of on campus interviews. After which they flew me out to New York for final rounds.Interviews start off with a short behavioral discussion, followed by coding questions, and finally there is time for questions.Behavioral questions are very basic 'get to know you' questionsCoding questions are somewhat challenging, and fairly straightforward. Show that you can solve problems and think out loud. Any undergrad CS program should prepare…  you well.I had a very positive experience. All my interviewers were very sociable and nice: people I could see myself working with.The company culture seems to be that of constantly pushing out products with a fast paced release schedule, which could be a pro or con depending on the environment you like.",
        "questions": [
            "Implement a square root function.  ",
            "Given a list of strings, determine if there are any anagrams. What is the running time of your algorithm?  "
        ],
        "date": "Nov 29, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Financial Software Developer",
        "details": "3 rounds interview. Talked with 2 people separately in the first round. One guy just asked me some general questions and the other guy ask me several programming questions like string inversion. In the second round interview, I talked with a manager and he asked me several algorithm questions. In the final round, I talked with a HR first, then I talked with another alumni. He asked me 2 programming…  questions and I skewed up.",
        "questions": [
            "string inversion.  ",
            "write atoi function.  "
        ],
        "date": "Nov 3, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Easy Interview",
        "length": "a week",
        "role": "Financial Software Developer",
        "details": "Took the online assessment test in C. Thought I did not do well as some of the questions were tough, nevertheless made it to the phone interview. The interviewer asked about the projects that I was involved with in the past one year. Asked me to explain why I chose C/C++ instead of JAVA to implement my projects.Then two programming questions: Write code to search and delete an element from…  a doubly linked list. Write a program to reverse each word in a string and remove spaces say \"i am good\" to \"imadoog\", I gave a solution, then he asked me to do it in-place, which I did as well. These are the easiest questions that one can expect so the possibility of messing up is limited. So I was very surprised that I got a reject, I am still wondering how the \"very smart Bloomberg interviewer's\" decide whom to select, may be they toss a coin at the end of the interview or make a decision before they begin!My two cents: Take their interview, but put more energy and time preparing for other companies, cause for this one you never know which way the decision would go!",
        "questions": [
            "Write code to search and delete an element from a doubly linked list.  ",
            "Write a program to reverse each word in a string and remove spaces say \"i am good\" to \"imadoog\".  "
        ],
        "date": "Sep 9, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "Time limited iq test. Given a pattern what would be the next figure, Count the number of \"h\"s in a sentence, simple algorithm. Logic questions that you can find on the net and in some books. Took about 30 min.",
        "questions": [
            "Given a pattern fill a gap or continue with the appropriate figure  ",
            "Count a specific letter in a sentence  "
        ],
        "date": "Nov 30, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Financial Software Developer",
        "details": "One phone interview, mostly technical problems. Followed by the in-house interview. First hour is technical, second hour a case study and behavior questions, and finally talked with HR.",
        "questions": [
            "write the code to calculate Fibonacci numbers  "
        ],
        "date": "Nov 9, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "a week",
        "role": "Financial Software Developer",
        "details": "Applied online through their website. Received an email to take the online assessment test. Chose C as the language of preference. Some of the questions asked were quite tough. I didn't even know if they were asking questions from C anymore. Anyways after clearing the online assessment test they contacted me for a telephonic interview. The interview was simple enough but there was quite a bit of disturbance on the…  interviewers end. I could hear other people talking around him. Don't know if he could even understand me with all that noise around him.",
        "questions": [
            "I was asked questions related to pointers in C. If you choose C as your language of choice then make sure to concentrate on pointers. Another question was what is the difference between arrays and linked lists and which one would you prefer to use.  ",
            "They gave me a piece of code in C and asked what would be the output. Then they started adding more functions to the basic code and building upon it asked me what changes would occur in the output and if the code would compile at all.  "
        ],
        "date": "Aug 12, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Financial Software Developer",
        "details": "The interview took about 30 minutes. I was asked about my Ph.D project for about 10 minutes, and the interviewer sounded like he was not interested in my project at all. Then, he asked me some basic questions about data structure and sorting algorithm.",
        "questions": [
            "what sorting algorithms do you know?  ",
            "complexity of deleting and adding a node to a BST  "
        ],
        "date": "Jul 11, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "I applied online and got an email asking me to take an online technical evaluation test. It was an analytical puzzle solving kind of test.After this I had over an hour long phone interview with some analytical questions and some programming questions on C++.I was then flown down to New York for a 2 on 1 interview. It lasted about an hour.I would rate it as a very good company…  to work for.",
        "questions": [
            "Swap a string  "
        ],
        "date": "May 3, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Easy Interview",
        "length": "4+ weeks",
        "role": "Financial Software Developer",
        "details": "First round of interviewing was skill test -- you can take that test in C/C++/Java or C#I took the test in C - questions were really nerdy focusing on a minute detail or a language feature.Prepare K&R book well for this round.Second round was a phone screen, a guy from their Princeton NJ R&D department called me. I guess he had no idea he was interviewing me for what position!…  Asked some low level questions on OS, Interrupts etc. Questions based on resume, projects. No coding questions.Onsite interview was consist of two rounds (after that they throw me out of their office without having met with Manager) So if you get a chance to meet hiring manager, that's a good sign and you are most likely through.Questions were not difficult.- few conceptual questions on OO programming- remove extra white spaces in a string- singleton pattern implementation in C++I was asked to explain one of the interesting projects not listed on the resume. Both the guys were too dumb to understand the idea.Much expected rejection email after a week.",
        "questions": [
            "remove extra white spaces in a string  ",
            "singleton pattern implementation in C++  "
        ],
        "date": "Apr 29, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "3 days",
        "role": "Financial Software Developer",
        "details": "They are on campus interviews. two 2:1 interviews and one HR interview. I failed at the HR interview. Technical questions are not easy, but I can answer them anyways.",
        "questions": [
            "Insert sort & complexity? binary tree & Depth First Search? reverse number?Classic questions.  ",
            "How to random play songs in a mp3. / turn a number into hex.  ",
            "6 face dice. He rolls 1 to win, and me 6. He rolls first, what's the probability that he eventually win.  ",
            "sorting the red and green balls.RRRRRGGGGGGGG to RGRGRGRGRGGGGG  ",
            "1 step: 1m /2m. How many ways you can walk through a 10 meters road.  "
        ],
        "date": "Mar 25, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "3 weeks",
        "role": "Financial Software Developer",
        "details": "non-cs background.On line test, focus on IQ and logicPhone interview, talking about the current project, and one problem solving question.On-site, 1:1 interview, hr, manager, technology question, basic concept, IQ test, and basic behavior questions.",
        "questions": [
            "compare Fortran, matlab and c++  "
        ],
        "date": "Mar 15, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2+ months",
        "role": "Financial Software Developer",
        "details": "Initially applied online. They had recruiters heading to our school so I was set up with an interview upon their arrival in early march.There were three interviewers present that day, one main guy and two others. I was interviewed by one of the secondary guys, but halfway through the main guy came in and took over the interview. The interview was all technical. First guy asked about matrix coding in…  my preferred language (java) and then asked me to do more with it and then improve upon the code. Then he asked about running times of the two pieces of code. The other (main) guy, wrote a sample code in C and asked me to explain it and then answer questions relating to it. I had no experience in C, which I had already told him, to which he replied \"excellent\". Interview lasted ~1 hour.I heard nothing from them until 3 weeks later (though I attribute this delay to the fact that they returned to NYC and then my area had a big snow storm). I received a call about a second interview. At the second interview the same 'main' guy from before interviewed me . Another technical interview asking me to write a piece of code that had a finance twist, in my language of choice. At the end I was immediately asked to return the next day for the third interview. Lasted ~1 hour.The third interview was actually two separate interviews, first with a senior member, and then with a HR personnel. These were not technical interviews. The senior member presented me with a real world problem and asked what steps I would go about in trying to solve it. The HR personnel was mainly there, in my opinion, to observe interviewees' personalities. Both interviews combined lasted ~40min.I then did not receive word for another two weeks, at which point I was informed (phone/email) that I had been accepted but there were no training positions open. Maybe a week passed before I was given an official offer as a spot had opened up.",
        "questions": [
            "Write a program that given a 2D integer matrix (default value: 0) and a coordinate in the matrix, it sets all of the elements diagonal to the coordinate to a value of 1 (so that if you wrote it on a piece of paper there's an X with the coordinate at the center).  ",
            "Improve on the previous code, then give the running time on the two codes and explain which would be better to use if you were a manager and presented with these two codes and why  "
        ],
        "date": "Jun 9, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "I had two rounds of interview. The first round was going well and there were no bizarre problems. They first asked me to design a tree data structure for storing and retrieving stock prices fast, and then asked a few basic questions about arrays, linked list and hash table. Finally they asked me to design a phone book. I failed on the second round because they had a pressure test…  on me -- I didn't know it was a pressure test until I went home and found out that the program I wrote in the interview, in which the interviewer insisted that there was bugs, was correct. It was my first time seeing this kind of test and thanks for bloomberg for giving me this experience.",
        "questions": [
            "Design a tree structure to hold and retrieve stock prices.  ",
            "How many bytes are actually allocated by malloc(n)? How does free() know how many bytes to free?  "
        ],
        "date": "Mar 8, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "a week",
        "role": "Financial Software Developer",
        "details": "Applied to Bloomberg through career fair. A good thing is they take non-computer science majors as well for software development positions. I had one technical interview and heard back from them after about 4 days for the second technical interview. After this, I was given a date immediately for the next round of interviews, which were financial and HR. Financial is bare minimum and they also want to see your…  problem solving approach in general. HR was quite usual without anything significant.The people seemed to know well. My second technical interviewer was quite knowledgable and knew the stuff he was talking about. There was another interviewer with him who didn't speak much. The first round was with the person whom I met during career fair.",
        "questions": [
            "Some discussion about my previous projects  ",
            "Write a program for the transpose of a matrix  ",
            "If you have an array, how will you find an element?  ",
            "Now if you have a sorted array, how will you search for an element?  ",
            "Write a function for binary search  "
        ],
        "date": "Feb 23, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "4+ weeks",
        "role": "Financial Software Developer",
        "details": "I got a IQ test right after I applied this position. Several days later I had a phone interview which consists of simple C++/algorithms questions. Hours later I received the invitation to the onsite interview. Bloomberg took care of you very well including booking flights, hotels, airport pick up. The final round was weird because I thought I did well but I did not even have a chance to talk…  to the manager. Good luck to other applicants!",
        "questions": [
            "basic brain teasers, and fairly easy data structures  "
        ],
        "date": "Mar 1, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "I actually expect some generic questions like data structure, but it's not what i got. they looked at my resume and found that i have done something in memory management, then go ahead and ask me related questions. The entire interview probably only takes 25 minutes. and they only have asked me two questions which i didn't answer well IMHO.",
        "questions": [
            "How would you go about implementing malloc() and free()?  ",
            "Why kernel offers memory in page boundary?  "
        ],
        "date": "Feb 17, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "I am not a CS major, so they don't ask many difficult questions.1.Dynamic resource management: difference between stack and heap, vector is stack or heap?2. How to revise a const int value?3. find intersection of two arrays4. brain teaser.Overall I think they are hiring more people than last year so they decrease the difficulty. What I met is less difficult than the questions I search online. Good luck to every…  one.",
        "questions": [
            "difference Stack and heap  "
        ],
        "date": "Mar 10, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "On campus interview. Submitted resume on college website. Got called for interviews in the campus. Had 3 levels of interviews max out of which 1 was HR. Very basic entry level questions for college graduates. Easy to get through if you have prior experience with C/C++ coding.",
        "questions": [
            "Reverse a linked list.  "
        ],
        "date": "Oct 19, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "3 weeks",
        "role": "Financial Software Developer",
        "details": "1 online screening test1 phone interview (30 min)3 onsite interviews in one day(30 min each)",
        "questions": [
            "C programming: passing a string with a return argument  "
        ],
        "date": "Jan 31, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "Ask about details in your resumeConcepts:Explain virtual functionspolymorphismstatic inner class in JavaInterview questions:How to implement a priority stack with two basic stacksWhen will use map, when will you use vector and queue?",
        "questions": [
            "How to implement a priority stack with two stacks  "
        ],
        "date": "Feb 4, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1+ week",
        "role": "Financial Software Developer",
        "details": "the first round interview was 2:1 where they asked a few data structures algorithms and bunch of standard brain teasers. the second round interview was with a senior developer where he asked more programming based questions, asked to write java code (traverse a binary tree)... the overall process was very fast and they were very friendly, they emailed within 2 days after each interview.",
        "questions": [
            "write the code to traverse a binary tree  "
        ],
        "date": "Feb 14, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "Applied for a number of positions at the company on their website, received individual emails rejecting me for each position other than one. then emailed for phone interview, then in person interview which they flew me in for. They offered to fly me round trip and provide a hotel room near their manhattan office. Office building is quite impressive, company is all about their open corporate culture, office has incredibly…  small number of walls.",
        "questions": [
            "how many blocks on an n x n megablock are not on the edge?  "
        ],
        "date": "Mar 14, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Financial Software Developer",
        "details": "After applying I got an email from the recruiter to select a programming language of my choice for an online assessment test. I chose C. The questions were multiple choice and primarily on what would be the output and memory allocation types.Then after a week I got a mail for a phone screen.The phone screen question were technical :-Write a code to add commas to integer, e.g., 12345 will become…  12,345 and 1123 would become 1,123.Design a vending machine, which data structure would you use if you want to count the occurrence of each word in a dictionary and some basic resume based questions.After 1 week I was invited for an in-person interview. They took care of me real well,including the flight booking, hotel reservation, pick up from airport etcI had 1 technical round with 2 developers. I was asked to revverse a string in place and also remove spaces, so for example \"Software Eng \" would become \"tfoSgnE\"Also to create a data structure to for the appendix of a book and some questions about what I am doing currently.Now I am waiting for an answer form them :)",
        "questions": [
            "Write a code to add commas to integer, e.g., 12345 will become 12,345 and 1123 would become 1,123.  ",
            "Which data structure would you use if you want to count the occurrence of each word in a book  ",
            "Reverse a string in place and also remove spaces, so for example \"Software Eng \" would become \"tfoSgnE\"  "
        ],
        "date": "Nov 10, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Financial Software Developer",
        "details": "First it was on-line IQ test. Followed by a phone interview about a week later. It took about an hour, brainteasers mainly, since I am not a CS major. Received an invitation for in-house interview a couple days later. First round was 2:1 interview, followed by 1:1 interview with a manager and finally HR person. Very straight forward, brainteasers and algorithms problems mostly. Took about 2.5 hours. Interviewers were very…  friendly and nice, nonetheless received a rejection e-mail 10 days later.",
        "questions": [
            "25 horses problem.  "
        ],
        "date": "Nov 30, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "2+ months",
        "role": "Financial Software Developer",
        "details": "Applied online through university career services office1) went to on campus interview with a few developers who were pretty rude, but somehow i got through2) invited to a bloomberg on-site interview",
        "questions": [
            "three friends with different salaries need to find out their average salary without revealing individual salaries to each other. how?  ",
            "use a for loop to populate an array of ten integers with increasing numbers from 0  "
        ],
        "date": "Dec 7, 2010"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "3 weeks",
        "role": "Financial Software Developer",
        "details": "Originally took personality test. Then timed IQ / Intelligence test. Then got an email about scheduling a phone interview. Had the phone interview, went decently well. A couple brain teaser questions, one or two very general programming questions. Invited for in-house interview, which consisted of a 2:1 interview, a 1:1 interview with a person of higher ranking, and then a short meeting with an HR person. First two interviews were…  fairly technical, more brain teaser questions. Whole process took about 2 hours. Offered job about a week later",
        "questions": [
            "\"You are city director and you want to build a water tower for your city, what do you do?\".  "
        ],
        "date": "Nov 16, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Financial Software Developer",
        "details": "I applied this postition through compus posting.They conducted 2 rounds of interviews, both are in person interview in school. Both interview are conducted on Wednesday and receive an response on Friday of the same week. 1st interview is around 45 min. with a senior software developer. 2nd interview is 45 min. with C++ trainer, follow by 45 min. with manager, follow by 30 min. with HR,80% of the question are…  about sorting, data structure in C++, and SQL. Also, some brain teasers.",
        "questions": [
            "Given a list of 1,000,000 integer (1 to 1,000,000 with no repeat), how to sort the list with only 1 mb of memory space.  "
        ],
        "date": "Sep 9, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "5 days",
        "role": "Financial Software Developer",
        "details": "Got the interview through the University Career Services. The first round was 45 minutes. There were two interviewers who asked the questions from data structures(binary search trees, hashing), file handling, some finance basic questions as I am from the finance background. Got the second round which was also a 45 minutes interview. There were again two people, one HR and one developer. they asked questions on designing iphone music application…  and rest half of the interview was behavioral questions.",
        "questions": [
            "How will you code CAT command in Unix in C++  "
        ],
        "date": "Oct 27, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "3 weeks",
        "role": "Financial Software Developer",
        "details": "why BB?what do you know about BB?why change career path?technical questionsintroduction to this program",
        "questions": [
            "shuffle 50 numbers  ",
            "boxes with orange, apple, mix of orange and apple. all tags are wrong. take one fruit from one of the boxes, fix tags  "
        ],
        "date": "Nov 13, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "Two people in the room to interview me. Describe my resume. Two algorithm problems about mass data searching (search for some number in a big array, etc.). One question about implementation using a language such as JAVA, C or C++. Write code about returning get a message from a function.",
        "questions": [
            "Decide if a number exists in a big array  "
        ],
        "date": "Nov 15, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "I applied online through the website and got an email asking me to take the skills test within 3 days. The test was pretty simple although I had trouble opening the test website and it finally worked when I came back to my school. I am no Computer Science major but I am interested in Finance. This position particularly said that a couple of programming classes is sufficient which I…  had. I still brushed up my C++ fundamentals from the class I took which was apparently not sufficient for the interview. The interviewer had a serious tone which was sort of intimidating. He gave me no option of choosing the programming language I wish to answer the questions in (unlike what most people stated here) and asked me to write code for creating phone book class. I did but I did not give all the functions he expected. He asked me the famous reversing linked lists question but I did not know then that its a popular C++ interview question. I was so nervous that I messed up even the general \"what sets you apart\", \"Why this job\" type of questions. As expected, I was not selected for the next round.My advice: If you are applying for a s/w developer position, even though the requirements do not state you need to be an expert coder, take it for granted that you must be. You should atleast be a CS major if not an expert.",
        "questions": [
            "What are dynamic arrays? What are the differences between dynamic arrays and linked list? How do you reverse a linked list?  "
        ],
        "date": "Sep 27, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "a week",
        "role": "Financial Software Developer",
        "details": "They asked the difference between abstract class and interface, memory management, XML parsing ,advantage of process over thread.",
        "questions": [
            "Advantage of Process Over thread ??  ",
            "Different type of XML Parsers.  "
        ],
        "date": "Sep 9, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "Read a lot of algorithms",
        "questions": [
            "What is polymorphism and why use it  ",
            "Difference between C and c++  ",
            "You are given a series of events. Mark the ones that overlap  ",
            "How will you implement caching in the browser  "
        ],
        "date": "Sep 17, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "Applied through University's career services. Speaking at career fair and dropping resume might have helped. Two 1:1 interviews. The first interview had two very friendly guys who asked all technical questions. Second guy was seemed to be senior and somewhat intimidating at first. He, too asked mostly technical questions but asked a couple of HR questions here and there, just for the kicks.",
        "questions": [
            "How would you print last n elements of a linked list, n being small compared to size of linked list?  ",
            "How would you print a linked list in reverse order?  ",
            "An array of 99 elements contains integers from 1 to 100 with one missing element. Find the missing element.  ",
            "Why Bloomberg? Why software engineering?  "
        ],
        "date": "Oct 1, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "a week",
        "role": "Financial Software Developer",
        "details": "Why FSD?What is your experience, what is related to programming?Technical questionsWhat do you want to ask?",
        "questions": [
            "1-100 integer sequence, how to find the missing 2 numbers  "
        ],
        "date": "Nov 3, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Financial Software Developer",
        "details": "first there's an online test, in which you can choose C or C++ or Javathen the phone interview has a lot of c++ questionsin the last get the onsite. the working environment is very nice with free food and drink.",
        "questions": [
            "a lot of C++, like virtual function, deep copy etc. quite easy questions  "
        ],
        "date": "Feb 28, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "First I had to give an online test on C#.Then there was an easy telephonic interview. Asked questions about my work experience then on sorting duplicate numbers.Even though the interview went ok, I got a rejection the next day.",
        "questions": [
            "Questions on my work experience  ",
            "general questions on algorithms and sorting  "
        ],
        "date": "Sep 13, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Difficult Interview",
        "length": "2 days",
        "role": "Financial Software Developer",
        "details": "asked me Qs on Java and den gradually making it into c++, trees, datastructure,",
        "questions": [
            "given array b find a[i] such tht a[i]=a[n]/a[i] &lt;-- this is the ans  "
        ],
        "date": "Aug 29, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "3 days",
        "role": "Financial Software Developer",
        "details": "Basic IQ/Intelligence Test, no technical question regarding with coding, no question for financial knowledge. Then receive an invitation for phone interview. It is said to be all technical question.",
        "questions": [
            "flow chart  "
        ],
        "date": "Aug 9, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "previsor online IQ TEST kind of hard , the key is to manage time . i probably wont get through lots of graph rotations and mathematical questions .",
        "questions": [],
        "date": "Aug 12, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "The interviewer was welcoming and very knowledgeable. He presented me with a problem that his own team had been working on the year before. Without revealing anything about their own solution, he guided me through the development process and asked me questions about each road block. Topics included data structures and algorithms, caching, and scientific computation. He also asked me to code out atoi in C.",
        "questions": [
            "Implement a platform-independent version of atoi in C  ",
            "Quant's on his team use extremely complex equations to generate 3-D surfaces with thousands of points. What is the most efficient way of storing these surfaces?  "
        ],
        "date": "Feb 19, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "A phone interview that went on for 40 minutes. The interview consisted of questions ranging from basic C to puzzles and problem solving",
        "questions": [
            "static in C, find middle of linked list  ",
            "Given 2 eggs, how would you find the exact floor at which the egg breaks when thrown from a building comprising 100 floors  "
        ],
        "date": "Sep 7, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "First had a basic intelligence test, no preparation necessary. Then a technical phone interview. Should have reviewed my programming for that. Asked about pointers in C++ (a language i have experience with) and i barely remembered what they are. Then he more or less told me about a list structure and asked me a question about using it and sort of helped me through the solution. Has only been a…  day but haven't heard anything. I only posted here to because I want to read how long I should have to wait for a response.",
        "questions": [
            "What's a pointer  "
        ],
        "date": "Jun 25, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "4+ weeks",
        "role": "Financial Software Developer",
        "details": "After applying, I was contacted by Bloomberg R&D recruitment to take an online technical assessment. It consisted of logic/IQ kind of questions, nothing too hard. I don't have a clear cut computer science background so I was happy to take this and not a test on a specific language. About 2 hours after I took the test, I got an email asking me to set up a technical phone interview.…  The phone interview was really nice, some difficult questions (especially since I'm a little rusty with C), but the interviewer was really nice, not intimidating at all. He asked me about my experience with C/C++ and some coding questions specifically about search algorithms. I have a lot of experience with numerical methods so this wasn't too bad. I also got asked a really easy probability question. I was up front and said my experience with C/C++ is limited but I've worked extensively with MATLAB (which is a kind of a lazy C). The phone interview really goes the direction that you take. I think they just want to see your thought process and how you work out problems. I didn't get everything right and I admitted when I didn't know something. Even though the interview was supposed to be 45 min, it lasted over an hour. I figured that was a good sign b/c he wouldn't waste his time on me.Two days after the phone interview, they invited me for an on-site interview at their NY office. I've been informed that it's supposed to last 2 hours. The interview is in a couple weeks. I'm thinking that it will consist of technical and HR-type questions.",
        "questions": [
            "What are your favorite coding features about C/C++?  ",
            "How would you form an index for a book? i.e. finding the words specified, ordering the page numbers per word (needed to discuss data structures a bit)  "
        ],
        "date": "May 13, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2+ weeks",
        "role": "Financial Software Developer",
        "details": "For the moment, the process is on going. Previous posts cover pretty much what's in it. Online skills exams. Mostly logical and comprehension testing. The response for a phone interview came in soon after. This one was a bit tougher. Charades, some coding and details that go back to the basics.",
        "questions": [
            "Find the middle element of a singly linked list  "
        ],
        "date": "May 20, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Financial Software Developer",
        "details": "Applied online and got a notice to take an online exam after a while. The test is mainly about logic questions like rotating a graph and counting the number of apparence of a character in a paragraph. The following interview is more technical. Asked my resume and then the coding questions. As well as the algorithm and data structure questions like BST and its traversal. Questions are not difficult.",
        "questions": [
            "How to print out the value of a BST in order.  "
        ],
        "date": "Jun 12, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Financial Software Developer",
        "details": "Once you pass the skills test it all depends on how good is your day. You might be asked easy questions in the interview or a tough ones. It all depends on the interviewer. C/C++ would do.",
        "questions": [
            "How would you sort a text file full of phone numbers. You do not have enough memory to load all the file contents at once and sort them. You should write back the sorted list to the file in the end.  "
        ],
        "date": "Jun 30, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Financial Software Developer",
        "details": "I applied and received an online test via email the next day. After completing the test (presuming you pass) they schedule a phone interview. This consisted of a couple of brain teaser question such as implementing a stack using 2 queues and a couple of others. After that is the onsite interview. The interviewers were nice but I bombed it anyways. The first question asked how to convert the base…  of a number. There were also a couple of questions about trees.",
        "questions": [
            "Changing base of a number  "
        ],
        "date": "Aug 22, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "a week",
        "role": "Financial Software Developer",
        "details": "The phone interview consisted of general programming how-to questions.",
        "questions": [
            "If you're given an array of numbers from 1 to 100 with one value missing, how do you determine the value?  "
        ],
        "date": "Nov 1, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Financial Software Developer",
        "details": "The entire process was very relaxed. The interviews definitely want to see you in your best light. After a trivial IQ exam, I proceeded to a phone interview, during which the interview asked some fairly simple technical questions using my language of choice (Java). I was then flown to New York, with the flight, hotel stay, and $100 of other expenses paid for. I ended up not getting the position,…  mostly due to lack of experience.",
        "questions": [
            "Write a method in pseudocode that would calculate and print the first 5 prime numbers.  "
        ],
        "date": "Aug 1, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "4+ weeks",
        "role": "Financial Software Developer",
        "details": "First I had to do an online Java test. Then I got a phone interview. The basic questions were about Java, C++, C, Unix, Data Structures and brain teaseres. Be prepared to on the general common topics for C++, JAVA and C as templates, exception handling, polymorphism, inheritance. You must be able to explain everything in details and to show a thorough understanding of the concepts.Question:A frog is at the…  bottom of a 30 meter well. Each day he summons enough energy for one 3 meter leap up the well. Exhausted, he then hangs there for the rest of the day. At night, while he is asleep, he slips 2 meters backwards. How many days does it take him to escape from the well?",
        "questions": [
            "A frog is at the bottom of a 30 meter well. Each day he summons enough energy for one 3 meter leap up the well. Exhausted, he then hangs there for the rest of the day. At night, while he is asleep, he slips 2 meters backwards. How many days does it take him to escape from the well?  "
        ],
        "date": "May 17, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Financial Software Developer",
        "details": "I applied online through the Bloomberg website, then received a request to complete an online test. It was fairly easy, just consisted of some basic logic questions (rotate this object, count the number of 'i's in a paragraph...). Then during the phone interview, I was asked about previous programming projects and experience, as well as some basic brain teaser and role playing questions. I have been invited for an in-house…  interview next week, so we'll see how it goes.",
        "questions": [
            "If you have 2 coins in your pocket (one is double-headed, and the other is a fair coin), you grab a random coin from your pocket and see that one face is a head. What is the probability that if you flip the coin, the other face is also a head (i.e. that you picked the double-headed coin)?  "
        ],
        "date": "May 8, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 days",
        "role": "Financial Software Developer",
        "details": "I applied the Bloomberg Financial Software Developer position about a month ago. Then a month after I got a email from the HR asking me to do a online technical assessment where I can choose my preferred language from C/C++/Java2/C#. I chose C++ and did the test today. Two hours later I received an invitation for a phone interview from Bloomberg. The difficulty of the test, well, I would say,…  moderate. There are some tricky questions and also some STL questions(which I suck at :-(). But if you spend some time on books like C++ Primer or the online C++ FAQ Lite, it would be not difficult. I am waiting for the phone interview next week. Will update then.",
        "questions": [
            "What is polymorphism?  "
        ],
        "date": "Apr 23, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Financial Software Developer",
        "details": "I submitted my resume through a recruiter. After two business days, I was asked to finish an online test. The questions were like GRE/LSAT logic questions. Pretty easy, I have to say. Two days later I received an email saying they want to schedule a phone interview. In the phone interview, I was asked some basic questions about C, some algorithms, and some brain teasers. The interviewer was very nice.",
        "questions": [
            "the classic question about two eggs dropping from a 100-floor building  "
        ],
        "date": "Mar 29, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "Applied online which is called Bloomberg discovered day, the event gathered about 50 people took a whole day. Interview was held in the afternoon for 45 minutesThe interviewer start with some general question, and then asked me some brain teasers and very basic C++ questions. I solved all in about 25 minutes and the rest of time was just like chatting.",
        "questions": [
            "How to find out whether a number is odd or even.  ",
            "You have 4 aces and a king in a set of cards, what's the probability of get kind before all aces.  "
        ],
        "date": "Mar 4, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "I applied online through their website after seeing it in my school's job database. Then I got an email some days later and took an online IQ test. It was easy -- rotate the shapes, \"count the number of t's in this paragraph\", simple java. Phone interview the next week. Easy data structures and algorithms questions. Since I was unprepared I was surprised to be invited to an on-site interview…  two weeks later in New York.Bloomberg was nice and paid for my airline and hotel, even though I got the details literally the day before I was supposed to fly out. I got a $100 gift card to reimburse my taxi and food. The office in midtown NY is beautiful. There are rows of computer desks (no cubicle walls), and lots of beautiful glass meant to embody transparency. The free food is in the plaza entryway, but just snacks and drinks. Delicious but can use more healthy stuff.I had two interviews. The first was with two nerdy R&D guys. Two brainteasers and two programming questions, not difficult if you have been doing practice questions. The second interview was with one guy, a manager type. He asked me some questions about my resume and a simpler programming question. I liked him more.Even though the office looks new, inside the culture still felt more like old Wall Street than Silicon Valley. Admittedly I was biased by the reviews on this site (about proprietary and outdated sw) which was only confirmed by my visit there. The career path was also not appealing nor was it explained very well to me.",
        "questions": [
            "25 racehorse question. Given 25 horses a track that can only race 5 at a time, what is the fewest # of races to find the top 3 ranked horses?  ",
            "There are 20 floors in a building. I step into the elevator with 5 other people. What is the probability that I do not have to press my button? (ie someone else chooses the same floor as me)  ",
            "Implement a hastable with the condition that allocated memory is not pre-initialized. Pseudocode your favorite sort  "
        ],
        "date": "Feb 22, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Financial Software Developer",
        "details": "I applied online and was contacted by a recruiter two days later. The position involved 6 months training and did not require software development experience. After a phone interview I was called back the next day and they flew me to New York and had a car waiting at Laguardia for me. After two technical interviews involving brain teasers and coursework I was sent on my way. It was clear…  the position was not a fit from the interviews, but they gave me a $100 gift card for expenses and sent me on my way. Not offered the position.",
        "questions": [
            "They asked a combinatorics question during the phone interview asking to count the number of ways an ant could crawl from one point to another in a grid.  "
        ],
        "date": "Mar 26, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "3 days",
        "role": "Financial Software Developer",
        "details": "I applied this position online, and finish an online test with some IQ question consisting of image rotating, word counting, paragraph comprehension, and maths. Also I were asked some probability and logic questions. No coding at all. Phone interview is upcoming, No idea if I will be asked any coding of ood concepts.",
        "questions": [
            "counting \"i\" in a paragraph  ",
            "match A, B,C,D,E with given information  "
        ],
        "date": "Feb 28, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "2 days",
        "role": "Financial Software Developer",
        "details": "Gave my resume at career fair and received an email for interview on campus. Since I was from non CS background, the questions were very basic. After the first round, they asked to wait for a second round which consisted of C++ programs and brain teasers. I failed to answer the brain teaser and left the interview without asking any questions. Currently waiting for result.",
        "questions": [
            "what was the most challenging thing that you did?  "
        ],
        "date": "Feb 15, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2 days",
        "role": "Financial Software Developer",
        "details": "I talked to a recruiter at my school career fair, who asked about my internship experience and then gave me a couple of on-the-spot logic questions. I then got a call that evening to go in the next morning for an interview.I was then interviewed by two people for a technical interview- about 3 or 4 logic and programming questions. (Either pseudocode or actual syntax from a language of your…  choice is usually fine.) Only took about 20 minutes. They asked me to leave the room, and after a minute of deliberation, an interviewer asked me if I could go back in the afternoon for another interview.I came back to another technical interview with two different interviewers. After another couple minutes of deliberation among the recruiters, I was asked to do a \"senior interview\" right then. They asked a few simple behavioral questions (nothing tricky) and one logic question. Seemed more like a conversation than an interview. Again, it was short, nothing more than 30 mins.That was it. Seven days later I got a call and a job offer!All the people who interviewed me seemed to be laid back and very friendly. They let me ask any questions I had and gave honest answers from their own experiences. (They are not allowed to go into specifics about compensation packages, however, i.e. typical salaries, relocation packages, bonuses, etc... but just know that it will be very generous.) The friendly atmosphere really helped put me at ease, which helped out overall. I realized that these guys weren't trying to grill me, they just wanted to get a feel for who I was and whether or not I would fit their culture.Some tips for people interested in interviewing:- They don't expect you to be a perfect programmer, though some computer science coursework will definitely help your resume get noticed. They are really looking for students from all technical backgrounds who know some programming fundamentals, have a logical mind, and have a passion for programming, especially in the financial services industry.- During technical interviews, it's okay if you don't get all the logic questions perfectly correct right away. Use the pen and paper they give you to work things out. Talk to them as you're thinking through the problem. They want to see how you solve problems and that you have a logical mind. If you get stuck on a problem, don't freak out... they will give you some hints to help nudge you along the way.- Show them that you're conversational. The Bloomberg culture is all about open communication. If you have a logical mind and you can hold a conversation, they want you on their team.- As with all interviews: Relax, and be confident!!",
        "questions": [
            "You have 25 horses, and you want to know which are the top 3 fastest, but you don't have a stopwatch. You can race the horses, but the track is only big enough to fit 5 horses at a time. How do you find the first, second and third fastest horses using the least amount of races possible?  "
        ],
        "date": "Jan 30, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2+ weeks",
        "role": "Financial Software Developer",
        "details": "Applied online, got a mail in the week to pick a language form C,C++, C# or Java for an 90 min long online test. After that in a week got a mail for a phone interview. It was for 45 min with general questions and someC++ questions. got a call for a on-site.. Will be going there soon.",
        "questions": [],
        "date": "Jan 30, 2010"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "My recruiter informed me that I will be called for an interview within the next couple of days or so. HR called me and set up the interview. I went there and interviewed with 3 people. The first 2 people conducted technical interviews where I was offered a pencil and a paper to solve a programming exercise nothing complicated. It dealt with C pointers. Then the other person asked general…  questions about C++ and object oriented programming concepts. The third person who interviewed me was from HR and she asked few behavioral questions and mostly talked about the great benefits the company offers. I did not like the atmosphere there it seemed like a \"big brother\" environment with cameras and surveillance all over the place. Additionally, it seemed like most of the technology used in the company in-house and using C or C ++ and one of them mentioned Fortran which gave me the feeling that in terms of technology I won't be learning much but on the other hand I might learn about the financial markets. The interviewers were one was nice and the other was neutral. a week later I was offered a position but by then I already accepted another offer.",
        "questions": [
            "what is polymorphism?  "
        ],
        "date": "Feb 10, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Financial Software Developer",
        "details": "Applied at university but was rejected at first :) Had also applied online, so luckily got a call from there after 2 months. Gave skills assessment test in C as I am from CS background. Next day I got an email for phone interview round. The phone interview was mostly C++ questions, a couple of algorithm questions and some networking questions. Now I have on-site interview in a few days.",
        "questions": [
            "How will you find out what has happened in the network if - initially the network speed is 10Mbps but suddenly it drops down to 10Kbps.  "
        ],
        "date": "Feb 9, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "2+ months",
        "role": "Financial Software Developer",
        "details": "I applied through a recruiter and got an email from them 2 weeks later requesting me to take the initial screening test. It consisted of basic math and logical questions. Honestly, I thought I did not do so well in the test. Got an email from them 2 weeks later that I will have a phone interview in a week. Waiting to see how that goes now.Any advice?",
        "questions": [
            "Shape shifting questions, General Math and basic programming questions  "
        ],
        "date": "Feb 23, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Financial Software Developer",
        "details": "So far a I had an online skills test because I was not a CS major. The test was very difficult but it wasn't a walk in the park either. The main problem is time. You're only given a minute per question and if you try to take it easy that minute flies by. It's mostly IQ questions which aren't particularly difficult. Some spacial transformation questions were a little tricky…  (rotate figure by 90/180 degrees clockwise/counterclockwise).After that I had a phone interview which asked a little bit about C and then dived into some brain teaser / logic questions. The first one I did not get but the second one with some help I did. I have another phone interview coming up.",
        "questions": [
            "Given deck of cards + joker, what is the probability you see the joker before all four aces?  "
        ],
        "date": "Jan 31, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "a week",
        "role": "Financial Software Developer",
        "details": "First round asked for resume related stuff line by line and raised more question based on your answers. You have to be really familar with stuff you put on the resume. Second round is C++ technical questions. They asked extremely detailed specification of the language. You therefore have to be well prepared in C++ knowledge.",
        "questions": [
            "really detailed C++  "
        ],
        "date": "Nov 14, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "2+ months",
        "role": "Financial Software Developer",
        "details": "Applied through the website. Interview process consists of 4 stages. First an online assessment test, then two interviews and one on site interview. Mostly mind teasers until the on site interview",
        "questions": [
            "A lot of database questions during on site interview. They didn't like that I used Matlab instead of C++  "
        ],
        "date": "Mar 27, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "Hiring process is pretty streamlined. Usually u go through an online programming oriented test, then a phone interview and then in-house interviews. All of the interviews are very technical in nature strictly programming/db specific and only if u make through technical stuff u get to go through a mild HR/behavioral sort of interview.",
        "questions": [
            "Dont remember specific questions but prepare urself for hardcore programming, problem solving, databases and best practices stuff.  "
        ],
        "date": "Dec 24, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Financial Software Developer",
        "details": "applied via website, got a call to setup aptitude test and then a technical phone interview. Was asked 4 math puzzled and one sort program which I got correct. Was also asked why software development and other similar kind of questions where I totally screwed up since I am not from a computer science background and could not explain why I wanted to get into coding.",
        "questions": [
            "Why do you want to join bloomberg and do coding when you have a masters degree in operations and have not had much coursework in CSE through out your undergrad and grad education  "
        ],
        "date": "Jun 14, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "2+ months",
        "role": "Financial Software Developer",
        "details": "Campus recruit first, talked to someone at a career fair, invited for an interview, talked to another guy with some technical questions, then talked to an HR personnel for some standard questions, then applied online to both NYC office and London office, invited to fly to London for a panel interview, then phone interview with NYC office. Got offer next Monday. They work impressively fast.",
        "questions": [
            "So how did you motivate your teammates?  "
        ],
        "date": "Nov 28, 2009"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "I applied on line, then got an email asking me to do an online test. The online test seemed like a IQ test and there was not technical questions. Some questions are tricky. For example, give you a paragraph of sentences but the question is to find out how many \"i\"s in the paragraph. So read the question before you read the paragraph! Just keep clear headed ,the test is…  not difficult. (PS:In the information session they said they would have different tests for CS major students and Non-CS major students. And I'm in non-cs major.) I did well in the online test and they ask me to the on campus interview next week. I will share more informations after then.",
        "questions": [
            "giving numbers 2,3,5,7,11 ,1.multiply each number by 2,2.if the result is bigger than 25 , then go to next step, otherwise repeat the 1st step.3. multipy the result by 3.4. add XX5. divide with XX.question: which number will produce maximun output  "
        ],
        "date": "Nov 13, 2009"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Financial Software Developer",
        "details": "There a question that is asked in all three round of interviews: why you choose our company? Prepare an answer before you go.First round, basic screening. one on one interview.Second round, technical questions: two on one interview.Third round, meeting with a senior director. one on one interviewFourth round, meeting with HR, one on on interview",
        "questions": [
            "Prove that you have problem-solving ability  "
        ],
        "date": "Aug 6, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2 days",
        "role": "Financial Software Developer",
        "details": "Started out with tech questions right off the bat. Asked to write code to reverse an integer in C. Also was asked to find the intersection of two stacks of a million cards. Last question was the horserace puzzle. Interviewer was friendly and helpful, offering hints when stuck on a problem.",
        "questions": [
            "Reverse an integer using C.  "
        ],
        "date": "Nov 2, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Difficult Interview",
        "length": "2 weeks",
        "role": "Financial Software Developer",
        "details": "This is a very difficult interview process so the keyword here is preparation. The skills test is very SPECIFIC, not high level concepts. You'll be asked to pick a language (C,C++,Java) so pick the one you know THOROUGHLY. Also another interviewee posted about using brainbench.com tests as preparation. DO IT. A majority of the questions are off this site but you have to pay 200 bucks for a full year…  subscription. I for one know if I hadn't take the brainbench tests, there is no way I would have passed. The phone interview wasn't any better (Know your data structures, time complexities, and algorithms). Also, be aware of brain teasers. I thought I did horrible on the phone interview but I still got called for an on-site interview. On-site: THEY WILL GRILL YOU! At least that's what they did to me. Best advice is to study from careercup.com and hope they ask those kinds of questions, but in my case they didn't. They asked about balancing binary trees and I knew then itself I wouldn't get the offer and I was right. To me, I felt it was asked on purpose just to screw me since not even Microsoft asked me that kind of question. Other thoughts: the office is incredible looking with all the modern art, I have never seen an office building like that before. No cubicles, just rows of computers with people so it sort of looked like the world war 2 films where they show rows of women helping out in the factories. Also my on-site interview was only ONE interview by 2 r&d recruiters. Others seem to have received several interviews throughout the day, so I don't how they decide that.",
        "questions": [
            "Phone Interview: Describe your most recent project, why use static variables, where are the static variables stored, how to tell if a stack grows up or down, a stupid brainteaser question involving a 100 light bulbs (can look up the question and answer online), and what data structure would use to work with a word processor.  ",
            "On-site interview: Describe your most challenging project. Time complexity again, balancing binary trees, find the depth of a tree.  "
        ],
        "date": "Oct 19, 2009"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "Had first round of 20 mins technical interviewQuestions: Chess game design in C++, Data Structures for handling high volume data, Implementing queue using 2 stacksHad second round of 45 mins technical interviewQuestion: Tree traversal, SQL vs PL/SQL, merging two arrays (second one being larger than the elements in it) into one without using 3rd array.",
        "questions": [
            "Your recent project  "
        ],
        "date": "Oct 21, 2009"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "The interview started off with a C++ skills test. Technically it wasn't that bad and pretty easy. Three people conducted the interview in sequence. Each person I explained my background, etc. (pretty repetitive). They each asked programming questions consisting of array manipulation...how would you find this, etc.I was also informed that they really don't use C++, and most of it was proprietary language use, so C++ \"won't help you here\".…  When asking about the position, none of the interviewers seemed to know anything about the position I was interviewing for. All in all, the people interviewing as well as the people in the office were a bit up-tight. The office structure was low-walled open cubes.When you are finished interviewing, expect a somewhat cold response. Kind of like, \"Thanks, and there's the elevator.\"",
        "questions": [
            "In an array of N-2 elements, how would you find the missing 2 elements given that the elements are labeled 1, 2, 3 ... up to N, but missing 2 elements in that sequence.  "
        ],
        "date": "Nov 6, 2009"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "applied on their careers site. Got a call after a couple of day. Was asked to take a technical & an aptitude onilne test. I chose C as my language. The tests were pretty simple. Aptitude test was a piece of cake. After these tests, I got a mail on the same day for a tech phone interview.",
        "questions": [
            "what is the return type of sizeof()  "
        ],
        "date": "Oct 30, 2009"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "the online skills test had options C/C++/Java. I chose C, tricky questions were on pointers and files.Need to know even macros like __LINE__ . Test had 30 questions and as someone already mentioned,it is similar to a brainbench test with 4 possible answers to each question.1) o/p of a program containing two two static variables with the same name in a program2) quick sort function in C (qsort)3) scope of…  variables - that has goto and multiple blocks in a program",
        "questions": [
            "Find problem with a string copy code question  "
        ],
        "date": "Oct 31, 2009"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "3 weeks",
        "role": "Financial Software Developer",
        "details": "online test for C++, difficult, trickythen phone interview, comprehensively on C++, threadsonsite has 3 stages. first by HR about behavior questions, then two technical interviewers focusing on language C/C++, finally with a senior manager.get offer next business day.",
        "questions": [
            "what is static in C++; give a function using pointer to combine two strings (make sure to understanding pointer, array, and const); where the const string stored  "
        ],
        "date": "Oct 8, 2009"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1+ week",
        "role": "Financial Software Developer",
        "details": "I applied on campus at my university but was not available for the interview therefore went ahead with online application process and they told me complete a online skill test. Not sure what it will be about. Technical or just an IQ test. I have selected c++ as a programing language. What kind of questions would I be asked any ideas will be helpful thanks",
        "questions": [
            "Programing languages familiar with?  "
        ],
        "date": "Oct 27, 2009"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "2+ weeks",
        "role": "Financial Software Developer",
        "details": "Applied online, and after some online assessment test, there is a first round onsite, asked details about the resume plus some algorithmic questions.And after one more online assessment test, there is again another onsite interview, asked behavioral questions and go over the resume again, then there are some coding test and programming skill questions.",
        "questions": [
            "Among the companies you worked for, which one do you dislike the most?  "
        ],
        "date": "Oct 31, 2009"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "a week",
        "role": "Financial Software Developer",
        "details": "The online technical assessment is pretty basic. They asked several logic questions, some analytical reading, and some shape manipulation questions. They also had several weird questions like \"count the total number of L's in this paragraph\". I am moving onto the phone interview this week which is to be more technical.",
        "questions": [
            "multiply by 2if less than 25 go back, else continuedivide by 3subract 4multiply by 3Which will produce the greater result?A. 2B. 3C. 4D. 5  "
        ],
        "date": "Sep 14, 2009"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Financial Software Developer",
        "details": "the process started with a online problem solving test; 30 logic or mathematic questions in a 1 hour time limit. the 1st round interview included a visit of the office, a info session and a short technical 1 on 1 interview; The questions were fairly easy and the interviewer will guide you through if you have trouble. so the key thing is being calm and don't give up. 2nd round…  (last round) I met HR and a developer. Questions from developer are coding related. If what you put down on your CV is real, you should be fine with them. HR will try to understand your intension of taking the offer and how long you would stay. So make sure you know the job and really want it.",
        "questions": [
            "What's the difference between Maple and Matlab?  "
        ],
        "date": "Sep 19, 2009"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "3 days",
        "role": "Financial Software Developer",
        "details": "Applied through its online system and then contacted by Bloomberg's HR. I was emailed a link to do a technical test. The test took about one hour to complete. The test is fairly simple and basic, including mathsmatics, logic, and analytical reading. After 3 days the test done, I was invited to the office to do an 1:1 interview. Generally the interview focus on what's on your resume.",
        "questions": [
            "how many ppl born per minute?  "
        ],
        "date": "Sep 23, 2009"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "Just had a online test for Bloomberg LP, test consisted of Logic and general aptitude questions. Based on mathematical concepts such as time , distance and speed, also work and time etc. There were a few questions on outcome of simple algorithms and also some questions on matching different patterns.",
        "questions": [
            "It takes 15 minutes to fill a tank from a tap and 40 minutes to enpty it from the sink . If both are open how long will it take to fill the tank . Capacity of tank is 400 gallons  "
        ],
        "date": "Sep 16, 2009"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Easy Interview",
        "length": "2 days",
        "role": "Financial Software Developer",
        "details": "Submitted my resume, was contacted by no-name email for an intelligence test that consisted of logic and reasoning questions. Went for an int'w \"day\" which consisted of brief company introduction, supposed \"networking\" session in which there was only one person for 30+ ppl to try to network with; a building tour (\"this is a couch to allow our employees to meet and talk about things\", \"here we have another pantry…  with free food\", seriously), an int'w session with a young employee who wanted to rush me out after 15 minutes, another \"networking\" session with the same one employee, then c ya later.",
        "questions": [
            "For a non- programmer, how would you search a linear array for a set of information?  "
        ],
        "date": "Aug 16, 2009"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Financial Software Developer",
        "details": "I applied online. About a week later was emailed an invitation to take an online skill test - consisted mainly on logic and simple mathe questions. Later was called for an onsight interview, about half an hour, maily brain teasers. I am awaiting now the next round, which should be a technical and HR interview.",
        "questions": [
            "How would you find the largest value in an array?  "
        ],
        "date": "Aug 17, 2009"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "3 days",
        "role": "Financial Software Developer",
        "details": "The online assessment test was sent to me a week after I submitted my resume. The questions consisted of analytical reasoning, process mapping, abstract thinking etc. There were a lot of questions involving turning shapes clockwise or counter clockwise in different angles , some other questions involved recognizing type of flowchart. I had one question to count the number of appearances of an alphabet and one counting written number denominations.…  Each questions took 3minutes. It is fairly okay and I was selected to go forward.",
        "questions": [
            "Number of repetitions of an alphabet  "
        ],
        "date": "Jun 12, 2009"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "2 weeks",
        "role": "Financial Software Developer",
        "details": "Initially there was a C++ Skill test. I had enough Brainbench C C++ free tests. So that really helped me a lot,. In Fact I noticed, some of the questions were as it is from Brainbench tests. I even remembered some of the answers. Each test had 40 questions. And I had 3 minutes for each question. I did well and as expected I got a call for phone technical…  screening in C++. Phone screening was almost 30 minutes long. Questions about Static members in class, static global variable in multiple files, virtual destructor, multi threading, big endian, little endian etc. I could answer some but not all. Hence that was it. Dint get anymore call. :(",
        "questions": [
            "What is difference between Reentrant and Thread Safe functions ?  ",
            "What is the difference between static global and normal global variables.  "
        ],
        "date": "May 15, 2009"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "There was a series of interviews. The first interview was 30 mins. This was one of the main screening rounds. The interview consisted of many simple technical questions. After this one was a 1 hour interview. This one had a simple C program on trees and then a complicated one. I could not solve the complicated question so I guess I got rejected. You must know pointers well to clear…  the Bloomberg interview",
        "questions": [
            "There is an array of 1 byte and 2 byte numbers. The 1 byte number always starts with a 0 and the 2 byte number always starts with a 1 you are given a pointer to the beginning of a particular character. How will you do a backspace.  "
        ],
        "date": "Oct 6, 2009"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "a week",
        "role": "Financial Software Developer",
        "details": "The entire hiring process consisted of three phases.The first phase is an online multiple choice test covering basic programming skills and questions on analytical thinking (of the type you'll normally see in a GRE or GMAT test). There were about 30-35 questions and I was given a maximum of 3 minutes for each question.The second phase is a phone interview. They questioned me in detail about my resume, all my…  projects, and asked me to choose one from the different projects listed in my resume. They then went into quite some detail about the project, asking me to describe what I did, the major challenges, how I planned the development, and how I tested the code. After that were some basic technical questions. They will definitely ask you which programming languages among the ones listed on your resume you are most comfortable with and quiz you in detail about it. Since this round is on the phone, they normally will not ask you to write any code, nor will they give you any code. Apart from programming language concepts for one or two languages, there will be some questions on sorting and searching algorithms and data structures, like hash tables, BSTs and their complexities, their advantages, disadvantages etc.The final phase consists of two or three in-house interviews.There will be a round of HR interview which is usually 1:1. Be aware that I was asked in very minute details about everything on my resume. I did expect to be quizzed about these things, but not in such minute details. There are the usual HR questions like why do you want to join Bloomberg, where do you see yourself in 5 years, why should we hire you (asked in a very curt manner to really catch you off guard) etc. so be well prepared for those.Then comes a technical interview round, which is usually conducted by two of their engineers. They will ask you which is the language or languages you are most proficient with, and then quiz you on that. Be aware that you should only say you are proficient in a certain language if you really are proficient in that. There are no bonus points for claiming to know more languages and then not being able to prove your proficiency, and if you can't you will most likely not be hired. The logic is that they want to know how good you really are in things you claim to be really good at. They will usually ask you to write code for two or three problems. They may start with a simple coding question, before moving on the more complicated programs (usually involving recursion or use of a data structure). The emphasis is on being able to write clean and efficient code, along with the use of an efficient algorithm for solving the problem. They will definitely ask you the reasoning behind writing the code (sometimes line by line). There is also emphasis on low level concepts (like how the stack, heap, data segment works, what's stored in there, how the Stack Pointer behaves in different situations etc). Along with writing code, they may write down some code snippets, and ask you if it will compile, if there are any errors, what those errors are, why they come out etc. My preferred languages were C and C++ so they asked me some seemingly odd code snippets to test my understanding of the mechanisms involved in inheritance, polymorphism, templates, operator overloading. There may also be a few questions on the STL. Also related to both containers and memory management will be questions about the ownership of pointers or objects placed in containers, what delete and new do etc. There will be questions related to algorithms and data structures as well. These could either be by themselves or they could be as a part of a programming problem. Be sure about the complexities of all the basic sorting and searching algorithms and data struct operations too since these may be useful is such situations. Finally, they will ask a few puzzles (usually just one or two) to test your problem solving capability. The entire interview will last about 1-1.5 hours (depending on how well you're doing). Most likely, the interviewers are going be really skeptical about your answers (regardless of whether you're screwing up or you're near perfect) - they want to know how confident you are about your answers. Don't panic, this is normal. Just be sure of what you're doing, and cross check your code before you tell them that it’s final.If you manage to survive through this technical round there will be an interview conducted by a Sr. Manager. This one is comparatively low stress. Not too technical. Mostly they want to know how well you fit into the team, where you will fit in, your attitude etc. I would suggest that you talk about things like how you planned your projects, how you worked in a team during your project work etc. He/she may also ask you a puzzle/brain teaser, but I wasn't asked any. You are encouraged to ask questions about the position, the company, the work culture, the management etc.",
        "questions": [
            "What is a singleton? How would you code it in C++? How can you make it thread safe?  "
        ],
        "date": "Mar 26, 2009"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "3 days",
        "role": "Financial Software Developer",
        "details": "The first round was an online interview which was the toughest part of the process. They give a choice to take the interview in Java/C/C++/C# Once you clear the online test, rest is straight forward. A little preparation can go a long way - I found this site very helpful in preparing for the onsite and phone interviews - http://www.careercup.com/page?pid=bloomberg-lp-interview-questions - Most of the questions asked were standard programming interview…  type questions - with interviewers asking some probing questions based on your answers/solutions - trying to assess how you think/reason. From my experience, practicing/preparing such programming interview type questions helps a LOT !! It is otherwise difficult to think of solutionsTry not to get stressed out during the main technical round where 2-3 interviewers will collectively interview you. Even if you don't come up with a 100% right answer, still if you can think reasonably well, use logical abilities, you should be able to clear.Most of their work is in C/C++ - though if you have concepts clear with any other language (like Java), it wouldn't matter.I also had an HR interview in the end - standard questions like why Bloomberg? Where do I see myself in the next 5 years? Why would you be a good fit for Bloomberg? I believe Technical interview was much more important for Bloomberg in their hiring criteria. HR interview was more of a formality.Work culture - fast paced, busy - people working long hours in office daily, face time importancePeople - ok - didn't have much time for niceties or socializing - busy people ..didn't go out of their ways to make you feel welcome or at home.- Good compensation and benefits.",
        "questions": [
            "Something related to data structures - What would be the ideal data structure if you wanted to store millions of stock feeds - and retrieve them very fast based on time when the feeds came.  ",
            "Simple function to add two numbers - try to think of all possible ways to debug it -  "
        ],
        "date": "Apr 14, 2009"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "2 days",
        "role": "Financial Software Developer",
        "details": "First met the company at our university career fair. I handed them my resume and soon after I was contacted for a live interview. The people who interviewed me were nice, but one of them was a little condescending. The first interview had two employees speaking with me. They asked technical questions about my skills. Then they presented some programming questions, which I thought were not too difficult. You had…  to use C++ to solve the problems. I started the interview really well, but got a little flustered towards the end. I think I did average.The next day they called me back for a second round of interviews. This time the interviews were one on one. I first spoke with a senior developer who asked more technical questions. I felt that I did well in this part. Next, an HR representative interviewed me and I did really well. I answered each question well and showed confidence. Needless to say, I felt a lot better about the second day.About a week later they called and offered me a position. I accepted.",
        "questions": [
            "Suppose your software requires the client to enter information into a database. What do you do if data insertion takes too long?  "
        ],
        "date": "Jul 12, 2009"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "I applied to a developer position and chose to be interviewed in C++. Two developers interviewed me and they asked me how Java and C++ are different. One of them asked me what a virtual function was. Another question was about polymorphism. They asked for examples as well. Even if I gave them the correct answers, they never looked satisfied. I think this is an interviewing method.",
        "questions": [
            "What is a virtual function?  "
        ],
        "date": "Feb 20, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Difficult Interview",
        "length": "a week",
        "role": "Financial Software Developer",
        "details": "I took an online C++ test, which is very difficult, a lot of stuff on advanced C++ concepts.",
        "questions": [
            "generic programming, template things  "
        ],
        "date": "May 1, 2009"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2 days",
        "role": "Financial Software Developer",
        "details": "On campus interviews or phone interviews + in house interviews is the typical process. Usually 2 technical rounds of 1 hour each. You will need to write code on paper. Questions cover c,c++, data structures, algorithms, problem solving etc. Interviews are very technical but do not underestimate HR interviews as well.",
        "questions": [
            "Why is your GPA not 4, design an elevator system.  "
        ],
        "date": "Dec 27, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "like usual, put you onto the brainbench test, and then sent you an email about the phone interview. Also i believe is their culture just to 'push' you and challenge your tolerance, keep on bombarding you with their questions. Tried to explain more detail on a specific question, but in exchange they just told me to answer Yes or No only in a rude way.",
        "questions": [
            "C#, if you set lock in a method, will you be able to do a recursive call again?  ",
            "what will happened after you click on an exe file  "
        ],
        "date": "Nov 6, 2009"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "a week",
        "role": "Financial Software Developer",
        "details": "First step is an 1 hour interview over the phone + hackerrank. The interviewer was extremely polite and seemed very interested in my working experience. He provided a lot of hints when I got stuck. The questions were C++ related (basic knowledge) and basic algorithm knowledge, but I failed because I wasn't prepared.",
        "questions": [
            "Spot the errors in a C++ program. Basic stuff: constant function trying to change class members, static function trying to change a non-static data member, object slicing, virtual method called in constructor.  "
        ],
        "date": "Mar 30, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2+ months",
        "role": "Financial Software Developer",
        "details": "Technical telephone interview - My preferred language was Java so I was asked about object oriented design, garbage collection and some language constructs. Really easy stuff. Then we moved onto coding on Hackerrank, where the interviewer asked me to write a program to print out pairs of numbers from an array that added up to a target value.In-Person interview at Bloomberg offices(London)- the day began with a casual breakfast with…  some of the engineers where you're given an opportunity to chat informally and get to know them a little. After that you go to a room with a computer for the technical interview. There will be two engineers and you will be asked to solve a coding problem, mine was to perform a deep copy of a singly-linked list that had random jumps. The other task was to find a bug in a section of code. Nothing too daunting.",
        "questions": [
            "Write a function to print out pairs of numbers from an input array that add up to a certain target value. Analyse its running time, suggest improvements if it is more than O(n)  "
        ],
        "date": "Apr 3, 2016"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3+ months",
        "role": "Financial Software Developer",
        "details": "The whole process was a bit lengthy, it took about 3 months since they first contacted me until I got the offer but the communication with the HR and the interviews went smoothly.I first had an on campus interview and then they invited me to some on site interviews in London where they covered all travel expenses.",
        "questions": [
            "Problems related to basic data structures and some basic algorithms such as sorting, binary search etc.  "
        ],
        "date": "Mar 22, 2016"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "Applied online for internship in London, got an e-mail a week later to schedule a phone interview for the following week. Interview was on HackerRank using CodePair (live-coding). Extremely nice and supportive interviewer. Honestly it was great fun. Questions about C++ -- you should be very familiar with C++ and know its nitty-gritty ins-and-outs of which there are many. Just as important are fundamental algorithmic skills and data-structures, as well…  as analytical thinking (know your big-Oh!). Process is quick and professional.",
        "questions": [
            "Questions about C++ inheritance. Gave me some code with a base and derived class with some mistakes that I had to find, like a non-declared and thus non-virtual destructor.  ",
            "Second question was the two-sum problem. Had seen it before.  "
        ],
        "date": "Nov 4, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "5 days",
        "role": "Financial Software Developer",
        "details": "first round of telephone interview with a software engineer, which lasted about 1 hour. classical questions like why bloomberg, heap VS stack, exceptions, multithreading, hash functions. 2 tasks on hackerrank.and at the end I asked him some questions like what he is currently working on, the structure of the team.",
        "questions": [
            "read the following code and tell me the output, and is there anything wrong about it?#include &lt;iostream&gt;class A{public:    A()    {        foo();    }    virtual void foo(int a = 10)    {        std::cout &lt;&lt; \"A = \" &lt;&lt; a &lt;&lt; std::endl;    }};class B : public A{public:    B()    {        foo();    }    virtual void foo(int b = 20)    {        std::cout &lt;&lt; \"B = \" &lt;&lt; b &lt;&lt; std::endl;    }};int main(){    A* aPtr = new B();    aPtr-&gt;foo();    delete aPtr;    return 0;}  ",
            "write a function to compare 2 strings of the same length, find the number of different chars. e.g.myCompare('bond','debt') = 2myCompare('xxxx','yyyy') = 2the 2 input parameters are const  "
        ],
        "date": "Jul 2, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "Phone interview starting with \"Why Bloomberg\", moving on to a discussion of language features of Java and C++, a question about data structures, then two coding questions on HackerRank. Not very difficult, it was more or less a basic competency test.",
        "questions": [
            "Why Bloomberg?  "
        ],
        "date": "Mar 16, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "4 weeks",
        "role": "Financial Software Developer",
        "details": "Speedy interview process, within 4 weeks I went from submitting my CV to being rejected. It starts with a phone interview, followed by a jabber (skype) interview followed by onsites. Very focused around C/C++. Despite them telling you you can use any language, every answer you give will be redirected to a C/C++ question. Know how those languages work internally, very much focus on that. Actual problem solving part was…  very easy, and actually found the jabber interview harder than onsites. Despite solving all their problems, I failed some C/C++ language knowledge questions and got rejected. They seem tovalue actual knowledge more than problem-sovling abilities, so keep that in mind.",
        "questions": [
            "How does GC work in Java. C/C++ memory management and parameter passing mechanisms. Actual problem solving questions are easy and standard, have a look at careercup for some examples. They don't really bother changing them so you might get the same ones as on there.  "
        ],
        "date": "Jan 22, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "Technical Phone interviewAsk a lot of basic C++/Java QsLike what is static , constructor , OOP , final , name some datatypes .... etcfollowed by hashing Questionthen Write code to calculate the square root of a number",
        "questions": [
            "what is a virtual function ?  "
        ],
        "date": "Nov 28, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2+ months",
        "role": "Financial Software Developer",
        "details": "Submitted my resume online. I was contacted through email. There were 3 interview rounds. Phone interview, video conference and on-site interview. Everything took a little bit more than 2 months. Everyone was friendly.",
        "questions": [
            "Everything about Java.  "
        ],
        "date": "Oct 16, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "One technical screen followed by another nontechnical round with a manger. The first screen was your typical big company coding interview. The second round was about why I applied to Bloomberg and to see what my interests were.",
        "questions": [
            "Why do you want to work at Bloomberg over other companies?  "
        ],
        "date": "Nov 16, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "a week",
        "role": "Financial Software Developer",
        "details": "Applied online, scheduled a telephone interview within one week. The interview contains some HR question as well as technical questions. The technical questions are related basic data structure, java virtual machine, C++ vs Java, etc. I found the interview is positive and the interviewer is very patient and helpful. Passed this round and now is waiting for an on-site interview.",
        "questions": [
            "When developing financial software, what do you think is different from normal software development?  "
        ],
        "date": "Mar 12, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Easy Interview",
        "difficulty": "-",
        "length": "2 weeks",
        "role": "Financial Software Developer",
        "details": "entry level - London.mostly basic c/c++ and compilation questions.c++ class and characteristic.oop properties.exceptioncompilation.",
        "questions": [
            "Heap and Stack When compilation and calling functions  "
        ],
        "date": "Mar 21, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "I applied online, got an e-mail in a week and in two weeks I had a phone interview. The interviewer was helpful.There were four parts:- What do I know about Bloomberg?- My projects- Technical questions: OOD, JVM, GC, C program architecture (heap, stack), static, final, etc.- Questions I wanted to ask",
        "questions": [
            "Java JIT compiler  "
        ],
        "date": "Mar 25, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "Phone interview asking basic C++ questions and some HR ones (why do you want to work for Bloomberg) followed by an on-site interview at their London office. On-site interview consisted of 2 technical interviews where they asked some simple algorithmic problems and asked to write some code on paper, plus a few questions on C++.",
        "questions": [
            "What is a virtual pointer  "
        ],
        "date": "Jan 11, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "Applied online and the process took 3 days. The phone interview was relatively easy. The questions were mainly about C++. Asked what are overloading and overriding, pass by value and pass by reference, what are the default generated methods for a class etc. Some behaviour questions and Java questions. Two days later got the onsite interview invitation.",
        "questions": [
            "the unexpected question was \"is the vector consecutive\". I thought it wasn't as if it were consecutive then we would be able to use pointer arithmetic to iterate through the vector but i haven't seen that. I then was told it was actually consecutive. Just think about how vector is implemented and you won't miss it. The phone interview is easier than I expected. Nothing too difficult and the interviewer…  is quite nice.  "
        ],
        "date": "Nov 3, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Financial Software Developer",
        "details": "First off there was a phone interview where I was asked about object oriented principles, and then a couple of specific questions about my favourite language. Then the second interview was a video conference during which I had to answer computer science type questions and write some bits of code for them.",
        "questions": [
            "Probably the easiest but one that I hadn't even thought of - why do you want to work for Bloomberg? Things that popped into my head were 'because I want a job'. Thankfully I blagged something about their open office environment.  "
        ],
        "date": "Nov 13, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 days",
        "role": "Financial Software Developer",
        "details": "Got a phone interview with a mobile developer there asked about basic stuff like what's the difference between java and c++and polymorphism,inheritance an memory mangement (heap-Stack) virtual functions",
        "questions": [
            "where is static variables stored  "
        ],
        "date": "Oct 8, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "6 days",
        "role": "Financial Software Developer",
        "details": "Bloomberg's application process is tightly integrated with LinkedIn, so if you have a LinkedIn profile then it's very easy to simply import your profile in.The first step was a 30 minute long phone interview. This was primarily about basics of C++ programming. I'd highly recommend candidates to brush up on pointers, C++ STL container classes such as vectors and hash maps, memory management (e.g. why is malloc not used any…  more).I got an email offering a face-to-face interview at their London office within two days. The guidance on this was that the interview would last \"at least an hour, but please allow for up to three hours\". I assume that the length of the interview depends on how far deserving of a candidate you are. The interview was conducted by a engineering team manager and a lead programmer on one of their teams. The first set of questions was solely about pointers and how they are referenced / dereferenced in situations; really fundamental stuff but if you're not clear then you're likely to trip up at some point. Like I did. I did manage to backtrack and walk them through my correct solution when they gave me a hint on one of the trickier ones but I knew by that point my interview was shot. They wrapped it up after exactly an hour.The whole process was extremely quick, it seemed like everyone was on the ball.",
        "questions": [
            "When using a hash table, what happens if the hashing function generate the same key as an existing entry?  "
        ],
        "date": "Apr 19, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Average Interview",
        "difficulty": "-",
        "length": "3 weeks",
        "role": "Financial Software Developer",
        "details": "I had a first interview over the phone for simple java questions after which I got invited for an inhouse interview.They showed me some c code to see my understanding of it. They asked me about some pointer etc types and if I could identify them and some string manipulation. Also some more algorithmic questions.",
        "questions": [
            "A rabbit wants to climb some stairs and it can do steps of 1 or 2. How many possible paths are there to follow ( e.g 1-1-1... or 2-2-2 ... or 2-1-2-1... etc)  ",
            "You have a buffer with integer the size of a byte how can you find the first non repeating number  "
        ],
        "date": "Dec 22, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "Phone interview with soft questions and a logic question (see below). On site interview with two developers to talk about past experience, skills, and technical questions.",
        "questions": [
            "1. If you have 10 glasses and 10 mice, what is the max number of bottles you can have and be able to identify the one poisoned bottle with only one test2. write the insert method for sorted linked list3. given numbers 0 to 99 with no duplicates in an array, how do you find missing number  "
        ],
        "date": "Dec 14, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "4+ weeks",
        "role": "Financial Software Developer",
        "details": "I applied for a non-computer science entry level position. They got back to me really fast (a couple of days). The phone interview was fast, they asked about my university work and any programming experience. They asked afterwards about stack/ heap, garbage collection in c++ vs java, and other simple things. I was invited to a face to face interview, where I was asked why I wanted to work for…  Bloomberg, and what makes me a sensible choice.They asked about finding the 1st missing element in a sorted N-1 set of numbers (they were looking at sublinear complexity algorithms, not the sum from 1 to N minus the sum of all elements in the set, which is linear complexity).They asked about finding the maximum loss of a trading day given the numbers, and how I would implement it.They replied roughly 24 hours after the face to face interview. It was a fairly nice experience actually (yes they do have free snacks and coffee at the office and very beautiful aquariums).",
        "questions": [
            "1st missing number in a sorted set of N-1 integers (numbers between 1 and N) ?  ",
            "Keeping track of maximum loss of the day given 1 index and the prices.  "
        ],
        "date": "Dec 19, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "3 Interviews. 2 very technical interviews asking questions on algorithm complexity.",
        "questions": [
            "Sorting complexity.  "
        ],
        "date": "Nov 23, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "3 days",
        "role": "Financial Software Developer",
        "details": "Campus hiring , two days of interviews. But only 4 interviews. Good technical rounds , all in C++.1. Code for merging two sorted linked lists.2. Given a iterator access, how do you print data in circular fashion on the screen.3. Given two numbers with each digit in single node of a linked list, how do you add the numbers.4. Optimal code for Fibonacci number generation.",
        "questions": [
            "Why bloomberg and how do you think this job will help your career.  "
        ],
        "date": "Oct 21, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "Campus 2:1 interview. It took one hour. Asked about SQL and Linux commands. Some questions about pipe and redirects. One question asked me to write a code to implement \"echo\".Programming question: given a m by n grade, how many possible paths are there from (0, 0) to (m, n). Can only move in two directions, right and down.",
        "questions": [
            "Programming question: given a m by n grade, how many possible paths are there from (0, 0) to (m, n). Can only move in two directions, right and down.  "
        ],
        "date": "Oct 23, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "2 weeks",
        "role": "Financial Software Developer",
        "details": "All 2:1 interviews, questions about resume, then they start with basic data structures questions, and move to more complex algorithm questions.Basic questions about C++, classes, structs, pointers, copy constructors. Data structure questions, difference between structs (linked list vs tree vs array), then on string manipulations, tree traversals, recursive calls. Later to more complex problems involving optimizing time complexity, more pointers, and some brain teasers.",
        "questions": [
            "Why Bloomberg?  "
        ],
        "date": "Oct 9, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2 weeks",
        "role": "Financial Software Developer",
        "details": "Campus interview1. Summation of 2 numbers to X in a given list of Numbers2. Longest Palindrome Substring3. Design of Datastructure : to have O(1) - access, delete. recently usedOnsite Interview1. last integer remaining in a number list of 100 if every number were to shoot his neighbour in cyclic fashioneg 1->2->3->5->6->7->8->9->10->12. reverse number3. to chose when to buy/sell given a forecast of next N days's prices of given stock ,…  u are allowed to buy/sell only one stock multiple number of times.objective - maximize profit",
        "questions": [
            "__  "
        ],
        "date": "Nov 17, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Financial Software Developer",
        "details": "Very professional and they are very quick in announcing their results",
        "questions": [
            "Questions covered basic algorithms and data structures  "
        ],
        "date": "Aug 7, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "I received an phone interview and was asked about some brain tease questions and I kinda screwed.",
        "questions": [
            "There are 25 horses and you need to race them in order to figure out the fastest five. 5 horses as a group and what would be your strategy?  "
        ],
        "date": "Feb 27, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "2+ months",
        "role": "Financial Software Developer",
        "details": "1 round phone interviewed. I answered all the questions, with some hint from the interviewer. Was rejected one day after the interview.",
        "questions": [
            "given two arrays of non-negative integers, check whether two integers from two arrays sum up to a given number.  ",
            "In c++, how to implement \"finally\" block in java  "
        ],
        "date": "Jan 29, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "3 days",
        "role": "Financial Software Developer",
        "details": "Got the info from school on an information session. The building design is modern and they have colored elevator banks. The event presenters were smart and definitely gave off a tech company vibe. Think less Wall Street more Apple or Google. The session informed the position is for a training program that could lead to an internship that could lead to job. Starts with a three stage process that consists…  of resume review, assessment test, and an in person interview. Resume review was simple enough as they are not looking for specific backgrounds. They are looking for undergrad and graduate students with an interest in programming and and financial products. Next step is the assessment test which is similar to the logic game section of lsat. They give you three days once you're emailed to take the exam. Its not difficult but I wold suggest doing logic puzzles to prepare. Its about 30 questions and you get 3 minutes for each question. Expect arranging, organizing, and sequencing games. Even a few questions where you draw a letter on a page then get instruction to turn it 90 degrees 45 degrees and so on then pick the image youre left with. Hard to pick up on what the culture is like in an hour but no question you'll be working with some smart folks in a challenging environment.",
        "questions": [
            "Logic games: sequencing, arranging, and organizing  "
        ],
        "date": "Nov 7, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "I applied bloomberg financial software developer position through university's career link. And they offer me to do an online technical test in Java. The test is not easy. It asks a lot of detailed concept questions in Java, and cover a very wide scope of classes. Each question has 5 options to choose, about 1/4 of them I just guess the answer.",
        "questions": [
            "What's difference between RMI and COBRA?  "
        ],
        "date": "Oct 18, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "Got an interview in their London house with 2 tech guys, was asked basic C++ (pointers, OO, data structures etc ) questions and a logic test. It was a very nice and relaxed hour.",
        "questions": [
            "Basic concepts of pointers, stack, heap, data structures and OO techniques  "
        ],
        "date": "Dec 15, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "4+ weeks",
        "role": "Financial Software Developer",
        "details": "The interview comprises of a combination of brainteasers, probability, programming and algorithms questions. Be prepared to write c++ codes on a piece of paper. The interviewers are very friendly and would be happy to help you out. Over all I loved the experience and am looking forward to being at the company.",
        "questions": [
            "Write c++ code to solve a crossword puzzle  "
        ],
        "date": "Mar 8, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "I was brought in after answering a few trivial questions on C pointers at a job fair. I was then asked to do some fairly simple code problems on the whiteboard, one of which was reversing a string. I was then asked a more abstract question.We then talked about my past experience and I went on my way.",
        "questions": [
            "You have two identical eggs that will break when they encounter a significant force. You are in a 100 story building and know that you can find the the breaking point of the eggs by dropping them off different floors. Describe and prove the optimal algorithm for this.  ",
            "Reverse a string in C.  "
        ],
        "date": "Oct 23, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Difficult Interview",
        "length": "3 days",
        "role": "Financial Software Developer",
        "details": "Gave my resume to a recruiter at a job fair, no phone screening. A week later I got called by a university career center employee to setup and on-campus interview for the next day. It was a 25 minute interview basically to make sure I didn't lie on my resume.A few hours after I got a call to setup another interview and scheduled it for the next day (they wanted…  it that afternoon). Second interview was 45 minutes and more technical, not to mention the two interviewers were worse. Basically it was a \"Write this code while I play on my ipad\" kinda interview.Both interviews were 2 on 1. Brush up on your C and C++, and know every difference. My primary language these days is Python, so they looked down on me in disgust.",
        "questions": [
            "How would you implement the Shuffle feature on an iPod with the least disruption to the user and so you can go back and forward without being given a different song. Also what is the run time of your algorithm.  ",
            "What is a hash function for and how would you make one to hash strings?  ",
            "Implement a function in C that takes a string \"Hey\" and converts it to \"[H][e][y]\" with no return value  "
        ],
        "date": "Oct 2, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "went over resume, some C++ algorithmic questions",
        "questions": [
            "How would you find the Common elements from 2 Arrays which my or may not be of the same size?  "
        ],
        "date": "Sep 21, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "Got to know about about the offer through a recruiter. Took a Brainbench type test and then got a phone interview. Was invited for a face to face interview. The interviewer was good and didn't rush me one bit but I didn't do well at all in the interview.Got questions for bitwise operators, linked lists etc.",
        "questions": [
            "Reverse a singly linked list  ",
            "Count the on-bits in a number  "
        ],
        "date": "Sep 11, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "2 weeks",
        "role": "Financial Software Developer",
        "details": "All interview questions are from the book \"Cracking the Coding Interview\" Chap 1,5, 6, 7.",
        "questions": [
            "find the longest repeating char in a sorted string  ",
            "There are one hundred closed lockers in a hallway. A man begins by opening all one hundred lockers. Next, he closes every second locker. Then he goes to every third locker and closes it if it is open or opens it if it is closed (e.g., he toggles every third locker). After his one hundredth pass in the hallway, in which he toggles only locker number one hundred, how many…  lockers are open?  "
        ],
        "date": "Nov 25, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Financial Software Developer",
        "details": "First Round: Selected on campus. Had an on campus interview. pretty straight forward. Just some programming basics and a few HR question.Second Round: Again on campus. Areas of concentration C++, sorting, searching algorithms.Third Round: On site. Was simple. straightforward.Result: not selected but left me with good experience.",
        "questions": [
            "Describe an algorithm to find mutual friends on Facebook.  "
        ],
        "date": "Apr 11, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "3 weeks",
        "role": "Financial Software Developer",
        "details": "Submitted resume at career fair, received an email for on campus interview. Interview consisted of a short simple 15 minute interview in the morn, followed by a longer hour + session in the afternoon. The afternoon session consisted of two different interviews. Morning interview was a simple coding example, afternoon inteview was average. In restrospect, it was kinda fun or it would be in a class or other setting. At…  this point all questions are from glassdoor, careercup or programming interviews.Got an email for another round, but other obligations made that impossible, therefore I got an onsite interview.Onsite consisted of one hour with two developers, where they asked me about my research/programming experience. They left to confer with my recruiter, about ten minutes later I had a somewhat hostile one hour interview with an employee, who eventually told me he was a manager. I was asked a few behavioural questions; Are you ready to leave? Did you enjoy the easy questions? What are you looking for in a job? Followed by a coding question. After which he asked if I had any questions about Bloomberg, after a short discussion he left. About 15 minutes later the recruiter showed up and did the HR run through, after which she showed me out.Got an odd vibe from Bloomberg, like my fly was open or I was the annoying talkative dude on the plane. Doubly weird because everyone else seemed to be enjoying themselves.",
        "questions": [
            "write a method/function to find the root of a function?Eventually simplified to write a binary search based function to find the square root of a number  "
        ],
        "date": "Mar 21, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "An online test on technical skills - some questions are quite far-fetched and generally not a great test. Then a 3 hour on-site interview with three technical staff and HR. Great work environment and very friendly place. Technical questions are not hard as long as you understand the basics of algorithms and some C. So pointers, stack frame etc, and data structures and algorithms, heap, list, tree, hash etc. Good…  luck.",
        "questions": [
            "What is your expected salary?  ",
            "Can you name any high-profile acquisitions by Bloomberg in the past?  "
        ],
        "date": "Mar 21, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "asked abt pipelining, bit manipulations, page table, memory hierarchy,",
        "questions": [
            "Tell us about multicycle pipeling  "
        ],
        "date": "Mar 21, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "Two recent graduates, who worked for the company 4 and 1 years asked questions on C and especially pointers. Overall experience was not so bad, but you have to know pointers and everything around it very well in order to pass this stage.",
        "questions": [
            "Memory allocation  ",
            "Pointers and arrays of pointers  "
        ],
        "date": "May 15, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "1+ week",
        "role": "Financial Software Developer",
        "details": "Process::- CV submission to online system (no need to fill in an entire application like other companies)- Online Software Test- 1st Round Interview - skills assessment and logical puzzles- 2nd Round Interview - Further skills assessment- 3rd Round Interview - HRObservations::- Busy and lively offices- Open Plan offices- Fancy glass meeting rooms- Free food and drinks.- Interviewers were very helpful and provided sufficient time to complete exercises without any pressure",
        "questions": [
            "Determining the efficiency of code, and devising the most efficient algorithm to certain software problems  "
        ],
        "date": "Aug 10, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "2 weeks",
        "role": "Financial Software Developer",
        "details": "Applied through college career site.Emailed me a few weeks later about taking an Intelligence Test, which was of average difficulty, some simple questions, some doozies like on a MENSA test, some annoying ones about finding the number of \"h\"s in a paragraph etc etc. Apparently I did well enough.Got a request for a phone interview a week or so later. The phone interview consisted first of talking about certain projects…  and work experience on my resume, then some programming related questions based on my couple of programming courses, and a couple of brain teaser/puzzles. Use techinterview(dot)com for an excellent resource for these types of questions. I wasn't quite able to answer one of the questions fully, but I talked through the entire thing and got frustratingly close. Very nice interviewer though, helped me out on questions I struggled with.Invited for an on-site interview, where they flew me in and put me up in a pretty nice hotel a few blocks away from the office. Very nice building, great atmosphere, glass doors in all the meeting rooms, cool stuff. First interview was with 2 software devs, who grilled me on a lot of C++ concepts (especially memory management and pointers), that I claimed to know from my self-study, but realized very quickly that I really didn't have a grasp on. it was very difficult for me, but should be a cakewalk for most people experienced in C++. I personally thought I did terribly on this portion of the interview. Be ready to write code on a notepad. One of the interviewers was really nice and helpful, the other seemed like he was having a bad day, and my inability to answer some of his questions quickly seemed to frustrate him even more.Next was a 1:1 with a manager in R&D, who asked me more brain teasers and a few more programming questions, which started off badly like the first interview, but got progressively better.Finally, there was a 1:1 with someone from HR, who asked a simple data structure concept question, but focused more on my resume, past experience, and other typical HR questions. He was really relaxed and put me at ease after a rigorous first couple of rounds of interviews.Advice: Brush up on whichever programming language you are most comfortable with. Don't lie about this! Like very basic theory and syntax, and those little nuances that you might be asked on an AP CS test or an intro CS test in college. Even if one of the on-site interviews goes badly, regroup between rounds and knock the next one out, and they will vouch for you (believe me...)",
        "questions": [
            "What are the differences between Java and C++?  ",
            "Given an array of integers, write an algorithm to find the largest sum of consecutive integers in the array.  ",
            "Describe how you would implement a HUGE phone book where a user would enter the first three letters of a name and the program retrieve all names with those first three letters as fast as possible.  "
        ],
        "date": "Mar 15, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "Meet junior developers first, then senior developer and then finally HR. Straight to the point, no waste of time. A lot of detailed programming questions and also some brain teasers. Behavioral questions from HR as well.",
        "questions": [
            "Coding questions and brain teasers.  "
        ],
        "date": "Nov 4, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4 weeks",
        "role": "Financial Software Developer",
        "details": "I had applied online for the position of Financial Software Developer. The first step was an IQ test. The second was a phone interview. The interview consisted of questions on C++, Algorithms and puzzles",
        "questions": [
            "Explain Polymorphism, Virtual Fuctions  "
        ],
        "date": "Dec 23, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "4 days",
        "role": "Financial Software Developer",
        "details": "Received an e-mail one day after application asking to make an online test. Since I selected C++ as the language with which I feel more comfortable, the test consisted on few C++ hard questions, it was not an IQ test as I expected. Got Proficient level (3.23/5) at the test, about 25-30 questions and 3 minutes to answer each. Reading from other reviewers, I think they only contact you for…  the in-house interview when you get Proficient Level of Advanced (from 3.50 to 5), which seems to be the second filter after skill assessment. Next working day received an e-mail informing of refusal (good to know, anyway).",
        "questions": [
            "Multiple choice questions on: Headers, Variable declarations, Functions...  "
        ],
        "date": "Oct 4, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "Applied online. Received email asking to give a online test. Test had quantitative questions many of them tested how much attention to detail is given. Some were really good questions. Some questions asked to count number of particular letter present in a passage. There were 2 questions based on long passages. Every question had around 3 min to answer. Some questions were on orientation of objects",
        "questions": [
            "Count the number of appearance of h from given passage  "
        ],
        "date": "Oct 25, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "whiteboard coding and operating system questions about process scheduling and memory management",
        "questions": [
            "reverse a word, then reverse a sentence in place  "
        ],
        "date": "Oct 18, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2 weeks",
        "role": "Financial Software Developer",
        "details": "Spoke with Bloomberg at the university career fair and was asked for 1:1 interview the following week. Consisted of one question regarding dynamic arrays and was subsequently asked for followup interview week later. Was rejected via email following week.",
        "questions": [
            "Why Java vs C++? Why C++ vs Java?  ",
            "Reverse singly linked list  "
        ],
        "date": "Oct 18, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "3 days",
        "role": "Financial Software Developer",
        "details": "Got this interview opportunity from a campus job fair. Met with two engineers on the first two days and another 2 people from HR on the third day. They were kind, but a little bit impatient. Overall speaking, it was a nice interview experience.",
        "questions": [
            "They would definitely ask you to write some code to solve some simple problems.  "
        ],
        "date": "Oct 26, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "4+ weeks",
        "role": "Financial Software Developer",
        "details": "Talked with recruiter at College Career fair. Got a call a few days later about meeting them for an interview. First round interview was with two younger software developers. All technical questions--database page pinning, hash vs tree, design a phone book, and a couple coding questions. After the interview they left the room for a couple minutes to deliberate. Came back and asked if I could come back the next…  day for another interview. The second interview was very similar but with only one person. Once again technical questions, a little bit about my resume, and a coding question. He then told me that a senior R&D guy was coming for final rounds in a couple weeks and asked me if I was interested in scheduling my 3rd round right then. The third round consisted of a 30 min interview with an HR woman and 30 min with an R&D manager. HR interview was typical HR questions, the R&D interview seemed very casual. He Asked me if I was planning to go to grad school and what I thought about implementing patches and quick fixes. A week later I got a call and email with an offer.",
        "questions": [
            "Given a binary tree and a depth, print out all the nodes at that depth  ",
            "Given an integer, print it in a string with proper comma placement. Ex. you're given the integer 1234567 you should print 1,234,567  ",
            "Insert an element into a sorted linked list  ",
            "How would you design a phone book if you didn't have enough memory to keep all the entries in RAM?  "
        ],
        "date": "Oct 31, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 days",
        "role": "Financial Software Developer",
        "details": "The brunt of the interview process consisted of three one on one technical interviews in one day. Each included actual code writing dealing with a fairly straightforward problem (implement a string class, what happens on this stack, pointer stuff), and a more theoretical topic (discuss synchronization, design a solution for a given set of requirements, discuss data structure trade offs, different implementations of hash tables).There was one brain teaser clearly…  designed to test how the interviewee thought. The question was very fair, and had a verifiable mathematical solution. I didn't grasp it immediately but once the interview gave some subtle hints as to the quantities that needed optimized I arrived at the correct solution.Overall the interviewers were all competent and more knowledgeable than me, which is a definite plus, and I felt they were all in a good position to evaluate me fairly.At the end of the day I was told to come back two days later for another interview, non-technical. It was a brief personality bit, at the end of which I was offered a full time position.",
        "questions": [
            "You have two identical very strong eggs, but you don't know how strong they are. You decide to test their strength by dropping them off different floors of a 100 story building. What is the minimum number of drops in which you can always find the shortest fall that will break an egg?  "
        ],
        "date": "Apr 11, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "On campus interview 1:1",
        "questions": [],
        "date": "Oct 11, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3+ weeks",
        "role": "Financial Software Developer",
        "details": "I had an online C++ test, followed by a telephonic interview. Online test had lots of multiple choice questions , almost all C++ syntax and pointer related. Telephonic interview was good again mostly about C++, quiet interesting questions about V-tables, polymorphism etc. During the in person interview I was asked a couple of algorithm questions not too difficult.",
        "questions": [
            "Explain how memory heaps are implemented  "
        ],
        "date": "Jul 8, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "The first round consists of an online technical test in C, C++, JAVA or C# (you can chose any one of those). Next round consists of a phone interview which consists of some questions on C/C++.",
        "questions": [
            "what is the size of an empty class ?  "
        ],
        "date": "Oct 3, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "2 days",
        "role": "Financial Software Developer",
        "details": "Applied, took a basic IQ test. Pretty simple, basic low level GRE or GMAT quant questions. Scheduled a phone interview which will be mostly technical questions. I have limited C experience.",
        "questions": [
            "How many I's in a paragraph  "
        ],
        "date": "Aug 16, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "Applied online by mailing in a CV and Cover Letter. Had to take a test online and scored in the advanced category. Was invited in for an interview. The interview took about 3-4 hours and consisted of 3 stages. First a team lead and a senior developer asked basic questions concerning the items on my CV and skills. Also, i was given a few questions on C programming. The second…  interview focused more on problem solving, data structures and complexity. Finally, had a chat with HR and was given a tour of the office building.",
        "questions": [
            "Why do you want to work for Bloomberg and not for Google for example.  "
        ],
        "date": "Jul 22, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 days",
        "role": "Financial Software Developer",
        "details": "Just got done with 'Online technical assessment' which were all IQ type questions. Most of them were rotation of graphics, logic and mathematical questions, some verbal types too. I was thinking the test would be technical since I am from a Computer engineering background but it was all IQ and they've sent me an email to set up a technical phone interview.",
        "questions": [
            "a guy drove at full speed for 3 hours after which his engine blew out and then he drove at 1/5th of original speed for the last hour. the total distance was 512 km, what was his initial full speed?  "
        ],
        "date": "Jul 19, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "Applied online for Bloomberg's FSD position. Received an email about two weeks later that I passed screening and to write an online programming test in your choice of programming language. I wrote the C test, which is fairly easy, but it requires you to be familiar to be with the Standard C library functions, some I/O functions, and simple string manipulation. There is 30 questions in total with 3 minutes…  per question.I estimate I performed okay, but probably did not know well enough because did not know a few answers from the top of my head. Waiting to hear a response back. Either way, it is a good refresher test for interviews.",
        "questions": [
            "What function in the Standard C library may be used to convert a long to a string?  "
        ],
        "date": "Jul 3, 2010"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "I Have an interview and i need help to get answers of questions which are asked in the online previsor skills assesment test.",
        "questions": [
            "Flow chart  "
        ],
        "date": "Aug 12, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "I applied for financial software developer several weeks ago, got the email from them including a link to take a online test last week, it's like an IQ test,questions are like: graph rotation, basic math problem,flowchart problem, GMAT logic problem. After one day got the email from them to set up a phone interview with me.",
        "questions": [
            "give you a flowchart, find the result  "
        ],
        "date": "Jun 15, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Financial Software Developer",
        "details": "Within 2 weeks after I submitted my CV I have recevied email from bloomberg and asked to take an online test and completed it within 3 days. The test was all right, you get three mintues for each question, although there are some questions that you might not heard of, you can still look up it on the internet quickly and then came out with an answer. After 2 days…  I received an email that invited me to a telephone interview. Will come back and share my experience afterwards :)",
        "questions": [
            "Question gives out some options and ask you which one is not a common revision control system :S  "
        ],
        "date": "Jun 6, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "Applied through university career database and received an email ask to take a screening test 2 weeks later. The test consisted of IQ, basic statistics, and basic data structure, 30 questions and 3 min for each; got a notification of phone interview 20mins later after finishing the test.",
        "questions": [
            "2, 3, 5, 7, what comes next  "
        ],
        "date": "Apr 17, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "hr was pretty prompt with reply after application. got sent this online test at first, then got invited to interview a few days later. the office was pretty impressive. old looking building from the outside, all modern and arty inside. guests need to wear a photo name badge at all times or security will get mad. reception area is the kitchen with large amounts of free food and drinks. interview…  was 1 hour, 2 on 1. starts with why bloomberg, then goes on to c questions. had to write code on paper on the spot. ends with a logic question.",
        "questions": [
            "2 pieces of string of different length and non-uniform width, each take one hour to burn. the remaining length of a burning string doesn't tell you how much longer it burns for. with a lighter measure 45 mins.  "
        ],
        "date": "Apr 29, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "I applied online for Financial software developer position and got an email saying that i have to take skills assessment test.I was expecting questions on C++ but as i am from non CS background i had got all analytical questions.Some of them were simple and some required more time.I had to solve 30 questions in 90 min.I passed the test and now i have phone interview on 1st march.",
        "questions": [
            "1,2,3,5,7.... what will be the next number in series  "
        ],
        "date": "Feb 16, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "a week",
        "role": "Financial Software Developer",
        "details": "I submitted my resume online. About three days later, I received an email to imform me to do an online test. The test is all about logic questions. 20 questions, 3 mins for each one. Then I received a phone interview later. They asked me some questions about my resume. And give me three logic questions to solve.",
        "questions": [
            "give you 3L bottle and 5L bottle, to get 4L water.  "
        ],
        "date": "Feb 27, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "I applied through the university. Got selected for the first round of interview:Questions:1) Templates, polymorphism, implementation of strnlen function, find a cycle in the linked list, find the length of the cycle in the linked list, implement queue with the help of stacks, static and global variables, vtables",
        "questions": [
            "vtable, polymorphism  ",
            "Find the cycle in the Linked list, length of the cycle  "
        ],
        "date": "Mar 31, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Difficult Interview",
        "length": "2+ weeks",
        "role": "Financial Software Developer",
        "details": "I think their selection process is very fast: after sending my application, they asked me to take an online assessment on Java (The language I choosed). If you don't know java very well, it's difficult, but google can help! :) Then I was asked to take a phone interview.. They send me this file:Dependent on programming language proficiency, you can be asked technical questions around but not restricted to the…  following areas:C• Pointers• Variable types/scope• Program architecture (memory, stack, heap, registers, etc.)• Read/write small code examples.OO & C++• Object Orientated Design• C++ constructs that support OOJava• Objects and Classes• Java virtual machineUNIX• Unix architecture (file system, piping, stdin, stdout, stderr, etc)• Basic commandsData structures & Run-time analysis• Basic data structures• Run-time analysis of data structuresNow, I stated my proficiency language was Java, and the phone interview was about C.. They asked about pointers, heap/stack, bitwise operations, hashtables.. I have not been programming C since more than 1 year, so it was more a memory exercise than a job interview..AN hint: they actually work with C++ and C under Unix, so i suggest to choose directly C and refresh this language instead of bothering with Java.",
        "questions": [
            "what is an hashtable? What if I have multiple values which hash to the same value?  ",
            "how can I count the bit set to 1 in an integer? What if I want to optimize the process to work with several integers?  "
        ],
        "date": "Feb 3, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Financial Software Developer",
        "details": "Applied through my universities career center. I got an email in around three days asking me to take an online assessment. Since I am a non-CS major it was more of an aptitude test. Once I cleared the test I was asked to schedule a phone interview. The phone interview is yet to take place. Will keep you posted on how it went.",
        "questions": [
            "They gave me a passage and asked me to count the number of i's.  ",
            "There were a few shape manipulation problems.  "
        ],
        "date": "Jan 24, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 days",
        "role": "Financial Software Developer",
        "details": "I was informed that i have 1st round technical interview at the office on saturday at 8:45 am. The interview was for 30 mins. Questions were easy . C and data structures questions. Most of the questions I had already seen in Glassdoor. Only negative was that i was informed about the interview very late, just 2 days before. SO i was not well prepared and was low on confidence.",
        "questions": [
            "none  "
        ],
        "date": "Jan 29, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2+ weeks",
        "role": "Financial Software Developer",
        "details": "Initial There was a Skills test in C language after that they took a telephonic interview.The interviewer after going through the resume wanted to explain a recent project. After that there was one coding question on swapping of 2 strings , then giving a real world problem he asked which data structure would you use and why?. Then there was a question on Algorithm.",
        "questions": [
            "Given an input of stream of words find the most recurring word. what is the data structure used for this purpose. what will be the time complexity of that.  "
        ],
        "date": "Jun 20, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Financial Software Developer",
        "details": "There is an online test first. You will make choice about which language to use. Actually you'd better use Cor C++, since the company really don't want someone who is not good at C/C++. If you choose java, the test will sure to make you crazy. Then I was chosen to have a on_campus interview with one of the recruiter, he just ask me several coding questions and give me…  an paper to write down. The sorting algorithm and stocking algorithm.",
        "questions": [
            "Could you write an quick sort algorithm, you can use any language.  "
        ],
        "date": "Jun 27, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Financial Software Developer",
        "details": "I applied through our university recruiting website and was asked to take an online assessment test (i preferred C). After that, they asked me for a technical phone interview with 2 people mostly related to C++ and my past projects. C++ questions focused mostly on virtual functions, memory management, access specifiers, etc. There was also a logic question based on finding some digit in a specific decimal place for a…  large power of 2. That was pretty much the set of questions and they asked me to come for an on-site interview.",
        "questions": [
            "how will you find a digit in a specific decimal place of a very large power of 2  "
        ],
        "date": "Dec 22, 2009"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "I submitted my resume to Bloomberg in response to their post on my college career website. Heard back from them within a week telling me that I had to take an aptitude test. The test consisted of comprehension, math, logical, shape manipulation questions etc (I'm from a non-CS background). The next day, they asked me to schedule a phone interview with them. Let's see how that goes..",
        "questions": [
            "count the number of t's in the passage!  "
        ],
        "date": "Jan 4, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Financial Software Developer",
        "details": "I applied online for the Financial Software Developer position. The job description said the interview process would be a technical test and an in house interview. The next week I received an email asking me to do an online skill assessment. The website is called select2perform, quite similar to brainbench. My test is on Java since I chose Java as my most proficient language in my online application. I got…  3.89 out of 5, in the Proficiency Level of Advanced (3.51-4.50). Percentile of global population is 94, and 91 for company population.After three and half weeks, I got a phone call for an on site interview. It consists of three sessions. The first two are mainly technical, with some behavioral questions such as why I want to work for Bloomberg. In the first one, they asked a little bit about my previous projects, some concepts questions, and data structures. Then I was asked to write some code. They said I could do it either iteratively or recursively. I chose to use loop, and they asked about the reason, and what were the potential problems of doing it recursively. In the end, they asked some logic questions, which were not very hard. In the second interview with a couple of senior R&D people, after some general questions, I was asked to write some more code. They asked my idea first, and then pointed out conditions in which the idea wouldn’t work, so I needed to modify it. After they were satisfied with the idea, I wrote the code. Then they asked how I could make sure the code is correct, etc. They did not need you to be perfect in syntax, and you can write pseudo code. The last session was with the HR. Typical behavioral questions, and it was very positive experience. I asked questions about the role, the company and the recruiting process. She said usually a decision would be made quite fast, typically in about three days, and if they were uncertain about a candidate, they might have another phone interview.The next day they called to make an offer and I accepted it.",
        "questions": [
            "write a function that returns the first unique element in an array  "
        ],
        "date": "Dec 4, 2009"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "I applied online for the position of Financial Software Developer. This was an Entry-Level Position. When completing your application form, you will have to chose which programming language you BEST know. This will affect your online test. I choose C++ as my best language and was invited to complete an online assessment test.Some people said that their online assessment test consisted of figure orientation, logic, math problem questions. My online…  test was way more DIFFICULT than that, and consisted of C++ questions ONLY. Test included questions on virtual functions, friendship, template, catching exception, class access, constructors and destructors, memory heap. In my opinion you have to have a CS major with strong understanding of C++ fundamentals to get this test right.I got a final score of 2.75/5.0 which is a 'Proficient level' according to Previsor/BrainBench, but got rejected.",
        "questions": [
            "template&lt;class T1; class T2; class T3&gt;int Product (T1 a, T2 b, T3 c){      return a * b * c;}What is the error in the sample code above?  ",
            "Why should malloc never be directly used to dynamically allocate instances of a class?  "
        ],
        "date": "Nov 23, 2009"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "I applied for a Financial Software Development entry level position and when filling my application they asked my strongest programming language among c,c++, and Java. As I had previous experience with Java I selected it as my strongest language. The following day they sent me an email with instructions to take an online skills assessment. Reading this forum, I practiced a few IQ/Intelligence test with good results so I felt…  confident to take the test. I took the test and to my surprise it was all Java programming questions (syncronisation, inheritance, interfaces, polymorphism, analysing pieces of code, etc). The questions where very specific and not about general OO programming concepts eg. Which one of the following is NOT polymorphic behavior? As I've been out of practice a bit in hands on programming I really struggled with the test. Basically I didn't remember clearly the syntax and got confused with some sentences. My recommendation is that you should study throughly your programming language selection and be ready for tricky questions.",
        "questions": [
            "Which one of the following is NOT polymorphic behavior?does java.io have for preventing malicious code from altering Serialized Objects?What support does java.io have for preventing malicious code from altering Serialized Objects?  ",
            "When using an ArrayList as the implementation for a list collection, what happens if adding an element exceeds the ArrayList's capacity?  "
        ],
        "date": "Jul 30, 2009"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Financial Software Developer",
        "details": "First round is phone interview, second round is on-site. By the way, I apply an internship, not full time job.",
        "questions": [
            "How C allocate a piece of free memory?  "
        ],
        "date": "May 4, 2009"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "4 days",
        "role": "Financial Software Developer",
        "details": "1) Reverse a Linked List2) wat are interfaces, abstract classes , diff between them etc ?3) Given a set of tasks with a duration and a deadline, how do you define a scheduling algorithm to minimize total lateness? and how to minimize # of late tasks?4) Why Bloomberg ?5) Why Finance ?",
        "questions": [
            "Y finance ? Y not other Tech companies  "
        ],
        "date": "Feb 20, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "They were very fair, but questions were extremely technical. They explained the company culture to me and the HR rep was very friendly. I could tell that they were very business minded and I feel their company culture stressed efficiency and hard work.I did not receive an offer, but I was under qualified for the position.",
        "questions": [
            "explain one way you would go about solving XXX...  ",
            "With an unknown function with an unknown number of data points, how do you try to estimate the rest of the function?  "
        ],
        "date": "Oct 20, 2009"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "They were very fair, but questions were extremely technical. They explained the company culture to me and the HR rep was very friendly. I could tell that they were very business minded and I feel their company culture stressed efficiency and hard work.I did not receive an offer, but I was under qualified for the position.",
        "questions": [
            "explain one way you would go about solving XXX...  ",
            "With an unknown function with an unknown number of data points, how do you try to estimate the rest of the function?  "
        ],
        "date": "Oct 20, 2009"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Financial Software Developer",
        "details": "They were very fair, but questions were extremely technical. They explained the company culture to me and the HR rep was very friendly. I could tell that they were very business minded and I feel their company culture stressed efficiency and hard work.I did not receive an offer, but I was under qualified for the position.",
        "questions": [
            "explain one way you would go about solving XXX...  ",
            "With an unknown function with an unknown number of data points, how do you try to estimate the rest of the function?  "
        ],
        "date": "Oct 20, 2009"
    }
]