[
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "8 weeks",
        "role": "Technology Analyst",
        "details": "It was your average interview process with a lot more competition. Got through a first round of interviews and then was asked to come in for a super day session. The super day consisted of a tour of the company, an overview of the program, a panel of current technology analysts, two interviews (technical & behavioral), and a presentation.",
        "questions": [
            "What is the difference between method overload and override?  "
        ],
        "date": "Mar 29, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Technology Analyst",
        "details": "I had two rounds of interviews back to back for 30 minutes each. They were very fast! I had 25 minutes of questions from them then 5 minutes of time for me to ask questions. They asked me about my past group work experiences as well as what technical skills I was strongest at.",
        "questions": [
            "Tell me a brief summer of the coding techniques you know.  "
        ],
        "date": "Mar 8, 2016"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1+ week",
        "role": "Technology Analyst",
        "details": "Short 30-minute interview on-campus. The application was found on the university recruiting web site, and after the first interview, I was directed to apply on the JPMorgan Taleo site.",
        "questions": [
            "What is the SDLC?  "
        ],
        "date": "Jan 4, 2016"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Technology Analyst",
        "details": "Landed a first round interview through a recruiter, got called back for the SuperDay interview the very same day. Each interview was a week apart. First round was basic technical/behavioral questions. Asked surface technical level questions as well as behavioral related questions such as I you would keep up with the current tech industry. SuperDay interview consisted of 2 interviews and 1 presentation. Could've picked a more complex project to…  showcase (I basically demoed a simple form application written in PHP) during my presentation. The 2 interviews (technical/behavioral) were pretty straight forward. Not as technical as I expected. Got the offer about a week later.",
        "questions": [
            "What is the difference between Waterfall and Agile software development methodologies?  ",
            "What are the 4 principle of object-oriented programming?  "
        ],
        "date": "Dec 15, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Technology Analyst",
        "details": "3 rounds1. Aptitude test - It was based on Math, English, logic and programming. Not so difficult if you have basic knowledge in each (I am not so great in either still I could top the test)2. Group Discussion (Current affairs- here they want to see how well you can put your point forward without being rude or condescending)3. Interview (Behavioral and some technical questions)",
        "questions": [
            "Behavioral and some technical about java and database  "
        ],
        "date": "Nov 27, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "a week",
        "role": "Technology Analyst",
        "details": "I applied after a tech seminar was held at my school. A month later I was asked for a campus interview for the first round. The first interview was based on behavior, skills and technical knowledge. A day after the first interview, I recieved an email saying I would go to the Super Day interview. The event composed of two interviews, one behavioral and technical as well as a presentation…  on a project I worked on. Each interview was a half and hour and rotated among the other candidates, giving a half hour break between each. The behavioral interview went over my resume, skills and goals, while the technical was on coding, IT and programming knowledge. The presentation and behavior interviewers were extremely nice and relaxed while the technical interviewer was serious and asked question after question without much feedback from any answer I gave.",
        "questions": [
            "Why JPMorgan and Chase?  ",
            "Explain the efficiency of garbage collection in Java and C.  ",
            "How to make a looping program more efficient.  ",
            "Explain the difference between the file systems used by OSX And Windows.  "
        ],
        "date": "Nov 21, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "a week",
        "role": "Technology Analyst",
        "details": "I applied through my campus's hiring website and got a call for an interview within a week or 2 of applying. After receiving the call about the first interview it was scheduled 3 days after on campus. That interview was about 30 minutes and mostly behavioral with a little technical questions. Most of the behavioral questions were to see your work ethnics and how you work with others.After the campus…  interview the next interview is Super Day, which are 3 interviews, behavioral, technical and presentation. The behavioral interview asked about your past experiences, while the technical interview went over basic computer questions related to the programming languages that you know. Presentation was a one on one presentation about a project you've done in the past or about a subject of your liking.",
        "questions": [
            "Where do you see yourself in 5 years?  "
        ],
        "date": "Feb 29, 2016"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Technology Analyst",
        "details": "Applied through on-campus career services. Heard back with an interview invitation about 2-3 weeks later. Was supposed to have 2-30 minute interviews but ended up having 1-45 minute interview consisting of both technical and behavioral fit questions. Understand why you want to work at JPM and have a good answer prepared for it.",
        "questions": [
            "For a startup company which would be the best type of cloud computing model for it to adopt  ",
            "Explain the difference between Normalized and Denormalized data  "
        ],
        "date": "Oct 18, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 days",
        "role": "Technology Analyst",
        "details": "The process was similar to many other big firms that I interviewed at. A first round interview on campus that was both behavioral (running through resume, asking about a time you did something and the outcome) and then some technical questions asking about what technologies I work with and what I want to work on. The interview was a nice back and forth conversation. From there, I received an email…  a week later inviting me to their office for a super day. The super day consisted of a behavioral interview, technical interview, and a presentation. I found out a week later that I received an offer.",
        "questions": [
            "How do you stay up to date on current events, both in technology and the economy?  ",
            "What do you know about cloud computing and virtualization?  "
        ],
        "date": "Dec 3, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "3 weeks",
        "role": "Technology Analyst",
        "details": "I applied through College/University. I scheduled an in-person interview on campus. The interview was about an hour long, with a mixture of behavioral and technical questions. One week later, I was invited to their super day on-site. I interviewed with three interviewers for 30 minutes each, and one included giving a presentation.",
        "questions": [
            "Technical questions included OOP fundamentals such as inheritance and polymorphism.  "
        ],
        "date": "Nov 3, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Technology Analyst",
        "details": "I applied to the full-time technology position, and I had an campus interview that lasted 30 minutes. There was a combination of common technical and behavioral questions, but nothing too hard. The technical questions were simple. The interviewer also asked about how I kept up with technology. In addition to the interview, I attended their hackathon called Code for Good, which seemed separate from the interview process. However, a few…  weeks after attending the hackathon, they offered me the position based on my performance there.",
        "questions": [
            "How do you keep up with new technology?  "
        ],
        "date": "Dec 30, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Technology Analyst",
        "details": "I applied to JP Morgan from the university placement portal. I received a mail regarding the interview and it was scheduled in my university campus . I prepared well for technical questions.Was not asked a single technical question. Just asked me about my projects and a couple of behavioral questions and done! Heard back after a week that I was not selected. I tried mailing asking for the reason for…  rejection, so that I could do better in the future, never received a reply!",
        "questions": [
            "Questions about my projects  "
        ],
        "date": "Jan 8, 2016"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "6 weeks",
        "role": "Technology Analyst",
        "details": "Applied through my school's career website. On-campus interview requested around a few weeks later. I selected the earliest interview slot because I would rather be first or last in the interview lineup. It was 30 minute interview with a mix of behavioral and technical questions. I received an email a few days later that decisions of moving on will be sent in a week. In a week, I received a…  notification that I was selected for their Super Day. Super Day was on a Friday from 1:30pm-3:30pm. Most of us got in at 1pm and were able to talk to current analysts. The interview was split into three 30 minute parts: two behavioral/technical interviews and a presentation about a project you completed in the past. The order is random, but I got a sit down talk, presentation, and another sit down. The sit down talks are both behavioral/technical. The presentation was me talking for 15 minutes and the other 15 for questions. Got an email 4 days later with the job offer.",
        "questions": [
            "If you had to, would you invest in future software or the current company system that works?  ",
            "What are the benefits of polymorphism?  ",
            "What is the difference between an array and a linked list?  ",
            "What is normalization? When would you use denormalization?  ",
            "What are the phases of software development?  "
        ],
        "date": "Mar 7, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Easy Interview",
        "length": "8+ months",
        "role": "Technology Analyst",
        "details": "They reached out for an interview with me. They had one date open during which I had a conflict and they only gave me a two week notice before it. I was no able to make that interview. Took me calling their Technology Analyst Program HR members approximately 8 times to receive a call back for them notifying me that they were no longer seeking candidates for this position. They…  contacted me for an interview and basically dropped the ball and had the worst communication I have ever seen from a well established company. This was an absolutely horrendous job by their HR department.",
        "questions": [],
        "date": "Mar 9, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "2 days",
        "role": "Technology Analyst",
        "details": "There were three interviews of about thirty minutes length each. They were not too hard or complicated. Focus was on algorithms and just general knowledge of programming. It seemed rather easy for me but that just might have been my own personal experience. I cannot offer much more help.",
        "questions": [
            "Basic Questions About Java  "
        ],
        "date": "Dec 5, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4 weeks",
        "role": "Technology Analyst",
        "details": "From a college job fair, there was a \"next day interview.\" Following this, after a few weeks, one Monday was told that I had been selected for the next round, which was on Friday. Luckily I had no plans and went to the interview. It consisted of three parts: a presentation, a technical interview, and a behavioral interview.",
        "questions": [
            "Tell me about a time you felt you weren't being used to your full potential, and how you solved it.  ",
            "Various questions about polymorphism, inheritance, encapsulation, abstraction, etc  ",
            "Describe your method you go through when writing a program  ",
            "Difference between an array and a linked list  "
        ],
        "date": "Oct 8, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Technology Analyst",
        "details": "It was through campus, they set you up to interview with 3 different current employees who are trying to see if you will be a good fit for the company and what area should you work in.",
        "questions": [
            "Simple questions going over my resume, project, and leadership experience.  "
        ],
        "date": "Oct 5, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Technology Analyst",
        "details": "Started through Campus application, recruiter followed up through e-mail for further application before On-Campus recruitment. Met with one senior member of similar role, basic questions. Focusing more for myself towards the Business Analyst role. Asked SDLC questions, Agile v. Waterfall. After first round, invited to SuperDay the following Tuesday. 3 half hour interviews , one of which is a presentation on a technical project. More interested in your technical skills…  and coding experience versus project management skills.",
        "questions": [
            "Nothing difficult or unordinary.  "
        ],
        "date": "Nov 5, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "2 weeks",
        "role": "Technology Analyst",
        "details": "I applied online through my college's career site. The interview was an hour long (two 30-min interviews with associates) at my campus. It was very easy, and I only spoke to two people. It was back-to-back. We just went over my resume basically. I wasn't asked really many behavioral questions. I felt pretty neutral when I left. Two weeks later I got a call with an offer. I was really…  surprised that I wasn't needed for another round/office visit. I ended up taking the offer.",
        "questions": [
            "I don't remember any specific questions at this point, but they weren't hard. It was purely a resume overview.  "
        ],
        "date": "Oct 7, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "4+ weeks",
        "role": "Technology Analyst",
        "details": "Application online and super day at their office. Two 30-min long interviews. One more technical and the other more behavioral.",
        "questions": [
            "How do you solve a problem that you've never encountered without Google.  "
        ],
        "date": "Feb 5, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Technology Analyst",
        "details": "first round. Describe a team project. How do you solve problems in team.",
        "questions": [
            "Describe a mistake you have made.  "
        ],
        "date": "Dec 7, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Technology Analyst",
        "details": "I did a first round on campus interview at my university. The interview was about an hour long and the interviewer covered basic behavioral and technical questions.I couple days got called back for Super Day, the final round interview, for an App Developer role. The interview was supposed to be 2 one-on-one interviews and a presentation. It ended up being 1 one-on-one interview and 1 presentation. The one-on-one interview was…  technical. He asked a couple questions about my resume. He only asked questions about C and SQL since I emphasized my strength in those languages. The questions were easy and basic. The presentation was in front of 2 people. We weren't allowed to bring any slides or presentation materials with us, but we were allowed to write on a white board. I draw a couple diagrams and talked about a project I had done. The interviewers seemed genuinely interested in what I was presenting and were very friendly.Overall, the interview went very well and everyone was very nice.The day after my final round interviews, the recruiter called me to extend an offer.",
        "questions": [
            "All questions were easy and expected.  "
        ],
        "date": "Nov 13, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 days",
        "role": "Technology Analyst",
        "details": "phone and onsite interview. Had an interview at the college mostly of course projects and co-oponsite HR and technical interviews 4 in numberalso focus on project management methodologies like Agile and Waterfall.some general questions about company and financial industry ..",
        "questions": [
            "basic behavioral and technical questions  "
        ],
        "date": "Dec 28, 2015"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Easy Interview",
        "difficulty": "-",
        "length": "-",
        "role": "Technology Analyst",
        "details": "First round interview on campus. Interview was one of the last ones of the day for Business Analyst role within the tech division for the Delaware/Newark office. Ridiculous number of behavioral questions that were all very typical. Interviewer also did not seem interested in my answers.",
        "questions": [
            "\"Name a time you paid too much attention to detail.\" followed by \"Name a time you didn't pay enough attention to detail\" \"Name a time you contributed to a group\" ect. Probably rapid fired about 6 of those in 45 minutes and I was struggling to think of more examples.  "
        ],
        "date": "Oct 16, 2013"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "2 weeks",
        "role": "Technology Analyst",
        "details": "The interview process was smooth. Initially had a 1:1 interview in my school. A week later I was invited to their NY office for a final round of interviews. The final round interview session had 2 one-on-one interviews and a presentation on a technical topic of my choice. The interviews were a mix of technical and behavioral questions.",
        "questions": [
            "I was asked questions about my previous projects. I was also asked a bunch of questions related to sql and few coding questions testing my knowledge about data structures.  "
        ],
        "date": "May 31, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Technology Analyst",
        "details": "Initially received contact that I would be having 2 1 on 1 interviews in person but a few days prior to the scheduled date, the interview was changed to phone interviews with a couple of VP's in the technology department. The first was more technical and relatively challenging (this was one of my first interviews) and after going over my resume and some career aspirations, my interviewer asked me to…  help him determine the a system for creating recommendations for customers based on their past credit card transactions. The second interview was much more behavioral, and it eventually transformed into an interesting discussion on some of the differences between Java and Python. My advice be prepared, but more importantly be confident, and if you need help don't be afraid to ask for it.",
        "questions": [
            "Tell me a joke...  "
        ],
        "date": "Feb 15, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Technology Analyst",
        "details": "Basic interview + offer.",
        "questions": [
            "General interview questions  "
        ],
        "date": "Jul 22, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "5+ months",
        "role": "Technology Analyst",
        "details": "I applied online initially in September 2012 and never heard back. I then got an e-mail asking to set up two phone interviews in January 2013. The Interviews were set up for a month later. The interviews themselves were quite easy. Basic questions about past experiences. They asked about my projects at my previous employer. The first interviewer seemed impressed that I had taked classes on computer security. The second…  interviewer asked questions like why do I want to work in the banking industry and why is it important for JPMC to work on things like advancing technology.I will say after the interview it only took them about a week to call and make my offer. When I actually got the call I assumed it was to invite me in for an in person interview but they said they liked me and wanted to offer me the position.",
        "questions": [
            "Why do you want to work in the banking industry?  ",
            "Tell me about a project you've worked on in the past?  ",
            "How did you handle trouble group members in your past projects?  "
        ],
        "date": "Mar 14, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Technology Analyst",
        "details": "Applied online and called to have an interview on the University campus.Two back to back interviews.First was a 1:1 but it was entirely the interviewer talking, very amiable.Second was with 2 interviewers.Very easy going, just went down the resume and asked questions about each.Only technical question was \"Do you know what an IPO is?\" (Initial Public Offering).",
        "questions": [
            "What do want to get out of this?  "
        ],
        "date": "Sep 28, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Difficult Interview",
        "length": "-",
        "role": "Technology Analyst",
        "details": "technical questions - oop, design patterns, syntatic sugarrelocation questions",
        "questions": [
            "What would you do if a team member is not performing as expected?  "
        ],
        "date": "Mar 23, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Technology Analyst",
        "details": "3 Rounds1 Round - behavioral questions2nd Round - technical questions3rd Roud - Group interviews",
        "questions": [
            "Not sure ... had the interview in 2007  "
        ],
        "date": "Feb 5, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "2 weeks",
        "role": "Technology Analyst",
        "details": "This was for the Summer Analyst technology role. The recruiter was extremely kind and professional, always with a quick response to emails and providing all the necessary information.",
        "questions": [
            "What is the difference between an inner and outer join? (SQL)  "
        ],
        "date": "Sep 30, 2013"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Negative Experience",
        "difficulty": "Easy Interview",
        "length": "3+ months",
        "role": "Technology Analyst",
        "details": "It was an unimpressive and apathetic interview process. I didn't feel like I would be a valued member in the firm like I do with other firms I interciew with. I had a first round interview on my college campus, and then was notified of a second round more than a month later. The second round was in Chicago and consisted of 2 behavioral interviews and a 15 minute presentation.…  The presentation was informal and I presented it to only one interviewer.",
        "questions": [
            "How would you improve the technology in your life?  "
        ],
        "date": "Nov 28, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Technology Analyst",
        "details": "if you are a graduate, your best shot is to go through the Corporate Development program. The interview for an intern is fair easy, so do your homework",
        "questions": [],
        "date": "Oct 14, 2013"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "3 weeks",
        "role": "Technology Analyst",
        "details": "On campus recruiting followed by on site Super Day... three interviews at Super day - one was a presentation, one behavioral, one technical... pretty simple stuff though.",
        "questions": [
            "Nothing difficult... just be able to talk about your experience  "
        ],
        "date": "Dec 16, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "4+ months",
        "role": "Technology Analyst",
        "details": "After applying for the internship online, I received an email inviting me to interview with them on Campus(The Ohio State University). The interview was 1:1 and most of the questions were standard interview questions. After interviewed, I waited over 2 months to get a response, which was the most negative aspect of the interviewing process.",
        "questions": [
            "Name a time in which you went above and beyond what was asked of you.  "
        ],
        "date": "May 8, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Technology Analyst",
        "details": "First round consisted of two half-hour back-to-back interviews (so a total of 1 hour). First interviewer seemed very unprepared and not sure what to ask. Second interviewer was more like a test to see how you react under pressure. This position is definitely meant for someone who works well under pressure with many tasks to complete a day.",
        "questions": [
            "List three things you would do to get a coworker who isn't fond of you to like you.  "
        ],
        "date": "Feb 9, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Technology Analyst",
        "details": "Initially received an email through my college from a JP Morgan Chase recruiter describing positions available. I emailed recruiter back, got a phone interview setup within about a week. Phone interview was 30 minutes long, standard interview questions. Only question that I couldn't answer was about the companies recent earnings report. Do some homework about the company before you interview. Just a few days after the phone interview, I received…  an email invitation to come to New York for the super day final round interviews. You are going to fly in and out on the same day, no hotel overnight. Super day interview consists of three 30 minute long interviews, each with different people. One of the interviews will be a presentation you give on any topic of your choice with one interviewer. All the interviews are standard interview questions, \"Tell me about a time when...\" The most technical question I had to answer was \"How would you describe object oriented programming to a non-technical person?\" Before you come to the super day interviews, think back about projects you did in college and be able to describe the people you worked with and the results of the projects. Everybody was very nice and professional, much more casual interview than what I was expecting. I was interviewing for an Application Developer position, so I was expecting coding problems but didn't get any. I think it was only three days after the super day interview that I received an email with a job offer, and I accepted.",
        "questions": [
            "How would you describe object oriented programming to a non-technical person?  ",
            "Tell me about a time when you had to go above and beyond what was expected of you.  "
        ],
        "date": "Dec 20, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Technology Analyst",
        "details": "Started with a phone interview which was all behavioral and \"tell me about yourself\". About a week after the interview, I received an invitation to Super Day, which was a couple weeks later. If you're interviewing in Columbus, OH be sure to leave plenty of time to park, because the visitor lot will probably be super packed. The people you'll meet at Super Day are pretty laid back. I did…  two regular 1:1 interviews and a presentation, which was pretty much just another 1:1 interview where you mostly talk about a project that you worked on. I created a nice handout outlining the project that I wanted to share. If it's a technical project, definitely focus on relating it to a non-technical employee, since the person you're presenting to may not have a very technical (e.g. programming) type role. All of the questions were behavioral -- nothing technical. The hardest part of the day is talking for so long. They'll offer you bottles of water...you should probably take one.",
        "questions": [
            "Explain a time when you showed leadership.  ",
            "Explain a time when you had a problem teammate.  "
        ],
        "date": "Jan 13, 2011"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Technology Analyst",
        "details": "The interview consisted mostly behavorial questions. They sought out my people skills and communication skills. The presentation cosisted of a technical project that I either did in class or on my internship. Just be confident and ready to show your personaility when you walk in. They like a bright personality and someone who can explain themeselves and the work they do very well.",
        "questions": [
            "Tell me about a time where you had to balance different task and how did you handle it.  "
        ],
        "date": "Nov 29, 2010"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Technology Analyst",
        "details": "I was contacted by JPMorgan via e-mail several weeks after my first interview on campus. This interview was an on site interview called Interview Super Day. It consisted of two interviews and a presentation. The interviews were very casual. They have sheets of paper with standard questions on it and the interviewer will choose a couple. In the email it was asked that I prepare a technical presentation that was…  10 to 15 minutes about any technical project or idea you have worked on. I was expecting it to be a very formal presentation where I would deliver it in front of a panel and no one would speak until it was finished. Rather, I sat down one on one with the interviewer and it was more of a mix of a presentation and questions about the subject - much more casual than I anticipated.",
        "questions": [
            "Describe to me the software development life cycle.  "
        ],
        "date": "Nov 18, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "4+ weeks",
        "role": "Technology Analyst",
        "details": "The process started with a simple phone screen and then two follow up calls with hiring manager. The phone screen was with the recruiter and she asked typical questions about my background, reviewed position and asked how my exp would add value to the new team.",
        "questions": [
            "Why did you leave your last job?  ",
            "Give two examples of how your recent experience is going to help you add value to the new team?  "
        ],
        "date": "Nov 30, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Technology Analyst",
        "details": "i had applied online through my college career website. initial phone interview :mostly behavioral questions, then within the same week heard from them to come over to colombus,ohio for the super day.then on the super day.had a panel interview with VP's, a presentation and a 1:1 interview. Mostly behavioral questions and question based on my resume. received offer the very next day as the week was thanksgiving week, so they…  made decision soon and replied me the same..pretty good experience..",
        "questions": [
            "what conflicts you have faced?  ",
            "how you handle when you have too many things to do?  "
        ],
        "date": "Nov 24, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Technology Analyst",
        "details": "Easy questions, mostly about projects I worked on and types of classes I took. They asked couple of puzzle questions.",
        "questions": [
            "You a glass bottle with a message inside. How would you read the message without taking out the bottle cork or breaking the bottle glass?  "
        ],
        "date": "Apr 15, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Technology Analyst",
        "details": "I applied online a couple days before Christmas and received an email in February saying I had been invited to a Super Day interview. Consisted of two 1:1s and a presentation. It went pretty smoothly. Presentation is meant to be informal but I printed a copy out to stand out from the crowd. Everyone was nice and easy to talk to. The questions were all behavioral. I didn't get any…  technical questions during the interview. Be prepared to have a question or two to ask after each interview and the presentation. Overall I had a good experience. The interview was 2/25 and I heard back on 3/8.",
        "questions": [
            "Why did I chose the financial sector for a job?  ",
            "Toughest challenge faces the financial sector today?  "
        ],
        "date": "Mar 8, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "3+ months",
        "role": "Technology Analyst",
        "details": "It was a great experience, everyone at JPMorgan was nice and comfortable to talk to. The first interview was just a quick discussion about my previous backgroun and experience. The second round was composed of 3 parts. #1) panel interview with 2 VPs, #2) 15min presentation #3) 1:1 interview. The process was long almost 1 month went by between the 1st and 2nd interview and then another month between 2nd…  round and when I was told I did not get the job.",
        "questions": [
            "Tell me about some of the challenges facing the financial industry?  ",
            "The questions in the second round are all behavioral questions. So have many examples ready  "
        ],
        "date": "Dec 16, 2009"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 days",
        "role": "Technology Analyst",
        "details": "College recruiter came to campus, on-site interview with two current employers in the technology department that started as a business analyst/applications analyst.On-site \"super day\" consisted of 3 interviewers. behavior interview, presentation interview, behavior interview.",
        "questions": [
            "Describe a time you went above and beyond the call of duty.  ",
            "Describe a time you had a conflict with someone over a project and how was it resolved.  "
        ],
        "date": "Nov 23, 2009"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2 days",
        "role": "Technology Analyst",
        "details": "First Round Interview on Campus through Career ServicesSecound Round Interview in New York, NY (Super Day)",
        "questions": [
            "Tell me about a time where you had a conflict and how you went about it.  "
        ],
        "date": "Sep 9, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Technology Analyst",
        "details": "Interview was mostly about behavioral questions. No technical questions. Work culture seemed to be good and company is also listed in top-50 places to start career from Business Week journal. Interviewer just followed listed number of questions on the sheet of paper. Your answers gets noted in that paper. Use STAR methodology for every answer.",
        "questions": [
            "Have you gone above and beyond the call of duty?  ",
            "What is your greatest achievement in past year?  ",
            "Tell me about a participation problem you recently handled within a team from a particular member. Were you successful in resolving it?  ",
            "Advantages and disadvantages between using in-house development and outside vendor development?  ",
            "Tell me about your experience in explaining technical things to non-technical person.Describe each phase in software development life cycle and output after each phase.  "
        ],
        "date": "Nov 4, 2009"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 days",
        "role": "Technology Analyst",
        "details": "I made it past the first HR person interview to get called back to meet with a VP in Information Security. Both of these interviews were mostly behavioral questions \"Name a situation where\" etc. I was able to be a bit more technical with the VP because he understood my background more than the HR person. It was a bit long looking at now but it felt like it took…  no time during the interview. I'd say I had a positive experience.",
        "questions": [
            "Let's say that your supervisor asks you to do something that you feel is absolutely ridiculous, but that's the way it is due to policy in place. Do you do it, and possibly on a repeated basis? Or do you complain and try to get him to change the policy based on your educated input?  "
        ],
        "date": "Mar 18, 2009"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Technology Analyst",
        "details": "They had an on campus interview, which was mostly behavioral based. They they selected some of us to go on site and interview for a day where we did a 30 minute behavioral interview and then a 30 minute technology interview with some engineers on site. They then scored us appropriately, and called back within a two weeks of the interview with a job offer or not. Most of the…  people on the onsite interview got an offer",
        "questions": [
            "Write a program to produce a Fibonacci sequence  "
        ],
        "date": "Feb 14, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "3+ months",
        "role": "Technology Analyst",
        "details": "No testing in the first stage at all.First Round: 2 one-to-one competency interview, base on your understanding on the company/industry, nothing technical.Second Round Assessment Centre: 1 writing exercise involve basic data structure. 1 tech interview and 1 competency interview. One group discussion at the end.The staffs there are very nice and helpful.",
        "questions": [
            "How would you keep up to date with latest news?  "
        ],
        "date": "Feb 15, 2016"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3+ months",
        "role": "Technology Analyst",
        "details": "Overall process took around 3 months.Had a couple of online aptitude tests. After a month, had 2 telephone interviews(one competency and one technical). One month later was called for an assessment centre in Glasgow. The Assessment centre consisted of technical interview, competency interviews, group exercise (around 4 hours in total). Overall it was okay and just be yourself... Glassdoor was very helpful and there were not much of surprise questions…  on the day.",
        "questions": [
            "Which technology do you like? and what would that bring to JP Morgan?  "
        ],
        "date": "Feb 4, 2016"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 days",
        "role": "Technology Analyst",
        "details": "The first stage is two back to back telephone interviews, mainly competency based questions. If you are successful, you are invited to an assessment centre. The assessment centre lasts about 5 hours, and involves:- Written test with some technical questions about programming and IT infrastucture- Technical interview mainly based on your answers to the questions in the written test- Another competency based interview- A group exercise where you are required…  to evaluate an IT project",
        "questions": [
            "How would you apply what you have learned at university to your job?Describe a time when you have had to deal with a conflict at work?Describe a time when you have had to think on your feet?  "
        ],
        "date": "Dec 26, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "-",
        "length": "3 weeks",
        "role": "Technology Analyst",
        "details": "applied online, then I was invited to an interview which had two one-to-one chat.then got invited to assessment centre containing one written exam, two one-to-one chat, then a group discussion with other candidates.one-to-one chat focuses very much on determining thought process, teamwork. the written exam is technical, it asked about algorithm, and IT infrastructure questions.I really enjoyed the entire process, it is very well organised and relaxed, interviewers are from…  actual technical department, it's great to have a chat with them. It feels more like having an afternoon tea with classmate talking about technology etc. other candidates are all lovely too.",
        "questions": [
            "how did you handle a different opinion from another team member?  ",
            "what programming language are you good at? what can this bring to JPMorgan?  ",
            "Tell me about a technology you are interested  ",
            "How does binary tree work?  ",
            "how would you test a mobile phone?  "
        ],
        "date": "Dec 2, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "3+ months",
        "role": "Technology Analyst",
        "details": "2 stagesFirst stage: 2 Competency InterviewsSecond stage: Assessment Center consisting of group task, a technical test and review interview of your performance in the test.Should get an offer 1 week after the assessment center.",
        "questions": [
            "What sort of software do you prefer using?Situation based question  "
        ],
        "date": "Dec 11, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "2 weeks",
        "role": "Technology Analyst",
        "details": "Learnt about the opportunity from campus talks. Then I went to JPM Tech Workshop on 2 Oct. Submitted the online application one day before deadline. Received email on 7 Oct telling me the phone interview would be around 7 - 13 Oct and I was called on 8 Oct. Very typical phone interview questions. Self-intro followed by why banking and why JPM. Only about 10min and that's all. Surprising just…  after 1 hour I received an email inviting me to Assessment Center one week later on 15 Oct. Assessment center was a big day, one group discussion followed by 2 face-to-face interviews. Interviews were mainly behavioural questions and the only technical questions were SDLC and testing related. Be prepared to talk about your projects and experience. About one week later, on 23 Oct I received the offer call from JPM HR.A few tips:1. The interview reviews on Glassdoor are super useful.2. Be prepared. Be prepared. Be prepared. Repeated 3 times because it is important.3. No online tests. Don't bother practicing SHL, Kenexa, etc.4. Very simple recruitment process. Don't make mistakes and don't be shy then you will be fine.",
        "questions": [
            "Have you ever made a mistake in one project, but later in another project done well with thelessons learnt from that mistake?  "
        ],
        "date": "Oct 30, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "a week",
        "role": "Technology Analyst",
        "details": "The AC consists of a group exercise and two individual interview, one behavioural and one technical around 30 minutes each. The interviewers are quite friendly. Overall questions are as expected. Just be yourself. And it is important to give opinions on group exercise. it is important to prepare a good question to ask the interview.",
        "questions": [
            "why do you think you are fit for jp morgan.  ",
            "sdlc questions  "
        ],
        "date": "Oct 26, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "2 weeks",
        "role": "Technology Analyst",
        "details": "First I had a 30 minute behavioral interview with the standard questions: why JP Morgan, hobbies and interests, 5 year plan, etc. Then I was brought into the next room with a different interviewer for a technical interview where I told them about my experience and I got a few easy technical questions.",
        "questions": [
            "What is De Morgan's law  "
        ],
        "date": "Nov 6, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "3 weeks",
        "role": "Technology Analyst",
        "details": "Applied online and was sent straight to an assessment centre a week later, The day consisted of:- 45 minute technical exercise consisting of general technical questions to be answered in pseudo code- 1 hour technical interview 30 mins on explaining technical exercise, and the remaining 30 on general technical questions- 1 hour general interview with standard interview questions (why JP ect)We were then given a document to read individually for…  30 minutes on a \"proposal\" and then discuss in groups the proposal in front of staff who were in the room.",
        "questions": [
            "Why did you apply to work for JP Morgan?  "
        ],
        "date": "Nov 16, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Technology Analyst",
        "details": "The whole process consisted of 3 rounds.The first round was aptitude which consisted of 4 sections - Analytical,verbal,logical reasoning and technical ( mostly about algorithms and programming). All sections were of 20 marks each and were given 20 mins for each section. I cleared.The next round was technical interview , a panel of two and both were super cool. It went on for about 1 and half hour and it…  was very good experience. They basically ask all the things from your skills mentioned in your resume and thats it.All basics.I cleared.The round was HR and it will test you. Be well prepared cause this is the most important in JP.All the best.",
        "questions": [
            "A puzzle on probability. Using a coin instead of a dice in board game and to get all 6 numbers from that single coin.  "
        ],
        "date": "Sep 9, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Technology Analyst",
        "details": "Campus placement.Consists of three rounds:First round was a general written test consisting of quants, verbal and coding skills. The test was reasonably easy.Second round was technical plus HR round. Asked mainly from my resume and other brain puzzles.Third round was general HR round.The whole process took a day.",
        "questions": [
            "Basic concepts of Java  "
        ],
        "date": "Feb 23, 2016"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Technology Analyst",
        "details": "I applied through college/university.Location:Bangalore.Interview Process:1st round:80 MCQ's in 80 minutes.There were 4 sections(English,Aptitude,Math,Computer science) and each section contained 20 questions. Time limit of 20 minutes were given for each section. No negative marking.2nd round:Technical interview-All the questions were based on what is there in the resume.3rd round:HR round-Normal hr questions. Nothing complicated.",
        "questions": [
            "What is the difference between final,finally and finalize keywords in java?  "
        ],
        "date": "Nov 18, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Technology Analyst",
        "details": "well first round was 20 verbal questions + 20 data analytic questions + 20 aptitude + 20 C programming questions......For given time number of questions and format of questions was inappropriate",
        "questions": [
            "arrive at number 1000 by only using number 8 with any mathematical operators  "
        ],
        "date": "Aug 13, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Technology Analyst",
        "details": "The interview process had two rounds. Tech interview focused more on the projects listed in my resume and also included puzzles.It also had some HR type questions. HR was however a bit tricky and the interviewer tried to find flaws in all my statements. For instance i was asked whether i would like to work as a data entry operator.What if we don't give this job,Why JP morgan,What are your weaknesses…  .etcThe interviewer asked for reasons and then tried to rebut all of the reasons i gave as the interview progressed.",
        "questions": [
            "Why should I hire you?One achievement in my life that I can boast about..  "
        ],
        "date": "Aug 17, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Technology Analyst",
        "details": "I was recruitment through Code for Good hackathon help by JPMC. First there was an online form to be filled. Followed by two online tests: Quant and Verbal. Following this, a telephonic interview was arranged with a JPMC manager with questions mainly related to extracurricular activities and tech interests. Then there was a 24 hour hackathon to build a product prototype. Students were shortlisted for interview round which was Tech…  HR combined. Mainly Tech. Most interviews drilled on basics, especially OOP concepts. Apart from that, Project and Internship work based questions.",
        "questions": [
            "OOP Based questions1) Difference between struct and class2) What is enum?3) Difference between enum and arrays4) Polymorphism with real life example5) Exception Handling6) Garbage Management7) What is friendly class and which languages use it?  "
        ],
        "date": "Jan 15, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Technology Analyst",
        "details": "After submitting an application, you are then required to complete 2 psychometric tests: inductive reasoning and numerical. If successful, next stage is SHL Java test. I only got up to the phone interview but the subsequent stages were supposed to be an assessment centre and a face-to-face interview.About a week between each stage.",
        "questions": [
            "Tell me about yourself.  "
        ],
        "date": "Aug 10, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "6+ months",
        "role": "Technology Analyst",
        "details": "Applied for JPMorgan Code for Good Challenge-2015 through college. There were 2 aptitude tests followed by a resume screening. If cleared, there is a 'telephonic screening' where the students are judged on their projects and few HR aspects. The Code for Challenge is a 24-hours non-stop application development contest. Performing well their with your team which you meet for the first time gives you an opportunity to be recommended for…  the final interviews by different experts present at the event.",
        "questions": [
            "Java , Data Structures & Algorithms , Problem Solving , Puzzles, SQL , Projects and HR questions.Questions on Anagram and Strings were very much asked to me.  "
        ],
        "date": "Oct 6, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "3+ months",
        "role": "Technology Analyst",
        "details": "This was the first round of interviews (after an initial application screening). It consisted of two interviews - both interviewers were from technology teams. The first one focussed on my prior experience and the kind of projects I have worked on before. The second one was focussed on competency questions.",
        "questions": [
            "Have you ever made compromises in projects? How did that go?  ",
            "Have you ever had to change the way that you deal with people for a particular team member?  ",
            "Long description of one of my projects.  "
        ],
        "date": "Mar 29, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2+ months",
        "role": "Technology Analyst",
        "details": "1. Online Application2. Two face to face Interviews - 1 Technical & 1 Competency Based.3. Assessment Centre - Written Exercise, Technical Interview, Competency Based Interview, Group Exercise - Group Discussion, Written Exercise, Small interview.Overall positive experience. Key is to be confident throughout and radiate positivity and enthusiasm.There is nothing much one can do to prepare for the Assessment Centre as its an extremely tailored exercise. Brushing up key concepts such…  as data structures, object oriented programming, software development life cycle and methodologies before all the interviews may come in handy. Knowing about the company, it's businesses and familiarising yourself with the company website is equally important.Also checking online resources for tips on preparing for group exercises are helpful. I would strongly recommend going through all the reviews relating to your position on Glassdoor as it gave me a clearer picture regarding the entire process and nothing came as a surprise to me on the D-Day.",
        "questions": [
            "Which data structure is more suitable for this problem(based on the 1st written exercise)?  "
        ],
        "date": "Apr 10, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Technology Analyst",
        "details": "Two sessions. An interview and later and assessment center.First interview was skills and HR based. Then days later I was invited for the assessment center. Where there was a test, an interview to discuss the test results,A detailed technical interview, group work, and a final interview.",
        "questions": [
            "Group project recently worked on.  "
        ],
        "date": "May 26, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Technology Analyst",
        "details": "I applied in JPMorgan in nov 2014 and got call jan last week..they invited me for first round..in that, there were two interviews-- half an hour for competency based questions and half an hour for technical questions..interviewers were cool..the questions were prewritten and they noted down each response ..no selection but overall it was good experience",
        "questions": [
            "what are your strengths and weakness??Why this role?? tell me about your previous project??  "
        ],
        "date": "Mar 26, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2 days",
        "role": "Technology Analyst",
        "details": "Very well organised. Assessment centre was the best I've been too!First stage: 2 interviews - mostly competency basedSecond stage: 1 written technical exam + 2 technical interviews + group exercise + 1 written test + 1 interview",
        "questions": [
            "What would you do if your boss was completely wrong and you knew about it.  "
        ],
        "date": "Dec 3, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Technology Analyst",
        "details": "The interview was pretty good. Had 2 rounds.First was Technical. lasted for 20 mins. Was asked about questions related to things in my resume, on databases based on SQL, connection through JAVA programs. Was given a case and asked to write query for retrieval as asked, and then asked to optimize.Second was a HR interview. lasted for -8 mins. Was asked about strengths, weaknesses, what i would like to achieve,…  company research etc.",
        "questions": [
            "Tell me about the projects listed in your resume  "
        ],
        "date": "Sep 28, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "4+ weeks",
        "role": "Technology Analyst",
        "details": "Pretty much straightforward. 2x45 minutes interviews. First interview was technical and second one was competency-based. For technical questions, they asked about stuff that interests me and how JPM can benefit from that. In second interview different scenarios were presented and I was asked to deal with those situations. For instance, somebody comes with a proposal for which you would have to make compromises, what would you do?",
        "questions": [
            "Something along the lines of what kind of financial challenges would JPM face, if they were to develop a certain technology.  "
        ],
        "date": "Feb 12, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "3+ months",
        "role": "Technology Analyst",
        "details": "After filling in the online application I heard back after a month and a half for the first round interviews consisting of technical and competency interviews each of 45 minutes. The competency based interview was about the reasons for applying to JP Morgan and knowing about the leadership and team work skills. The technical interview comprised of the projects I had undertaken in my professional studies and the details I…  had mentioned in my CV.",
        "questions": [
            "How will you test a mobile?  "
        ],
        "date": "Mar 9, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Technology Analyst",
        "details": "I did my first round interview in the Bournemouth office. One technical interview and one competency interview with motivational questions. The interviewers were very nice and friendly and I was not surprised by any question. Ive been invited to the second round interview and assessment centre.",
        "questions": [
            "All the questions were expected, no diffcult question.  "
        ],
        "date": "Nov 24, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Technology Analyst",
        "details": "1. Resume Screening2. Invited to have a phone interview3. Scheduled to take a 2-round interview on the same day",
        "questions": [
            "1. How can you contribute to JP Morgan as a technology analyst?2. Without experience of writing an application, how do you handle the job?  "
        ],
        "date": "Nov 7, 2013"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Negative Experience",
        "difficulty": "Easy Interview",
        "length": "a week",
        "role": "Technology Analyst",
        "details": "Fast forwarded to an assessment centre, which included a technical, and a competency-based interview, as well as a group task. The process was very smooth, and interviewers quite pleasant themselves. However, everything felt completely robotic, impersonal, and one-sided. The interviewers were not allowed to as much as rephrase the questions they were basically reading off a script. Similarly, the group task featured no external involvement whatsoever, and felt like being…  watched in a zoo.",
        "questions": [
            "No real technical questions, just soft stuff, talking about previous experience, etc.  "
        ],
        "date": "Jan 28, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Technology Analyst",
        "details": "I have recently attended an Assessment Centre with JPMorgan in London. This consists of two interviews, each of 45 minutes, one technical and one competency-based and a group exercise.The interviewers were really friendly and none of the questions surprised me, but you need to think on your feet on the respective day. During the group exercise, we were given a real business problem, which we had to discuss and come…  up with a solution within 30 minutes.",
        "questions": [
            "I believe the most difficult task was coming up with a solution in the group exercise and also being sure that everyone speaks and takes part in the discussion.  "
        ],
        "date": "Oct 19, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Technology Analyst",
        "details": "The process was simple. They just asked questions on our projects. They asked questions mainly on object oriented Software engineering concepts.",
        "questions": [
            "No questions were unexpected. Just one point I would like to mention that HR interview was a stress interview.  "
        ],
        "date": "Aug 21, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Technology Analyst",
        "details": "AC interview: a little bit harsh but standard interview skills such as time keeping should be bear in mind",
        "questions": [
            "Who contribute least to the discussion?  "
        ],
        "date": "Jan 26, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Technology Analyst",
        "details": "The application process includes online application, a on-line aptitude test, a phone interview and then on-site assessment center. The assessment center I went was held in a Saturday morning in their London office. The assessment center has a group discussion, a face-to-face interview regarding general personality and two technical ones.",
        "questions": [
            "What is your greatest weakness.  "
        ],
        "date": "Aug 27, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Technology Analyst",
        "details": "Campus Process-Aptitude (Simple questions)Group DiscussionsInterviews (Had only one round of HR)",
        "questions": [
            "everything was general HR type  "
        ],
        "date": "Oct 9, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 days",
        "role": "Technology Analyst",
        "details": "1. Aptitute test of 4 sections- verbal, quants, logical, C++ programming(sectional cut off)2. GD- Our topic was Advertising useful or wastage of resources3. PI (HR+ Technical)",
        "questions": [],
        "date": "Aug 3, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Technology Analyst",
        "details": "College campus interview. First round written test. Then group discussion where they see if you can talk confidently in a group and voice your own opinion. Then 1 technical round - basic CS questions. And 1 HR round",
        "questions": [
            "They just want to see if you know the basics and if you're confident about it  "
        ],
        "date": "Oct 20, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2+ months",
        "role": "Technology Analyst",
        "details": "Formal two step interview. First day was based on basic behavioral/personal questions:When have you been in a situation where a team member was unproductive and how did you handle it?Have you ever been in a situation where you could not meet a deadline? How did you handle it?etc.Second day was on site of company. Two more interviews and a presentation was required.",
        "questions": [
            "Walk me through the steps of the systems development life cycle and describe a time where you have made use of it (in class, projects, etc)  "
        ],
        "date": "Sep 11, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Technology Analyst",
        "details": "My interview lasted 40 minutes. A mix of technical and behavioural questions. I just was confident and spoke as honestly as I could. The interviewers (one of whom ended up as my boss eventually) were helpful and guided you through the interview.",
        "questions": [
            "It was an SQL question regarding joins. They also asked about SDLC.  "
        ],
        "date": "Nov 9, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Technology Analyst",
        "details": "40 minutes. It was a Mix of technical and behavioural questions. The technical questions revolved around SQL and Software life cycle. They guided you if you answered the question halfway correctly.",
        "questions": [
            "Tell me of a scenario when you helped someone.  "
        ],
        "date": "Dec 5, 2015"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Technology Analyst",
        "details": "After I was invited for the interview, I was given 2, 1:1 interviews. One with a project manager and another with a VP of technology.",
        "questions": [
            "Who's our CEO?  "
        ],
        "date": "Feb 1, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "3 weeks",
        "role": "Technology Analyst",
        "details": "The process started with a recruiter coming to the university and do an one on one interview. Then was invited for a super day in about a week. The super day consisted of 2 behavioral interviews and one presentation of anything of your choice. Got a response 2 days later.",
        "questions": [
            "Why do you want to work for JP Morgan Chase  "
        ],
        "date": "Mar 30, 2011"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "a week",
        "role": "Technology Analyst",
        "details": "Applied through University Recruitment Portal, and was called up for an interview. The interview went through 2 stages, both roughly the same. They mainly asked behavioural questions, and a few minor technical questions. Overall was a typical interview process.",
        "questions": [
            "Why JPMorgan?  "
        ],
        "date": "Feb 9, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2 days",
        "role": "Technology Analyst",
        "details": "Hiring was done at campus through two interview rounds, technical and behavioral.Technical was just one person, and for final round, two senior managers interviewed, with a lot of questions which deep dived into my personal fit in the company",
        "questions": [
            "They asked about my interests, my activities during my education.  "
        ],
        "date": "Aug 29, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Average Interview",
        "difficulty": "-",
        "length": "3 weeks",
        "role": "Technology Analyst",
        "details": "I applied online 3 yrs ago. After finishing the application and online tests, I got a phone interview. After the phone interview, it's 2 onsite interviews with different 2-man panels. I think 1 panel is ppls from HR or other division and they just ask competency questions, the other panel are from technology team and asked a few technical questions. After this round I was invited to the assessment center…  but failed at AC",
        "questions": [
            "The AC consists of 2 parts: a case study/presentation and a group discussion. The case study is ok but you have to prepare hand-written slides. The group discussion is where I think I screwed up.  "
        ],
        "date": "Nov 20, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Technology Analyst",
        "details": "they came to our college campus , with a package of 6.00 lac the interview was as follows1. analytical and programming ability(80 question and 80 minutes)2. GD(no elimination)3. Technical Interview ( easy question on your fav subject)4.HRIt was a nice experience , do well for the analytical section its includes ration , p and l,time and distance etc.",
        "questions": [
            "what is your fav subject  ",
            "what is SSL  "
        ],
        "date": "Nov 19, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Technology Analyst",
        "details": "I just applied for the job, and the recruiter emailed me back saying If I can come in to do an hour and 30 minute interview.The interview was pretty simple, mostly behavioral questions. Some technical like what is object oriented programming, difference between array and list.",
        "questions": [
            "what is object oriented programming  ",
            "Tell me about yourself  ",
            "What do you expect from working at JPMorgan  "
        ],
        "date": "Mar 30, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2+ months",
        "role": "Technology Analyst",
        "details": "Applied online for Technology analyst position. Got invitation for numerical test after three weeks of application. It is a standard SHL test. Test is not too difficult.Didn’t hear anything for 3-4 weeks. And then got invitation for first round interview. There are two interviews: one competency based and another one is knowledge and motivation based. Interviewers are very friendly.After few weeks of the first interview, got invitation for the assessment…  centre. AC consists of series of activities. The activity is to analyse a case study, identify issue and recommend solutions. Had to do a presentation for this. And interviewer asks questions after the presentation.2nd activity is team work.And then there are two interviews: one for motivations and another one for self assessment.Overall the interview process is good and all the interviewer was very Friday and helpful.",
        "questions": [
            "How would you test a microwave?  ",
            "Tell me a situation when you have missed a deadline?  "
        ],
        "date": "Nov 15, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Technology Analyst",
        "details": "Brief on campus interview. Interviewer was interested in hearing about past activities from resume. Asked me basic programming questions. Seemed like he wanted lots of coding experience for summer analyst position. Was not interested in anything much else besides programming experience for intern position. I asked for opportunities in working for networks and database management but interviewer was chiefly interested in Java coding knowledge. However, interview was a bit biased…  since my friend got an offer from the same interviewer and he wasn't asked any technical questions. I felt that this interview was really so that the interviewer could get a feel for the person. Even his technical questions weren't to code something specific but rather very general CS questions such as what are the fundamentals of OO programming.",
        "questions": [
            "What are the three fundamental principles of OO programming?  "
        ],
        "date": "Mar 7, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Technology Analyst",
        "details": "The company came to the campus. It conducted an IQ test on the basis if which the screeend candidates were then selected for a group discussion and panel discussion. The shirtlisted candicates were then interviweed by a panel . The intervwew by tha panel lasted for around 45 minutes",
        "questions": [
            "A panel discussion on a businees case  ",
            "Describe the project done in the internship time ?  "
        ],
        "date": "Jun 11, 2010"
    }
]