[
    {
        "gotOffer": "Declined Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "On campus non-technical interview. Was very relaxed, focus on my prior experience. Interviewer was very passionate about his work and seems excited about brining on new interns. No technical questions.",
        "questions": [
            "Tell me about a challenge you've faced  "
        ],
        "date": "Feb 28, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "2+ months",
        "role": "Software Engineer",
        "details": "The person I spoke with asked me questions that were not on my resume, such as querying data using SQL, or asking me Java questions when I know little to no Java at all. It seemed like every time I tried to answer something correct, he would just become more impatient.",
        "questions": [
            "How to query an employee name that has the second highest salary in a given data table (using SQL).  ",
            "Difference between Hash Table and HashMap?  ",
            "Implement a circular linked list entirely (add, delete, find minimum, etc).  "
        ],
        "date": "Feb 29, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "4 weeks",
        "role": "Software Engineer",
        "details": "First off, the start to the interview felt very cold. The interviewer did not introduce himself. He seemed uninterested and un prepared for the interview which is evident from the fact that, I was asked what my name was and whether I was interviewing for a full time position or an internship. It felt like he just wanted to get it over with.With in the first 5 minutes, I was…  asked why I had applied for CISCO despite not having any network experience. While it is a legitimate question, it just gave a very negative vibe. I was taken aback but I tried to gather myself and pointed to my 2 years of work experience with Ericson and we had a conversation about that.At this point, I figured I wasn’t doing so well and as I was trying hard to collect my thoughts. The interviewer seemed to show signs of impatience and borderline annoyance; which made it all the more difficult to think straight. I was asked another question about centralized and distributed systems which I could not answer well mostly due to my own fault.Next we moved on to my knowledge about languages and I was asked vague questions such as “How much do you know about python?” “How much do you know about C++?” and “How much do you know about UNIX”? I tried to answer the questions by stating how I had used these languages in my projects in grad school and my professional career.Towards the end, I felt like the interviewer hadn’t looked in detail over my resume and we did not talk about the most interesting and innovative projects that I worked on in grad school. I broached this topic and gave a brief overview of the kind of projects I worked on. That brought us towards the end of the interview.Overall, the interviewer seemed unprofessional, interested and seemed noticeably annoyed when my answers were not what he was looking for. This made it all the more hard for me to recover from a bad start. While I most definitely would not blame the interviewer for my poor performance, I wish he was more professional and less annoyed so that the entire experience would have been a positive one despite my bad performance.I had done badly in interviews before with companies like Facebook and Amazon, but I was made to feel welcome and I was intellectually challenged in the interviews. In the end I always came out of the interviews thoroughly enjoying them even though I knew I may not have done well. Unfortunately CISCO has been a polar opposite experience where I was and made to feel unwelcome and my intellectual capabilities were not tested.",
        "questions": [
            "Why CiscoWhy did you apply for Cisco, you don't seem to have any networking backgroundCentralised vs Distributed ArchitectureWhat is SNMPHow do you do test analysis in Pythonhow much do you know UNIX, C++  "
        ],
        "date": "Feb 29, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "I had a brief interaction with Cisco representatives at university career fare. They asked me few questions about projects that I did and was called for an onsite interview the next day.",
        "questions": [
            "Design question.. On how are you going to represent a train.. number of passenger cart it's current carrying .. number of passengers in every cart etc... basically to check the understanding of OO concepts... Some questions about projects .... Bit manipulation: No. of bits set in an 32 bit integer..  "
        ],
        "date": "Feb 17, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2+ weeks",
        "role": "Software Engineer",
        "details": "It was an on campus interview. The first 10 minutes were soft questions and the rest of the time was a coding question. The interviewer was very nice and helpful in the coding question.",
        "questions": [
            "Design a method for shuffling songs on an iPod?  "
        ],
        "date": "Mar 31, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Software Engineer",
        "details": "Went through a phone screen, followed by a onsite visit, where I talked to 3 pairs of engineers, and the hiring manager. The interview went well by all accounts, and the manager asked for my references the next day. Upon contacting my references who said nothing but good things about me (this is beyond any doubt), sent me a rejection email citing fleeting \"team fit\" reasons. At no time during…  the interview was there any discussion of collaboration styles etc. To add insult to injury, he wasted not just my time but the time of my references; you just don't ask for those until you're ready to make an offer. First time I got a rejection after getting my references checked in my entire career... highly disappointing.",
        "questions": [
            "Silly/unimaginative programming questions, like testing two strings for being anagrams of each other.Design a change machine that accepts arbitrary monetary amount and produces change change in fixed denominations.  "
        ],
        "date": "Jan 12, 2016"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "Applied online via linkedin... Hiring manager contacted on phone , explained me about the positionSenior Engineer took Telephonic interview (45 mins) and then got call for onsite interview that lasted for about 4 hoursHR contacted with the offerAccepted offer",
        "questions": [
            "1. Networking protocols2. Python Progamming  "
        ],
        "date": "Jan 11, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "I applied through a career fair at my university. They looked at my resume and were interested in me so they scheduled an interview on campus for the next morning. It was pretty relaxed (compared to other interviews). A mixture of basic behavioral questions, technical questions and some more information about my resume. The interview went on for about 45 minutes. The process took about 2 weeks for me.",
        "questions": [
            "Behavioral questionsWhere do you see yourself in 5 years?What other companies are you interested in now?What are your strengths and weaknesses?Talk about your resume.Talk about extracurricular that you did/do.On a scale of 1 to 10 (being the best), how do you rate yourself to use Google (I.E. - are you really comfortable using Google to find answers)?Technical questionsHow do you know when data has achieved third normal form (in terms…  of relational databases)?What type of visualization tools have you used?Two computers are connected to a switch and the communication isn't working between them. How do you go about troubleshooting it?Describe how you would theoretically setup a cloud environment.What is AWS (amazon web services)?There were more questions but I can't remember them all now.  "
        ],
        "date": "Feb 17, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "Skype interview with numerous technical questions. Was asked questions about how to effectively test and modify code from GIT without damaging code. Also asked questions regarding definitions or theory of different languages",
        "questions": [
            "How to find head of doubly linked list  "
        ],
        "date": "Feb 19, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "I applied online and I took the interview after a month.The process was quite good and friendly. They told me a lot of their project and equipment. The process is in total 4 rounds. The first round would be a background check and basic algorithm questions. The second round would be a network knowledge check. The third round would be a short talk with the manager.In the next step, they…  just take me to have a video chatting with another manager in SD. The manager was very friendly and nice.",
        "questions": [
            "String manipulation, network and visualization. Why cisco  "
        ],
        "date": "Jan 15, 2016"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2+ months",
        "role": "Software Engineer",
        "details": "3 rounds1) behavioral and technical (45 mins)2) behavior and experiences3) experiences and interestsThe technical question was kinda tricky in my opinion. There were a lot of constraints in the problem. My code had bugs at first but then I fixed them.",
        "questions": [
            "Technical question involved string manipulation & linked list  "
        ],
        "date": "Dec 5, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "4 weeks",
        "role": "Software Engineer",
        "details": "Terrible experience!!!! After the interview, the hiring manger calls and extends an offer verbally, and then for a week no response from them at all. Tried reaching them via email, phone, absolutely no response. Finally the recruiter is available on his mobile and he says they cannot give a certain Grade , and a certain salary, I still say its ok please give me an offer letter. He says he…  will get back to me by the EOD and no response. Next week I call the recruiter again and now he says the req is closed and in turn blames me for not responding on time.Clearly, looks like the hiring manger extended an offer but later they changed their mind and they have no idea how to communicate this to me, so did all sorts of things to make me drop the ball and when I did not they say the req is closed.Did not expect this from a reputable organization like Cisco. Terrible , terrible hiring process!! I feel interviewees should be give some respect when they take time to come onsite and spend a day.No point taking names, but I just wish this would be addressable and not be repeated for future candidates.",
        "questions": [
            "Data structure/algo questions and some low level questions  "
        ],
        "date": "Oct 27, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "The manager in the IT department interviewed me. Since I do not major in CS, he just asked me some behavior questions. He is really nice and told me do need to worry about programming. He thought the idea is much more important than programming language.",
        "questions": [
            "Why do you apply our company?  ",
            "If you father ask you to come back tomorrow, but you can not come back. How do you deal with that?  "
        ],
        "date": "Nov 3, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "a week",
        "role": "Software Engineer",
        "details": "Had 1 on campus interview and 1 on the phone interview. Campus focused on resume and some basic C questions. Also asked what divisions I would be interested in. Interview was with a manager. On phone interview was with a software engineer. They asked about the basics of Java, which I said I knew, then did some coding questions.",
        "questions": [
            "Size of a struct that has 2 integers and 1 char in C.  "
        ],
        "date": "Dec 14, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Software Engineering",
        "details": "The interviewer was a very friendly person. He began by asking me about the projects that I had done in undergraduate school. Then he shifted on to a couple of design questions related to client server model and networking protocols. These were just basic questions and did not require in depth knowledge of networks. Then he asked one programming question. He asked me to suggest approaches to solving it. And…  later on, implement one of the approaches on a white board. Then he asked me if I had any questions for him. I asked a couple of questions and then it was done.",
        "questions": [
            "Implement an algorithm to shuffle songs in a playlist  "
        ],
        "date": "Oct 23, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2+ weeks",
        "role": "Software Engineer",
        "details": "Had 5-6 rounds of interviews. The aptitude and problem solving was looked upon. The interview was arranged in 2 rounds. The interviewers were very friendly.Each interview lasted for about 45 mins to an hour. Different rounds covered different topics like OS, Networking, Data Structures etc.A lot of algorithms questions were asked to test the aptitude.",
        "questions": [
            "Multi threading and synchronization related questions  "
        ],
        "date": "Sep 4, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "Contacted by recruiter and had a 30 minute talk.Went on to have a phone interview which was a technical programming interview. Some basic computational problem.Went onsite and had 4 hours of interviews including architectural design and programming.",
        "questions": [
            "Asked me to describe how computers work at a high and low level, as well as design a REST API for a complete system  "
        ],
        "date": "Jun 21, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "5 days",
        "role": "Software Engineer",
        "details": "It was a long interview - almost take a whole day.First, the recruiter let me in the building, order lunch for me. Then group leader had a overall talk, then 2 tech guys come with tech interview - in very detail. Talking with HM is the last step.",
        "questions": [
            "Working experiences, working habits, programming, project experiences, family status, ....  "
        ],
        "date": "Jul 23, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Easy Interview",
        "length": "4 days",
        "role": "Software Engineer",
        "details": "WORST interview experience ever.It started with a referral for application level position. Got an email requesting time for phone interview. After, deciding that got call from the same engineer that they have to fill the requistion so you will have to come onsite this week. So I rescheduled other interviews and went for the interview. When I reached the building my point of contact was not reachable. I waited in…  the lobby for 15 minutes and a gentleman from completely different team came and said I will interview you for my team. So from application team to a low level embedded team, what a jump. One of the interview asked me what is the balanced tree. I started explaining about the height and how difference in the height gets to the balanced tree. I was shocked to learn that interviewer's definition of balanced tree was a binary search tree. After explaining the interviewer and interviewer searching on the web for 5 minutes said there are these two definitions of the balanced tree and let's move on. One interviewer was very rigid about the hash chaining implementation. They wanted specific answers to specific questions rather than the thought process. The whole process was wierd.",
        "questions": [
            "Question whether the binary tree is balanced?  "
        ],
        "date": "Apr 20, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "Hard interview, asked in depth questions about operating system internals and obscure data structures. Disconnect between what was posted on the listing and what the actual interview questions covered. Other than the questions the interviewers were nice and courteous. If I had expected questions on object oriented programming I would have done better.",
        "questions": [
            "What is an autonomous system?  "
        ],
        "date": "Apr 16, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Difficult Interview",
        "length": "1+ week",
        "role": "Software Engineer",
        "details": "First one with hiring manager, second with technical manager. They were both phone interviews. The first went well, but the second was terrible. I was told that it would take about half an hour and it ended up being over two. I felt like I was just being read a list of words to see if I could define. Kept being asked oop questions even though I kept mentioning my…  strength was in functional programming. I felt sort of mocked at the end, like no matter what I said it would be incorrect",
        "questions": [
            "Awful, 1hour+ of questions ranging from ood principles to Linux to c++/c to networks to Python. Also got asked what books I read to \"keep current\"  "
        ],
        "date": "Apr 13, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Interview was three part, with one engineer for the first and third sessions, and an interview with a product manager and another engineer for the second. Interviewer #1 frequently left the interview and was busy on his own work throughout. Interview #2 was culture fit, interview #3 was pleasant with a friendly engineer.",
        "questions": [
            "Build a deck of cards, represented by strings and each card&#039;s suit and value separated by a string.  "
        ],
        "date": "Aug 10, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "Started with phone interview from hiring manager, and 4 webex technical interviews.All interviews were technical, involving data structures, algorithms, object oriented programming and web services, and some problem solving questions",
        "questions": [
            "Coding questions  "
        ],
        "date": "Mar 2, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4 days",
        "role": "Software Engineering",
        "details": "The process was insanely fast. I met my manager at a local tech talk at my university and within 2 days I had an interview and a day after that I had an offer for the summer. I think I was in a unique position as my manager was looking for people quickly and this was relatively in late in the hiring season (late March).",
        "questions": [
            "1. Build a maven project using maven. 2. Parse this CSV in Java and in Javascript.  "
        ],
        "date": "Nov 10, 2015"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "5 weeks",
        "role": "Software Engineer",
        "details": "I applied to the interview through university recruiting. Cisco invited me to an interview. The entire interview was behavioural and at the end was told that this would be the final interview. I was quite shocked there was no technical side, came as both a shock and concern. After two weeks i get a email requesting to touch back. They asked whether I would be fine doing a test validation…  position instead. I declined, saying that I only was looking for software development.",
        "questions": [
            "Please explain your resume?  "
        ],
        "date": "Apr 22, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "a week",
        "role": "Software Engineer",
        "details": "I initially got an interview through an employee referral and interviewed with a senior engineering manager of an ASIC design team. The manager asked me about various things about the C++ programming language as well as my knowledge about scripting and VLSI. He also tested me on my problem solving and communication skills in an engineering setting in general.",
        "questions": [
            "What is a namespace in C++.  "
        ],
        "date": "May 11, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2+ months",
        "role": "Software Engineer",
        "details": "I had applied online. I received an email to schedule a phone interview approximately after a month. The interview lasted for 1 hour, on phone. I was also asked to write code in an online editor. I was asked to write 2-3 small programs on string operations. I got the offer and interned at Cisco.",
        "questions": [
            "Basic string programs  "
        ],
        "date": "Aug 17, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "5 days",
        "role": "Software Engineer",
        "details": "Telephonic Screen at first with a Skype interview. Asked questions on red & black trees, data structures, linked lists & cloud based project. Easy interviewers with sufficient help and support provided.",
        "questions": [
            "Explain Red &amp; Black Trees  "
        ],
        "date": "Sep 30, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "hand in resume on career fair and get the interview invitation in a week then campus interview.Alternate behavior question and basic bit munipulate question for 30 mins. Paper coding and some concept explain",
        "questions": [
            "Behavior Question + Basic Bit Minupulate  "
        ],
        "date": "Feb 7, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "Applied at Campus Career Fair, got an email next day to schedule an interview on campus.The process was fairly simple. They mostly focus on behavioral questions and your resume which are pretty easy to tackle. Since I had no prior work experience they asked me some basic networking questions. Interview lasted about 40 minutes after which in about 2 weeks they sent me an offer.",
        "questions": [
            "Basic questions about routers, bridges, hubs.  "
        ],
        "date": "Feb 6, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "Applied online and received an email requesting to setup a phone interview. Phone interview was about 30 minutes and was conversational about resume and projects worked. Onsite interview was two hours broken into short one on ones with team members and director. Most were conversational again besides one that tested your software skills.",
        "questions": [
            "Code a simple linked list.  "
        ],
        "date": "Feb 3, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "2+ weeks",
        "role": "Software Engineer",
        "details": "Skype-like. Asked some concepts about data structures including hashtable and Binary Search Tree. Asked to solve some basic coding problems using stack and Binary Search Tree. Lasted for 40 min. High demand for C programming than other language.",
        "questions": [
            "Data structure things.  "
        ],
        "date": "Feb 11, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "a week",
        "role": "Software Engineer",
        "details": "Just asking some behavior questions and basic technique questions. For example, how to deal with the disagreement with your teammate？what is version control? They also asked some questions related to Python.",
        "questions": [
            "what is version control  "
        ],
        "date": "Feb 23, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "I applied online for a entry level software engineer position at Cisco systems. I got an email from the university recruiter for a phone interview. Phone interview went well. It was just about my resume and the projects I have completed. During the interview she told me that she is satisfied with my profile and she is going to send my profile to their hiring manager and I will be…  hearing from them within three weeks for the next round. But I didn't get any email from them. I waited for a month and them sent a mail to the university recruited who interviewed me, but she didn't reply me back.",
        "questions": [
            "Briefly describe about your project ?  "
        ],
        "date": "Apr 25, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "1+ week",
        "role": "Software Engineer",
        "details": "Routine questions about background, motivations, team works, etc. Nothing out of the ordinary. One of the question was what would I do if I had a million dollar. Technical questions are all simple, Python-specific. The interviewer was nice and courteous.",
        "questions": [
            "What is a dictionary in Python. What is list in Python. What is a tuple in Python. Some other simple ones I can't remember.  "
        ],
        "date": "Oct 20, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "1+ week",
        "role": "Software Engineer",
        "details": "I was contacted by a staffing agency about the position in CISCO, RTP. The initial round with CISCO was a webex call, but due to some issues with my internet connection, I couldn't take up the Webex and the Manager has called me on my mobile and it was 1:1 phone interview asking me to rate myself on Java and if I had any Linux experience. Asked If I have…  any usage of SQL and GIT. And asked about my expertise.Got the result in 4 days, and the next round was with a panel of 7 members. 1 team member escorted to the meeting room and excused himself saying there is a priority. So it was a 6 member panel interview which went real smooth. There was no White Board coding. Asked so many questions from my resume like what was my contribution, Did I code any functionality from scratch... It was basically projecting yourself exactly the way your resume talks. This round was like a behavioral kinda as well - What challenges I faced. Finally 1 technical question was asked in Java - Difference b/w Interface and Abstract Class.",
        "questions": [
            "I was an ex employee of Oracle. So asked me what disadvantages I had working with Oracle DB. This was an unexpected question.  "
        ],
        "date": "Jan 20, 2015"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Negative Experience",
        "difficulty": "Easy Interview",
        "length": "3+ months",
        "role": "Software Engineer",
        "details": "I had an on-campus interview with 2 managers from Cisco. They asked two easy technical questions, but since it was my first interview at the time, I struggled a little bit. That lasted about 70 minutes. I didn't hear anything back about that position, but two months later I received a letter of intent for a different position at Cisco down in Austin, TX. After passing a background check, I…  received an insultingly low offer, and they didn't respond to my negotiation request. Turned it down for a much more appropriate offer.",
        "questions": [
            "Write pseudo code for your favorite sorting algorithm. Write a method that determines whether a number is prime.  "
        ],
        "date": "Apr 26, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "Applied online.I had a short phone interview and they invited me to on-site interview.I talked to 6 people there for 6 hours.The questions are mostly about my background and experience. So you may need to prepare for that.Some technical questions, but they were not very hard. They didn't push me to answer quickly.You ship a product to your customer and he/she complained it does not work. How would you handle?…  continued the question by interacting with the interviewer.",
        "questions": [
            "Typical questions. Reverse linked list. Reverse bit in an integer. 0th bit &lt;-&gt; 31th bit, etc...What do you see yourself in the next 5 years.Summarize you experience in 5 minutes.  "
        ],
        "date": "Apr 12, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "Campus interview. Interviewer was definitely out of the zone. Was not in the mood for any rubbish talk. Asked straight technical questions. The hiring process was definitely straightforward but the interview was difficult.",
        "questions": [
            "How did you implement Agile methodology at your workplace?  "
        ],
        "date": "Jan 25, 2016"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "applied via college recruiting process.overall process took 2 - 3 weeksinterview screening via phone.face to face interview with 6 lead engineers (45 mins each)face to face with the VPMet the team.HR manager and negotiations started.",
        "questions": [
            "Network topology and STP implementation  "
        ],
        "date": "Dec 18, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "Submitted my resume and was called back for an interview. Was only a sophomore and he asked questions that were beyond my coding experience. These included stuff about speeding up a program and how to refer to its stackframe. Could have killed it if i came more prepared.",
        "questions": [],
        "date": "Nov 17, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Average Interview",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "I went to the career fair and got an phone interview in couple of weeks. The interview is half behavior and half technical. The interviewer asked me some questions based on my resume including detailed knowledge in networks.",
        "questions": [
            "asked me some detailed knowledge about the networks.  "
        ],
        "date": "Oct 16, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "Got an on-campus interview scheduled through the school.Since it was a full time entry position, had two senior software engineering interviewing me in a room.Asked some basic questions on the resume.Asked what my favorite language was and OO concepts. What is good about it and how it is powerful compared to others. What 'static' variables meant.Programming questions like: code in java for binary search. reverse a double linked nodes.",
        "questions": [],
        "date": "Oct 15, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "Simple standard steps for programming language of C. Unix internal IPC communication mechanicsBit operation and general networking protocols basic.45 min each of 4 people interview in one afternoon long.Link list and pointers and structures in C",
        "questions": [
            "Data structure and algorithms  "
        ],
        "date": "Oct 9, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Software Engineering",
        "details": "Only a very short (30min) on campus interview. No technical questions. Seemed as if they were most interested in raw talent and passion. The interview was very conversational, but this, of course, depends on your interviewer. They are very aggressive with their offers, I received my offer within 24 hours.",
        "questions": [
            "Why do you like engineering? Where do you see yourself in 10 years? What are your interests in software development?  "
        ],
        "date": "Nov 24, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "Interview wasn't that hard. Basic DS questions and Java. Overall, it was a positive experience. I had 2 phone interview, pretty basic and some technical questions. They kept it pretty basic. We went over my resume which included school activities, extra-curriculum, any relevant experiences etc. I had the opportunity to visit the campus and met different managers.",
        "questions": [
            "Check whether binary Tree is Sub-Tree. Check whether one word is an anagram  "
        ],
        "date": "Nov 5, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Difficult Interview",
        "difficulty": "-",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "I was directly called for an onsite interview. Couple of guys asked programming questions on the board. They were usually hard questions. The interviewers were friendly guys from different nations. The whole process took about 2 hours.",
        "questions": [
            "Reverse a Linked List  "
        ],
        "date": "Sep 11, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "I was asked a technical question on Machine Learning during the recruiting at a Career Fair straight away while reviewing my Resume. The question was on the possibility of separating houses for a Realtor into various clusters. I answered the question by proposing a Decision Tree (ID3 Algorithm) or a Linear Separator, depending on the number of features that the test data had.I then was offered a phone interview, where…  I was a standard question regarding Data Structures and Algorithms. (Can't spit out the details, sorry).",
        "questions": [
            "The question regarding the Data Structures was difficult because at best I could get a run-time of O(kn), or O(nlog(n)), but that wasn't close enough to O(n), which is what they wanted.  "
        ],
        "date": "Sep 24, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "got a call from manager went over CV arranged for a interview through webex. Talked asked about my current experience and threads, dead locks, datastructures, css, javascript basic questions, asked to write double linked list program, string reversal, they would accept any language you are comfortable in.",
        "questions": [
            "String concatination, how canyou write a better concatination with out using existing menthods like .concat etc... can a dead lock happen with three threads, the job description has nothing to do with these questions. The concentration was on basics of programming, was asked to write doule linked list program...if you are comfortable with sting programs and linked list concepts it is very easy to crack  "
        ],
        "date": "Aug 29, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "got a call after my resume was chosen from a pile of resumes. got a call to reserve a time and date for an interview. the shortlisting was heavily scrutinized but interview was relatively easy. interview was conducted by 2 enginners. they were old and seemed unhappy working for cisco. they told me they now they dont pay as good as they used to pay,",
        "questions": [
            "long string submatch problem? code it in any language. questions related to threads, mutexs, etc  "
        ],
        "date": "Nov 18, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "I was hired more than 10 years ago so I don't remember what exactly it was anymore. It was something like being interviewed by at least 5 engineers and then managers. Questions mostly on C and C++.",
        "questions": [
            "C++ inheritance  "
        ],
        "date": "Jul 23, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "Easiest Interview I ever did. No technical questions were asked. The interviewer seemed bored and completely unprepared. Did not put in any energy prior to the interview preparing for it,",
        "questions": [],
        "date": "Jul 23, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "2+ months",
        "role": "Software Engineer",
        "details": "Process took a few weeks. Simple behavioral interview through University Program",
        "questions": [
            "Describe a difficult situation where you found a solution  "
        ],
        "date": "Apr 25, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "The previous company was purchased by Cisco Systems. So, we do not need to go through the interview process.",
        "questions": [],
        "date": "Apr 24, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Software Engineer",
        "details": "Attended a job fair at my university and dropped off my resume. Got an email a couple weeks later asking for an interview.I had one on campus interview which constituted of basic questions regarding multiple process handling,multi threaded programming. Also, there were questions related to networking basics and my past projects and experience.",
        "questions": [
            "How did you become interested in engineering, knowledge of networks, favorite coding language was, some basic behavioral/fit questions  "
        ],
        "date": "Oct 15, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "I applied through my university career fair and got a interview one week later through the WebEx. The interview begins with the questions regarding my projects experience. Then several network foundation questions like what's trace route, how does it work and two problem regarding subnet and subnet mask. And two very easy algorithm problem.",
        "questions": [
            "what's trace route, how does it work  "
        ],
        "date": "Jan 31, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "Go through recruiters or someone works in the company. Resumes received directly from outside almost never got chance of interviews.",
        "questions": [
            "Discuss the internal release policy.  "
        ],
        "date": "Jan 29, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "In the university career fair, the recruiter asked some projects on my resume and asked what language do I use mostly, and asked some questions related to operating systems.The recruiter also introduced what they do in daily life, and tell me about their recruiting plan, cisco's hardware team has been moved to Shanghai.",
        "questions": [
            "What do you know about memory system in the linux system? How does it manager the memory?  "
        ],
        "date": "Jan 22, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Average Interview",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "Applied from school website and had a phone interview. The questions are quite easy and the interviewer was helpful.",
        "questions": [
            "The improvement of the question  "
        ],
        "date": "Jan 13, 2014"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Difficult Interview",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "This is specific to the Knoxville office of Cisco which has a separate interview process. There is a phone interview, a webex interview and then an in person interview with actual coding and problem solving.The phone interview question include what is deadlock, what are race conditions, what is thrashing? In C how do you divide by two without using the /.The webex interview has a lot of C code where…  you have to say what is wrong with it. Understanding pointers is a large part of these questions. There is also some coding in the webex interview such as in C how to reverse a linked list O(n) time.The in person interview has actual coding and security problems. Certain levels in the exploit-exercises.com VMs were used for some of this as well as other coding questions.",
        "questions": [
            "There was an imaginary computer programming language that you were supposed to decode the output of.  "
        ],
        "date": "Oct 8, 2013"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "6 weeks",
        "role": "Software Engineer",
        "details": "I applied in October through a university careers website, and was contacted 2 weeks later about an on-campus interview. The interview consisted of talking about my resume and some coding questions. My interviewer asked about all of the technical skills listed on my resume, and since I know Java, he asked me some Java language-specific questions (describe polymorphism in Java...). He also asked a brain teaser at the end.During the…  interview he told me I should expect to move on in the process because my GPA was high enough. About a week to 2 weeks after the interview, I received a letter of intent to hire from Cisco. I was asked to pick between San Jose, Atlanta, or Research Triangle Park. Also, I was asked to rank my preference for the following positions: Application Development, Embedded Systems, and Test Engineer. I sent in my preferences (I asked for Application Development, Research Triangle Park) but I was told that there were no positions other than Test Engineer available at RTP, so I was placed on a waitlist, with no guarantee of getting an offer unless something opened up.However, I heard back again with an actual offer within another 2 weeks. This was for Embedded Systems in RTP. The salary was not competitive with my other offers, so I declined. Also, there was no human contact throughout the entire process, other than the on-campus interview, and they didn't offer to even bring me in for an on-site visit, so I would not have felt comfortable accepting the position even with a competitive salary.",
        "questions": [
            "Brain Teaser: Involved thinking outside the box to come up with a solution. The interviewer gave me a hint and then I got the answer. I don't really see the point of this kind of question, because I had heard something similar to the brain teaser he gave me, and I was able to get the answer quicker because of it.  "
        ],
        "date": "Dec 24, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "Applied through through my university just a 30 minute interview with one of the software engineers there. Super simple process. FOLLOW UP WITH THE APPLICATION DON'T JUST APPLY AND WAIT the HR loved how I keep following up with her.",
        "questions": [
            "How do you delete a node in a linked list. Code it on the white board  "
        ],
        "date": "Oct 20, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "1+ week",
        "role": "Software Engineer",
        "details": "I had a on-campus interview. Fairly easy. Mostly networking related questions.I had taken a network security course and the interview asked questions related to that.Describe IP spoofing attack and how to prevent/detect it.",
        "questions": [
            "Describe IP spoofing attack and how to prevent/detect it.  "
        ],
        "date": "Aug 8, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4 weeks",
        "role": "Software Engineering",
        "details": "On Campus interview through school. One on One interview with focus on projects I had completed. Went into the technical details of the projects as well as questions that arose from them.",
        "questions": [
            "If you could do [insert project] over, what would you do differently and why?  "
        ],
        "date": "Nov 26, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "attend school career fair and got the first round interview in campus. Then one tech phone interview following another round phone interview. No on-site for me.",
        "questions": [
            "a lot of behavior questions  "
        ],
        "date": "Sep 15, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "I went through a 45 minute phone interview, and then a 2.5 hour on-site interview. The phone interview consisted mostly of resume and background related questions, and a few very basic Object Oriented Programming questions.The on-site interview was conducted by 5 people in 3 different sessions. They started asking more technical questions here like reviewing snippets of code for improvements or errors, asking about more detail about my knowledge of…  the languages on my resume, and some brain teasers.Overall they were friendly and encouraging.",
        "questions": [
            "Design a vending machine.  "
        ],
        "date": "Sep 12, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "Asked basic networking questions from course I took in college. Nothing too difficult. Also had some programming questions and asked about each of the 7 layers in networking.",
        "questions": [
            "7 layers in networking  "
        ],
        "date": "Sep 10, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "a week",
        "role": "Software Engineer",
        "details": "call from recruiter. had 2technical interviews one for java and other for sql skills. and then on site interview with team members and manager",
        "questions": [
            "none  "
        ],
        "date": "Feb 3, 2014"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "a week",
        "role": "Software Engineering",
        "details": "Cisco was one of the companies at my college career fair. I met them there and dropped a resume. Within a few days, they contacted me to schedule an on campus interview. The interview was limited to an hour and involved standard questions about a project or team experience and then a few technical questions.",
        "questions": [
            "You have nine identical balls, one weighs more than the rest. You have a balancing scale and can only use it two times. How do you find out which one is the heavier ball?  "
        ],
        "date": "Sep 26, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1+ week",
        "role": "Software Engineer",
        "details": "First got connected by the manager. Then one tech phone interview following another 5 rounds phone interview. No on-site for me.",
        "questions": [
            "Nothing really difficult.  "
        ],
        "date": "Sep 13, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "Went to career fair, afterwards called me for an interview. was asked some basic questions about programming, and some brain teasers, pretty simple.",
        "questions": [
            "how would you arrange an array backwards?  "
        ],
        "date": "Jul 22, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Easy Interview",
        "length": "5 days",
        "role": "Software Engineer",
        "details": "Applied through Linkedin. HR contacted and scheduled interview. Fist telephonic interview went well and I was asked for face to face.",
        "questions": [
            "Asked me to write 8 bytes aligned malloc and corresponding free function  "
        ],
        "date": "Jun 9, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Difficult Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "2 Phone Interview. 1 - HR, 1 - Hiring Manager",
        "questions": [
            "Given 3 systems: system 1 reaches 0xFF, then system 2 increment by 1. Everytime system 2 increments, system 3 would fetch the package. When can there be a problem? What is the problem with this system? How can we fix this?  ",
            "They will give you the most random questions regarding DSP.  ",
            "Write and derive any C programming Object on the board?  "
        ],
        "date": "May 9, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "Was first contacted by staffing agency based on a resume posted to one of the resume web sites. 1 interview with 4 people, one at a time. Some technical and some social questions",
        "questions": [
            "Standard java questions. Multithreading questions, data structure questions.  "
        ],
        "date": "Oct 30, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "2+ weeks",
        "role": "Software Engineer",
        "details": "Initial phone interview lasted for an hour. Interview was based on webex. Questions involved basic networking and programming related like convert hton to ntohWas called onsite. Had 5 rounds total. First round was about simple C programming - find the mistake in the code type questions. Second and third rounds went into trees, graphs, and core OS and networking.Fourth round was all about networking. Was made to write a socket…  program and then to implement a load balancer using pthreads. I didnt remember the exact apis but wrote the pseudocode",
        "questions": [
            "Design and implement a load balancer in C.  "
        ],
        "date": "Apr 30, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Easy Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "while cisco is overall a great company, some of their interviewers can be very unknowledgeable and unprofessional/disrespectful. The interviewer/engineer called in 10 minutes late on a scheduled 30 minutes call, then asked questions totally unrelated to what the group is doing, drilling down on unnecessary details about tools the team is NOT using, not to mention lacking of knowledge on even the basic data structure/algorithms, and jeering and laughing throughout,…  and this is someone with a 'principle software engineer' title. Definitely a cut or two below top tier company. I sent in my request to withdraw my application right after the interview.",
        "questions": [],
        "date": "Apr 26, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "Very technical. Will go thru what is written in resume.",
        "questions": [
            "He provided a puzzzle to solve.  "
        ],
        "date": "Apr 12, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "Phone Interview consisting of questions regarding past experiences.",
        "questions": [
            "Went over resume and discussed past experiences.  "
        ],
        "date": "Mar 14, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "On campus interview through a university career program. Interviewed by two Cisco representatives. The interview was fairly straightforward and they were more interested in my resume than anything else.",
        "questions": [
            "Given a set of strings, determine the greatest common prefix of all strings in the set.  "
        ],
        "date": "Feb 19, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "6 days",
        "role": "Software Engineer",
        "details": "Passed the phone interview and went to the onsite.",
        "questions": [
            "They require operating system knowledge which is hard for a EE student  "
        ],
        "date": "Mar 6, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Went to a 45 minute interview with both behavioral and technical questions. The first half was the behavioral asking about my knowledge of the company and motivations as a programmer. The second half consisted of more technical questions derived from what I put on my resume. I had put C on there which lead to specific language questions. Then there were more general problem solving on the whiteboard.",
        "questions": [
            "How to return a structure member with just an offset.  "
        ],
        "date": "Jan 23, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Difficult Interview",
        "length": "2+ months",
        "role": "Software Engineer",
        "details": "I had an on-campus interview, went pretty good and was mostly analytical questions and algorithms questions. Then I had a phone interview, very technical and detailed, but the guy was helpful. At the end, the HR said you've got positive feedback on your interviews and we'll let you know when we've openings, which they didn't",
        "questions": [
            "Nothing surprising, but the guy did ask about everything related to networking fundamentals and C++  "
        ],
        "date": "May 7, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Software Engineering",
        "details": "I submitted my resume through my college's career services and was contacted for an interview. The interview was held on campus, and I met with one technical person from Cisco. Following the interview, I was contacted the following day for an internship opportunity.",
        "questions": [
            "I was only a Sophomore, so I was a novice and couldn't really perform the typical interview questions. They ended up taking a project listed on my resume and asked for more details. One of the questions related to this project was \"How was my robot able to detect an analog light signal?\" Nothing that I didn't know the answer to.  "
        ],
        "date": "Oct 6, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "That is a one to one interview, just ask some questions about my experience. That's not very difficult to answer. They focus on my machine learning background. I cannot remember all the details about the interview. I'm a first master student at that time, and have no former work experience.",
        "questions": [
            "ask me about the router field question, which I never touched before.  "
        ],
        "date": "Jan 31, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Cisco held an information session on campus at UT and reviewed CV/resumes to choose who they would interview the next day.Back to back interviews were held with two different engineers.A few weeks later one of the recruiters called to tell me an offer would be extended to me.Then things were turned over to HR.",
        "questions": [
            "If you disagreed with your manager and felt they were doing something wrong, how would you handle it?  "
        ],
        "date": "Aug 4, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "Applied through employee referral. Contacted by the HR. Scheduled phone screen with a technical leader. Basic C fundamentals, networking questions in the phone screen. Called for onsite. Scheduled for 4 1-1 inteview with lunch interview with manager. More c programming questions, operating systems and networking questions.",
        "questions": [
            "Data structures and bit manipulation questions  "
        ],
        "date": "Jun 9, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Easy Interview",
        "difficulty": "-",
        "length": "2+ months",
        "role": "Software Engineer",
        "details": "I was contacted by the Hiring team and then contacted over the phone by a Cisco Employee who asked me general Java Question.On Site interivew was a 5 hour interview split over 1 hour each wherein the Engineers came ans asked me questions about Java.",
        "questions": [
            "The manager asked me to model some problems.  "
        ],
        "date": "Apr 11, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Easy Interview",
        "length": "a week",
        "role": "Software Engineer",
        "details": "First sent me blank google doc. asking me to write code on it so that they can check the status of my answering. Questions asked were basic but I didn't prepare at all, my major is more like EE...Q1, how to do binary tree search.Q2, How do two different Threads share information.Q3, how to insert thread",
        "questions": [
            "Binary tree search  ",
            "How do two different Threads share information.  "
        ],
        "date": "Jun 4, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Software Engineer",
        "details": "Got a phone call from recruiter and then attended on-site interview.",
        "questions": [
            "Only C programming questions.  "
        ],
        "date": "Jun 19, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "a week",
        "role": "Software Engineer",
        "details": "Had a phone screen. After phone screen, had an half a day face to face interview with the team members and manager. They extended the offer in 2 days. I had a few rounds of negotiations with the HR for salary.",
        "questions": [
            "Swap two integers without using additional variable.  "
        ],
        "date": "Sep 28, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "One of my former lab-mates ( from the University) referred me for a position at Cisco; I didn't even know what the position was (he thought it was a perfect fit for me). I got a call out of the blue (on a Saturday) from a person from Cisco, and asked whether I have time for an interview at that time. Unfortunately, I was travelling, and asked him whether we…  could prearrange a time, so that I could make myself available. He was willing to do that, but, he wanted to have the interview within the next couple of days. So, we scheduled it for the next day.During the interview he first asked me about my PhD research work. That went on for about 15min. He seemed mildly impressed (I think). Then he moved on to few behavioral, and technical questions. The technical questions were from Algorithms and DS, C/C++, OOP and Networking. Apart from couple of questions, I did well in the rest. The most difficulty I had was understanding the thick accent (South East asian, I think) my interviewer had. But, he was really friendly.Finally he went through my resume and asked me several questions about my experience and background. I thought he got more interested in my after that round, since according to him \"I have an impressive resume\".The whole interview went on for about 1hr, and he concluded by asking to contact him in about couple of weeks, if I didn't hear from him or Cisco. I followed up the interview by sending a thank you email to my interviewer; he once again asked me to contact him if I didn't hear from him soon.But, even after repeated emails (after waiting for 3 weeks), I am yet to hear back from him or Cisco. Overall, I had a positive impression about the interview (even though they called out of the blue, and asked me to interview in a hurry ~ I haven't had that experience with any other company). However, not getting back to me with their decision (don't care what it is), is really unprofessional for a company like Cisco. I don't think I would consider Cisco in the future, even though I am in the Networking field.",
        "questions": [
            "What is your greatest weakness?Follow up: What other weaknesses do you have?  ",
            "What's your ideal job/work environment?  "
        ],
        "date": "Jun 12, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "The Interview process was standard, there were no big surprises in terms of interview questions. Overall interesting experience.",
        "questions": [
            "There were some algorithm and data structures oriented questions. Probably messed up a lot but they care about your thinking process more than the solution.  "
        ],
        "date": "Aug 18, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "Onsite + 2 telephonic. Basics of data structure. Lots MCQs on C programming. Bit maniplation. Clean and bug free code in C during interviews. You are expected to write clean C code in those interviews. Basics of linked List and Binary search trees. Searching and sorting.",
        "questions": [
            "Not to be disclosed ! C operating systems basic. Paging, virtual memory questions. Bit manipulation questions.1: Generalized linked list traversal2: Find the number is power of 2 or not3: Linked list deletion4: Networking basic questions.5: Sorting methods and complexities.  "
        ],
        "date": "Mar 16, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2+ weeks",
        "role": "Software Engineer",
        "details": "recruiter calls and talks, then an engineer calls and talks. Recruiter calls back and schedules an interview. Normally it is a typical process, but they want to know if you are a right person for them or not. This is the key imho.",
        "questions": [
            "1. Why did you apply for this position?2. Tell me about yourself.3. Write a small program on  "
        ],
        "date": "Jan 17, 2016"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Negative Experience",
        "difficulty": "Difficult Interview",
        "length": "4+ weeks",
        "role": "Software Engineer",
        "details": "Nice people but hard questions. one phone and one onsite with 4 people interviewed, all technical questions, no behavior questions. It took more than half a day. All are coding skill questions.",
        "questions": [
            "Why you want to leave current company  "
        ],
        "date": "Oct 29, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Very friendly, opportunity to share experience and ask questions, non-technical as first interview is fine.",
        "questions": [
            "What contributions had systemic affect on group effectiveness  "
        ],
        "date": "Feb 2, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "a week",
        "role": "Software Engineer",
        "details": "The first round consisted of a technical screen which didnt have any programming. There were a few behavioural questions, one reasoning based question(given a long sentence and was asked what was wrong with that sentence) and some technical questions about virtualization,cloud computing,threads etc.Then i was selected for a continous 5hr webex session with 5 interviewers.The first interviewers didnot turn up for 1hr 20 min.Second and Third went well.Fourth wasnt available…  too.So they sadi they would reschedule the other interviews. But they had sent a reject in just like an hour and a half.",
        "questions": [
            "How would you implement a router for as big a company as Cisco that would accomodate lots of ip addresses.  "
        ],
        "date": "Dec 15, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "3 weeks",
        "role": "Software Engineer",
        "details": "The inteview was hard and detailed. I had 9 interviews in a day and they covered the details of all the work I had done previously. It was a tiring and a pleasant experience at the same time.",
        "questions": [
            "Socket Programming  "
        ],
        "date": "Nov 13, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2+ weeks",
        "role": "Software Engineer",
        "details": "a whole day interview. 3 managers interviewed me. It was a new grad hire. It started with a campus tour and then 3 managers asked different technical questions. The interview was for choice program and so they are not necessarily hiring managers. Be honest at the interview. If you do not have some background in certain tech or programming, just let them know. They do not expect you know everything.",
        "questions": [
            "Basic C and Java questions  "
        ],
        "date": "Aug 6, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "3 days",
        "role": "Software Engineer",
        "details": "got the interview through a referral. the interview process consisted of a technical onsite interview with five people.First interviewer was very thorough and went through everything on my resume and asked me many questions on extra activities and not on coursework.Second interview was a skills test and comprised of questions like diffrence between a mutex and semaphore. which data structure to use in what situation etc.",
        "questions": [
            "Describe oakley key exchange protocol  "
        ],
        "date": "Apr 2, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "There are no self-introduction part or CV questions. It went straight forward to a program analysis question, asking me to figure out all the possible errors in that program. Some are obvious syntax error. But there are some errors that are not obvious and require a sound programming foundation. There might be some other questions after this but when I failed to solve this question. The interviewer showed no further…  interest and stopped the interview. The 1 on 1 interview is stressful and the interviewer hope to find someone who are really experienced with programming, regardless of what programming language he / she is using.",
        "questions": [
            "Find all errors in a program  "
        ],
        "date": "Oct 2, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "They take your GPA seriously into considerations.Then they look for systems related project experience.",
        "questions": [
            "Question about GPA.  ",
            "A quick c++ question  "
        ],
        "date": "Dec 28, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "Seven rounds of interview. Was asked to code algorithms. Fluency in programming languages was assessed well. Knowledge of software engineering principles is a must. Overall, the difficulty level is moderate. I wouldnt rate this as difficult in any way.",
        "questions": [
            "Java coding questions. Design pattern questions.  "
        ],
        "date": "Sep 6, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "4 days",
        "role": "Software Engineer",
        "details": "Phone screen a couple of times with manager and sr engineer. On-site with engineering director, hiring manager and senior staff engineers. HR offered a day later after back-and-forth negotiation about salary.",
        "questions": [
            "Read this Tcl script and describe what it does.  "
        ],
        "date": "Aug 18, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2+ weeks",
        "role": "Software Engineer",
        "details": "2 rounds phone interview. On site has 2 rounds. Each interview is half an hour. Questions from big kettle endian to driving programming and troubleshooting. Not very tricky and no brain tricks. Director will interview engineers as last round. Usually take 2-3 days to have response.",
        "questions": [
            "Do you want to be a manager  "
        ],
        "date": "Jun 19, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "Applied online.Initial phone screening for 2.5 hrs. Discussions involving OS concepts, DS, algorithms, resume based projects, some amount of behavioral.Scheduled second round involving a series of 4 webex interviews on the same day.",
        "questions": [
            "OS CONCEPTS, DATA STRUCTURES  ",
            "MEMORY MANAGEMENT  "
        ],
        "date": "Jul 18, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "The HR keeps asking about what courses I have taken in my graduate study. I list some courses about computer engineering. It seems she is not satisfied with that. And she asked me again about what other courses except the CS course ....And she also asked why cisco, why chose cisco and why should cisco need me",
        "questions": [
            "why cisco  ",
            "what courses did you take in your study  "
        ],
        "date": "Feb 24, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Software Engineer",
        "details": "The interview process was fairly straightforward with multiple rounds, that i was informed of prior to the interview. Initiated the process with a phone interview, which was about 45 mins. After this there was an in person interview with the following rounds - Introduction/General, Programming, Operating System and Network Concepts.",
        "questions": [
            "Reverse Link list related question  "
        ],
        "date": "Jul 8, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "got an interview from employee referral, everything went smoothly, mostly nontechnical question (even though it was an engineering position). heard a word from manager that my offer was being processed, and then the whole financial fiasco started. they had a major hiring freeze for couple of quarters, and finally decided not to hire for that position due to budget cut.",
        "questions": [
            "career goals  "
        ],
        "date": "Mar 24, 2011"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "The interview took place in a hotel conference room. We were then given a tour that they give to prospective corporate relations. We were never given an opportunity to see the offices themselves.",
        "questions": [
            "You have 8 balls. All are identical except one is slightly heavier. You have a balance. What is the minimum number of weighings required to find the heavier ball?  "
        ],
        "date": "Jan 29, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "3 days",
        "role": "Software Engineer",
        "details": "College recruitment. Interviewed by senior managers. Questions related to experience, side projects, interests, etc. Questions on OO programming (inheritance etc).",
        "questions": [
            "What was the toughest project you worked on recently and go you explain in detail..  "
        ],
        "date": "Aug 27, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "The interviewer started off by describing aspects of the company. He asked me which of the following I would be most interested in. Then proceeded to ask me questions about various past work experiences in which I did something outstanding, or went above and beyond what was asked etc. I would advice thinking over your past experiences to have some good memories already in mind when you go in. Lastly,…  I took a skills test regarding my C coding experience.",
        "questions": [
            "When did you ever go above and beyond what was originally asked of you during a previous job?  ",
            "Can you think of a time where you overcame adversity, avoided conflict, and came out on top?  "
        ],
        "date": "Jan 29, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "very basic data structure and algorithm questions, How do you reverse a singly linked list? Write a C program to reverse a string. Write C code to check if an integer is a power of 2 or not in a single line? Things like that, I was ill prepared though",
        "questions": [
            "Write C code to check if an integer is a power of 2 or not in a single line?  "
        ],
        "date": "Oct 26, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "1+ week",
        "role": "Software Engineer",
        "details": "interview process is lengthy and most of the time stick to basics , basics of networking is what most of the people check .",
        "questions": [
            "i didn't get any unexpected questions  "
        ],
        "date": "Feb 4, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "a week",
        "role": "Software Engineer",
        "details": "The interview process was standard session of writing pseudo code to solve a generic problem.",
        "questions": [
            "None of the questions were overly hard.  "
        ],
        "date": "Feb 25, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "4+ weeks",
        "role": "Software Engineer",
        "details": "technical interview. coding question on traversing a linked list. improving the speed of execution of an algorithm. i wrote an algorithm that was O(n). i then made it O(log n) and then I made it O(1).I was then asked to write an algorithm to delete something in a linked list only traversing it once",
        "questions": [
            "walk a linked list  "
        ],
        "date": "May 13, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "Hiring process was very long. I had to attend several interviews. It took a while to get an offer.",
        "questions": [],
        "date": "Mar 4, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "Multiple one on one interviews with team members over multiple days. This was many years ago and the hiring process is much more structured now. Back then the company was small and growing rapidly.",
        "questions": [
            "Why doesn't Utah have more rock concerts?  "
        ],
        "date": "Nov 9, 2014"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 days",
        "role": "Software Engineer",
        "details": "They asked the usual interview questions. They try to see at what level you are in your skills. They are very quick to respond if they choose you.",
        "questions": [
            "Have you ever disagreed with a collegue and/or professor and what did you do?  ",
            "What class did you think was least useful?  "
        ],
        "date": "Feb 11, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Software Engineer",
        "details": "1. Define Storage Classes and explain application domain.register - tell to the compiler for use a CPU register for fast aceess for that variable.auto - it's a variable created and initialized when it is defined. It is not visible outside of the block.static - defined inside of the function retain its value between calls. Always is initialized with 0. Defined as global in a file is visible on for the…  functions from that file.extern - the definition of the variable is in another file.2. Define the Storage Qualifiersconst - define a variable that can not change its value along the program execution.volatile - define a variable that can be changed indirectly. An example can be a counter register that is updated by hardware.mutuable - a member of a structure or object can be changed even if the structure, for example is declared const:Ex: struct complex {mutuable int x; int y;};const complex Mycomplex = {1, 2};Mycomplex.x = 3; /* correct */3. Give an example for a variable \"const\" and \"volatile\". Is it possible?Yes, a status register for a microcontroller.4. Detect if a linked list is circular.Need to use 2 pointers, one incrementing by 1 and another by 2. If the list is circular, then pointer that is incremented by 2 elements will pass over the first pointer.5. Have you any remarks?#define res(a) a*aUsing in this form the result will not be like we expect. Thinking that \"a\" is replaced with (2+3), then we will obtain 2+3*2+3 = 11 instead (2+3)*(2+3) = 25.Use always #define res(a) (a)*(a)6. Define a \"dangling\" pointerDangling pointer is obtained by using the address of an object which was freed.7. Any difference between \"const int*ptr\" and int *const ptr\" ?Yes, it's a major difference. First define a constant data and second define a constant pointer.8. What is the declaration and definition of a variable?The definition contains the implementation for a method or variable declaration. This is just an example.9. Give a solution for a stack overflow situation.func_call() {funct_call();}Every time the above function is called the return address is stored onto the stack. Calling in this infinite loop will cause a stack overflow.10. Give 4 examples for an infinite loop.a. while (1) {}b. for (;;) {}c. do {}while{1};d. label:goto label;",
        "questions": [
            "What are the difference between DES and RSA algorithm?  "
        ],
        "date": "May 14, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "The hiring process, from the job applicant perspective, includes several steps. From the time you apply for a job until the time you accept a job offer, you will go through a series of steps as you progress through the hiring process from completing a job application to coming on board as a new employee.",
        "questions": [
            "Played string manipulation questions a lot  "
        ],
        "date": "Aug 31, 2014"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "- 1 was asked a number of technical questions by the hiring manager and his staff.- I was asked a number of organizational questions by the staff.- I was invited back and I was asked general questions by the executives within the organization.- I was asked about the my education and specific classed that I attended.",
        "questions": [
            "1- What do you like about .Net.  ",
            "- Why are you looking for a job.  "
        ],
        "date": "May 28, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "2+ months",
        "role": "Software Engineer",
        "details": "Got a phone interview in May, and was interviewed by the hiring manager on topics ranging from networking to Operating systems. He called me the next day to set up an onsite at . The onsite was an exhausting experience.4 hrs with 5 interviewers. Had to wait for a month before any sort of reply from them after that.",
        "questions": [
            "Just the usual on data structures and Operating Systems  "
        ],
        "date": "Jun 22, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "Applied online and got a call from the HR to setup a pre-pre-screen! This was a 15-min. interview in which the HR went thru the motions talking abt my resume and experience. Few days later had a C-test. Not the easiest. If you are not a regular in C then you will take some time even though your C knowledge is complete. This was followed by two 45-min interviews with…  team member and engg. manager. I was very well prepared and the first interview went very well. He was thoroughly impressed. Then came the engg. manager. He seemed 'unprepared' about what to ask and started random questions on my experience. This also went well, later I thought some of my answers were incomplete but thought had done enough to get an onsite. Got a reject mail in a few days.Overall I thought the employees were very polite. It doesn't seem that Cisco needs brilliant people. People with good programming skills who know simple things like code optimization,data structures, few relevant projects go thru to the final stage. But,what I learned was that one position has about 10 people contesting and say 5 are upto the mark. After this I think the hiring decision becomes a subjective one . The engg. manager clearly seemed to have a bias towards CS guys. I was EE and his mood changed after hearing this.",
        "questions": [
            "Explain TCP IP  "
        ],
        "date": "Jul 9, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "Had two one hour phone interviews, one with the hiring manager, one with a technical lead. Both went well and a two day in-person interview was being scheduled. However, the day before the interview the hiring manager got in touch with me to let me know that the job req. was no longer available, but more would be opening in the next quarter. Waited until the next quarter and got…  my in-person interview. There was a programming test with three developers asking me questions. I ran long on the first one, the second question was based on code one of the interviewers put on the board (which had an unintentional bug), and the third one I dealt with well. Next came a one-on-one interview with another developer, but no technical questions were asked. The hiring manager was also too busy to actually interview me. At the end of the first day the hiring manager informed me he would be contacting me later that day to let me know the results. He did not get back to me until the next day to say they would not be extending me an offer.",
        "questions": [
            "Write a file copy function in the language of your choice  ",
            "What does the following function do:unsigned intdoit(int x){    unsigned int z = 0;    while (x &= (x-1)) z++;    return z;}  ",
            "Write a string reversal function  "
        ],
        "date": "May 28, 2010"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "2+ weeks",
        "role": "Software Engineer",
        "details": "Had a phone interview where I was asked basic networking questions and some C questions. It was all very simple. Later had onsite. Had 5 rounds. 4 rounds of technical interview which tested my C skills, OS concepts, networking and my past work experience. And later a HR kinda interview with hiring manager.",
        "questions": [
            "From your network concepts learnt academically, explain what happens when you try to connect from your laptop at home to a server in your college. Decribe whatever you feel is relevant in this scenario  "
        ],
        "date": "May 4, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Applied online and got a phone interview with Cisco Systems for a software engineering position. The interviewer was very friendly and first started asking questions on my resume and previous projects. Then slowly started asking more difficult questions geared towards programming and networking knowledge. The interview lasted for almost one hour with most questions of the type \"what are threads?, what are local and global variables?, what is heap memory?,…  explain tcp sliding window mechanism and congestion avoidance\", etc. Overall it was a fairly good interview experience and I'm waiting to hear back from them about the results.",
        "questions": [
            "Explain TCP sliding window mechanism  ",
            "Explain congestion avoidance in TCP  "
        ],
        "date": "Mar 14, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "a week",
        "role": "Software Engineer",
        "details": "Basic C questions (Pointer,Structures,linked list, arrays,data types), Computer Networking concepts (TCP/IP,UDP).I was interviewed for 1 hour. It was pretty simple. Though I screwed up in some of them.I could not answer most efficient way in finding number of 1's in a given number.",
        "questions": [
            "sizeof(data types)  ",
            "find number of 1's in a number  "
        ],
        "date": "Apr 3, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Apllied through my friend's friend who is an employee of Cisco. The interview was with three people one-to-one, each averages 45 mins. They needed somebody with expertise in OS, device drivers and C. Most of the questions were from what we find on internet, the standard questions including C programs. Lack of preparation cost me.",
        "questions": [
            "Details of memory storage for different type of variable definitions in C.int i;int j=0;int k=1;const int l;which goes to data, bss, rodata, etc.  ",
            "In virtual memory, can two different processes have the same address? When you answer \"No\" which is correct, how one process can access another process' memory, for example the debugger can access the variables and change them while debugging?  "
        ],
        "date": "Apr 15, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Software Engineer",
        "details": "I had two phone interviews (one including the manager). After a week and a half, I was invited to have an onsite interview. The onsite interview consisted of 6 one-on-one meetings with members from the team including members from other teams (which included a hardware perspective and architecture perspective). Once the on-site interview was complete, I was told they were interested and they asked what amount I was looking for.",
        "questions": [
            "How would you approach updating a code-base to support 64-bit?  "
        ],
        "date": "Aug 5, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Average Interview",
        "difficulty": "-",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "Phone interview, in person interview, meet director; the interview is relative straightforward with some programming test. Two rounds of interviews with team members; questions are ok. Some are tough ones deeper into Cisco IOS and industry trend",
        "questions": [
            "network technologies  "
        ],
        "date": "Oct 4, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "Initially I went to the career fair in my university and got my 10 minute in person interview with one of the recruiters. Next I got a phone call for another on campus screening interview which was pretty easy considering, my interviewer was not paying any attention to anything I was saying, he just asked me questions straight from my resume and was chatting away on the chat client on…  his laptop. After that I got invited for onsite interview which took whole day, Cisco flew me to the San Jose where for 1 straight day I had 5 behavioral interviews and 1 technical. Overall technical questions were stupid easy, like what is AJAX, etc.",
        "questions": [
            "What is AJAX?  "
        ],
        "date": "Jun 6, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "a week",
        "role": "Software Engineer",
        "details": "I submitted my resume through Cisco.com for a Software Engineering internship position. It took about a month for them to contact me back. The recruiter called me for a phone interview, the questions were pretty easy. It's more of a review of my resume and background. I was called into an onsite interview about a week later with the hiring manager. The questions were pretty easy, I guess it was…  because I was applying for an internship position. He asked me basic PHP questions, how does web application works, some networking fundamentals and some design questions. Then, I was interviewed individually by the entire team and extended team. It was a pretty long 5 hours interview. The interviewer were really nice and took a lot of notes during the interviews. You should really study and prepare for the interviews in both technical and soft skills questions. They offered me the internship about two weeks later.",
        "questions": [
            "How do you start optimize a database engine?  "
        ],
        "date": "Oct 11, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "School Job Fair: talked to the recruiter, discussed previous work experience and asked him to pass along my resume to be considered for interview1st interview: On campus interview after the job fair. It was a 30 minute screening interview.2nd round interviews: On Cisco campus in San Jose. All people interviewing for choice went through three back to back interviews with hiring managers. Each interview was approximately 30 minutes. Most questions…  were question-answer type questions rather than coding problems. More emphasis was put on discussing previous work experience.",
        "questions": [
            "(forgot the exact question) but it was to write code that did bitwise operations. and then to optimize it  "
        ],
        "date": "Aug 13, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2+ weeks",
        "role": "Software Engineer",
        "details": "Applied online, phone interview, then onsite. Offer negotiation.",
        "questions": [
            "Give logic for implementing \"diff\" command in Linux.Consider various test cases and explain what will happen in each. The two files are source code and are huge..For e.g.File 1: 1-2-3-4File 2: 1-3-4-2  "
        ],
        "date": "Nov 18, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Negative Experience",
        "difficulty": "Easy Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "Simple technical questions - mostly networking knowledge and coding/debugging skills",
        "questions": [
            "write a code that finds a prime number  "
        ],
        "date": "Sep 6, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4 weeks",
        "role": "Software Engineer",
        "details": "Cisco Recruiter called me that she is trying to fill a position for past several months and she thinks my profile on LinkedIn is perfect fit. I ask her to send job description. When she did and I reviewed, I said it is not perfect fit. She said, it is match - she suggested me to speak to Tech Leader. I spoke to Tech Leader and he did a phone…  screen as well. Then, after a week or so, I went for an in-person interview with 4 engineers... for about 4 hrs. Then, after another week, there was another in-person interview with 2 more engineers, 2 directors. Then, they made me an offer - negotiation, reference checks etc took another 2 weeks.",
        "questions": [
            "How would you design a thread pool in Java?Why do you need threads?How do you detect stale db connections?Can you do code review of this class from my code? (Interviewer shared code)Design for several readers reading from queue and several writers writing into itDetails on how a web-app is developedWhat happens end to end when user types a URL to view books on Amazon.comSingleton - how to write for delayed…  instantiation but also thread safety  "
        ],
        "date": "Sep 3, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Initial communications was via email. The HR representatives were quite friendly and prompt. The planning and organization of the interview was quick, simple, and professional. The people were the work quietly type, friendly enough, but not overly outgoing. Most worked at their own cubicles.Some advice for other interview candidates: be prepared to answer both behavioral and technical questions. I assumed that the first interview would consist only of behavioral questions...and…  I was wrong. Luckily, I managed to do ok on the technical questions. However, if you are rusty on coding principles...such as object-oriented design principles, I would freshen up on those. Expect to answer coding questions and write a few lines of simple code as well. In addition, you may be asked a few puzzles that force you to think critically. Overall, my interview experience was fairly short (less than an hour), and not too stressful.",
        "questions": [
            "You have a silver block with 6 marks that divide it into 7 equal parts. How do you make exactly TWO cuts so that you can pay an employee exactly 1/7 of the block each day he works for a week?  "
        ],
        "date": "Aug 28, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "Data strcutures, C and OS is the thing that rules for a cisco interview...if you know them you can get through...first round : Csecond round : OSthird round DS",
        "questions": [
            "Diff bet heaps n stacks  "
        ],
        "date": "Jul 15, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "6 weeks",
        "role": "Software Engineer",
        "details": "The interview requirements are different across different BUs, some BUs have high threshold on technical details, some BUs are more focused on communications and collaboration, and it depends on different managers, some rely on the reference and relations, some rely on your documentation achievement, such as how many patents, basically, that's better to get information before the interview about who will interview you, and who is the hiring manager ,…  and do some homework.",
        "questions": [
            "what's the swap chain in D3D rendering  "
        ],
        "date": "Jul 16, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "I got in through University recruitment program. I had 2 rounds one on campus at the school and the other one at the company's head quarters.Interview was very long and asked everything from A-ZThere were 8 people in all who interviewed me other than a director and a VP.",
        "questions": [
            "Binary tree algorithms  ",
            "Operating systems design  "
        ],
        "date": "Jan 14, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1+ week",
        "role": "Software Engineering",
        "details": "The interview process was pretty normal compared to other companies. Nothing strange that would make candidate think they are just trying to trick me or showing off, I got the feeling that they really want to see if the candidate to delivery software, rather than to see if where the candidate's limit is.The manager was very friendly.",
        "questions": [
            "describe a project you did.  ",
            "Insert an integer into a sorted linked list,  "
        ],
        "date": "Aug 4, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "No respect for any thing you did for the whole time in your career. They started off with C questions and ended with C questions. No one even cared to see what was on the resume. They just asked the questions that they were familiar with. All the C questions were from the web sites. No creativity there. None of them smiled. None of them looked happy either!",
        "questions": [
            "No questions on the technology that I had worked on.  "
        ],
        "date": "Jun 4, 2009"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "2 days",
        "role": "Software Engineering",
        "details": "I got a call asking me to come in and do an interview. The interview was scheduled for the next day. I did the interview and they said they would call me. The next day I got a call to do another interview thinking it was a continuation of the same group but it was from another manager. I did the interview and the next day I was called by…  HR asking what I wanted for pay and sign on bonus. I was offered a choice both jobs. I chose the position I wanted and received an offer letter the next day.",
        "questions": [
            "On the board draw a diagram of a system they were interested in.  "
        ],
        "date": "Jun 7, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Average Interview",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "Initial two phone interviews",
        "questions": [
            "Some complex data structure questions. (not unexpected, but was fairly complex)  "
        ],
        "date": "Aug 20, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "Friend refer->phone interview->4-5 people interviews on site->give offer",
        "questions": [
            "Can you describe how BGP works?  "
        ],
        "date": "Nov 6, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "1+ week",
        "role": "Software Engineer",
        "details": "My opinion is limited obviously to the one experience I have had. My first contact was with the recruiter. The recruiter was very friendly and gave me a good overview of what the team did and what the job role was. He sent me the detailed job description which helped me prepare for the interview. It was followed by a 30 minute phone interview. Onsite interview soon followed - which…  was fully technical - \"C\" coding questions and OS and Networking questions and some design questions -- all of above average difficulty level.",
        "questions": [
            "Delete a node in a linked list.  "
        ],
        "date": "Dec 20, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "On-site visit and interview with hiring manager, as well as, staff in the group. Explanation of product/technology developing. Group discussion answering questions about my previous work experiences and skill-sets.",
        "questions": [
            "Software coding and algorithm questions.  "
        ],
        "date": "Jul 10, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "5 days",
        "role": "Software Engineer",
        "details": "received a phone call after initial HR filtering. Had the first phone interview with HR. Was invited to the location for a complete interview. The manager had 1:1 with me and showed the working area and explained work requirements. Then there were 2 panel/group interviews with completely technical questions. I then met a few more people and answered some questions.Was offered the position before I reached home.",
        "questions": [],
        "date": "Sep 7, 2009"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "I met my interviewer at a conference and we briefly discussed my qualifications, interests and past projects. Later, we had a phone interview and screen share where we discussed my most successful project, what makes me a good candidate and my past work experiences. I answered some technical questions through screen share and we ended the interview with him answering some of my questions. This was my first ever technical…  interview and I was very nervous, but the interviewer was very helpful and guided me when I was having some trouble.",
        "questions": [
            "1. Linked lists/ doubley linked lists and comparison between the two.2. Threads vs. Processes3. Semaphore vs. Mutex4. Given a list, write a function to print out only the unique values.  "
        ],
        "date": "Feb 9, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "Submitted my resume online after speaking to a representative at a career fair. Got invited to a first interview at my university of about an hour. Classic introductory questions then I was asked to write a C function to remove certain characters from a string on a board.",
        "questions": [
            "Write a C function to swap the last and next to last nodes of a linked list  "
        ],
        "date": "Mar 6, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "5 weeks",
        "role": "Software Engineer",
        "details": "Interview took place in Ottawa. Interviewer was very positive and questions were fully technical, mostly on C data structures. The questions: How to remove an element from a doubly linked list, how to add one element to a singly linked list, what are the networking protocols that you know, explain how internet works, mutexes, semaphores.. It was a long but friendly interview.",
        "questions": [
            "Doubly linked list, networking protocols, pointers, stacks  "
        ],
        "date": "Mar 8, 2016"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Negative Experience",
        "difficulty": "Easy Interview",
        "length": "2+ months",
        "role": "Software Engineer",
        "details": "Applied through employee referral, got call from HR scheduling F2F.2 rounds of technical discussion + 1 manager round.After one month again got a call and scheduled 2 rounds of technical interview. By the time I got an other offer.",
        "questions": [
            "Very simple entry level java questions. Some algorithms because its a Cisco.  "
        ],
        "date": "Mar 17, 2016"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "a week",
        "role": "Software Engineer",
        "details": "one telephonic round and 4 face to face technical round and managerial round and followed by one hr interview, qusetions will be tricky not so simple so prepare with good analysis will be iq questios also so prepare also that one, prepare for writing the code also and well prepared for group interview.",
        "questions": [
            "linked list, tree, data structure and hibernate.  "
        ],
        "date": "Jan 13, 2016"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1+ week",
        "role": "Software Engineer",
        "details": "Lasted about an hour with two managers. Very efficient as I received the results the next day and the interview started immediately and on time.Mostly asked about behavioral questions,how do I solve them if this situation happens, my final year project contributions etc. I expected more technical questions.Just be confident when you answer the questions.",
        "questions": [
            "Number of layers in network models.strength and weaknesses. fyp contributions  "
        ],
        "date": "Dec 23, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "7 weeks",
        "role": "Software Engineer",
        "details": "I got a call from Cisco HR for this interview. There was totally 4 rounds: 2 Telephonic(very tough), 1 face to face and 1 HR round. Face to face round was more on logical thinking, real time problem solving, code optimization etc.",
        "questions": [
            "They asked more questions from resume. But last round was totally different. Last round was on white board. More on the code optimization, real time problem solving etc.  "
        ],
        "date": "Nov 24, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "First Round - Online Test - included more of Electronics questions and very few CS and Aptitude questionsSecond Round - Technical Interview - included questions about my projects and c programming codingThird Round - Managerial Round - included c programming questions and stress interview questions",
        "questions": [
            "OS questions, C programming, About Project worked on  "
        ],
        "date": "Aug 8, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "The recruitment process started with an online test comprising of aptitude, networking and c concepts. Then we had 2 rounds of technical interviews mostly on c , c++ and data structures.Apart from these concepts, questions on RTOS and computer networks were also asked.This was followed by an HR round where they were interested in our interests and knowlegde about the profile.",
        "questions": [
            "Data Structures  "
        ],
        "date": "Jul 24, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "It started with Aptitude Test (Online) of 60 mins.Then 2 technical rounds.And 1 HR roound.They focus on logical thinking, problem solving capability.Give hints for some problem.It was great experience for me because i was interviewed by a panel which has experience of 20 years in technical vertical.",
        "questions": [
            "They asked me Bruteforcing, big O time complexity, shaker sort vs bubble sort, c memory reprentation, how .exe loads into memory, static variable allocation, IP header.Reverse a linked list.And YES the main question ....Explain shaping and policying in CISCO.  "
        ],
        "date": "Jul 17, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "I received a call from a project manager and the phone interview took about an hour, I was asked a few questions about why I choose Cisco and then a few other questions about my fourth year project and previous experience, Once that is done I was asked to join a conference call and start coding some linked lists",
        "questions": [
            "Create a linked list and then write functions to add and delete nodes from it  "
        ],
        "date": "Sep 14, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "a week",
        "role": "Software Engineer",
        "details": "The first round was a usual interview telling about yourself the basic information and project experience and the second round is more formal and have two interviewees together and last for about 1 hour and a half. After that just the usual any question for them part and finished.",
        "questions": [
            "They asked question about algorithms and data structure but all very easy and basic ones. Then follows related with the software engineering, and design pattern, they also include some question about the networking. But the most importantly was the question focused on your CV and project experience, how do you solve those problems and why do you choose this.  "
        ],
        "date": "Aug 26, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "This was an initial screening interview for the summer internship program. The interview was done via Cisco's WebEx. The HR manager mainly asked questions from my CV/cover letter. I passed the interview and went on several more interviews.",
        "questions": [
            "Why Cisco  ",
            "Cisco is a company based on collaboration and communication between its employees - how would you fit into Cisco's culture?  "
        ],
        "date": "Apr 13, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "5 days",
        "role": "Software Engineer",
        "details": "I got a email from cisco after 2 weeks to prepare for a phone interview. And the other day, a recruiter ask me for about half hour through the phone",
        "questions": [
            "Explain one of your project ? how to deal with free rider in the team? process vs thread.  "
        ],
        "date": "Jul 7, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Interview process was good .HR executives were very friendly.First Round was written round . It consisted of 4 sectionsC programming mailnly linux /process/fork etcEnglishAptitude1 C program2nd round was F2F technicle lasted for 50 minutesasked basic bit operations , IPC mechanisms /Linked list programs ,Memory allocation etc3rd Round was Again F2F asked to implement memcpy4th round was HR enquired about previous hike, expected salary and Personal Details etcAsked to send Salary…  details ASAP.But i was never contacted . After sending gentle email also i didn't get any Reply.I didnt get Rejection Mail also.After somedays my friend working there contected and updated me that i was not selected",
        "questions": [
            "Implement one IPC with very limited resources  "
        ],
        "date": "Jun 12, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "I have attended Off campus that held on 7 march 2015 on main office Bangalore. The process was very simple well defined it takes 4 rounds of interview.1. Round was written test(appti+Data Strucure+ Algorithm+ Networking+Reasoning+c+C++) it takes 50 question in 60 min.2. Round was technical interview in this interviewer wants to check whether you are comfortable with coding or not.I have given each and every question's answer clearly. And got…  cleared that round too.Some question were askeda. How to traverse tree code preorder traversal recursively and iterative both.b. Memory layout in c.c. How to compare two string effectively.(o(n))d. How to sort an array which is the best techniques that you will select and why.e. How internet works.3. Round based on network only.I have not cleared that round just because of some bloody question like IP header, TCP Header, Socket, IPV4, IPV6, and some devices related question.Some question were askeda.Write a program to convert decimal number in to binary.b. How to convert a tree into binary search tree.c. How the internet devices works.d. How wire shark works.e. Some question based on const pointer.f. Explain how NAT works.g. What is IP addressing explain each one in deep.I have answered coding question efficiently but a little bit weak in network. So did not grab this opportunity.4. Simple HR round like weakness, strength, why cisco just like formality.",
        "questions": [
            "How to compare two string effectively.(o(n))  "
        ],
        "date": "Mar 9, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "4 rounds of technical. round 1:online questions on C and logical reasoninground 2: programming and display the output. round 3: programming and technicaltechnical:based on networking,protocols,previous project experienceanswers were not accepted if its common logic. interview took one whole day waiting for so much time between each rounds",
        "questions": [
            "write a program of sorted list which should not contain duplicates for given i/p of numbers. check whether given list contains loop.palindromes ,  "
        ],
        "date": "Feb 25, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "I got a phone interview two days after submitted my CV online. 40 mins all on basic data structures. On-site interview lasts 2 hours with three different groups. Still on data structures, no logic and creative problems. The working place is not as good as i expected. people are coming late, and looks exhausted even in the morning",
        "questions": [
            "inverse a number to binary  ",
            "double link list  ",
            "recursion  "
        ],
        "date": "Feb 10, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "1. Online test consisting of C, OS, Electronics, Networks etc.2. F2F Interview3. F2F interviewThe interviewers were arrogant. I was a chemical engineering graduate. Technically I wasn't allowed to sit for their process, but they allowed me to. During interview they didn't even ask me any technical questions, even after I cleared the test. They told me to wait outside even when I knew they were going to reject me. I…  waited 4 hours for the result I already knew and interviewer suggested.",
        "questions": [
            "Resume based questions  "
        ],
        "date": "Mar 19, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "There is one Written test.It contains questions related to networks, and problem solving questions followed by 3 rounds of interview.2 technical and 1 hr round.In technicaal round they asked questions related to networks and coding.Hr round is easy b(basic question like why cisco,strngths and weakness)",
        "questions": [
            "Coding question.  "
        ],
        "date": "Jan 29, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Average Interview",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "2 Rounds only, First round was telephonic and basic c que. like storage classes, multitasking, mutex, semaphore, i cleared the first one, second round was on networks and algorithm like how to identify a number is 2 to the power N. in order 1.",
        "questions": [
            "How to find duplicate number in an array in order 1  "
        ],
        "date": "Jan 5, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "The interview was provided through internet. I had the interview with team manager and team lead. After brief presentation of my previous experience I was asked some technical questions. The whole interview took about an hour. I was really surprised to get an offer in half-an-hour after the interview.",
        "questions": [
            "Write a function that evaluates a sum of all integers from 1 to 100.  "
        ],
        "date": "Jul 16, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "5 days",
        "role": "Software Engineer",
        "details": "They invited for in-site interview. There a person responsible for technical questions and the manager was also there and was listening to my answers while working with his laptop. Lots of technical questions about java and networking. How the Internet works. How you can write a linked list and so on.",
        "questions": [
            "How to understand a linked list is planar or loop?  "
        ],
        "date": "Apr 11, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "onsite interview with 6 senior engineers, 2 at a time. Onsite for upto 6 hours. Questions ranged from networking technology to problem solving with algorithms.interviewers were very pleasant experienced bunch, asked difficult questions but not aggressive.",
        "questions": [],
        "date": "Nov 18, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "I applied through college process took one day, 1st round was written round consisting of apti and technical and 2nd round was based on your resume and bit coding. Difficulty level average.",
        "questions": [
            "Questions based on Computer Architecture.  "
        ],
        "date": "Nov 2, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2+ weeks",
        "role": "Software Engineer",
        "details": "HR immediately contacted me over the phone, after I send my CV via an internal contact in the company. They asked an on-site interview in a week with a technical interview. I met with the local branch managers first for an hour and they asked me general questions about my interests and background.",
        "questions": [
            "Why Youtube uses HTTP for video streaming? (instead of UDP).  "
        ],
        "date": "Oct 21, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "5 days",
        "role": "Software Engineer",
        "details": "They have two stages - phone and in-person. It is quite smooth. They want to verify all of basic features. They may ask you to write answers of technical questions. In-person interview lasts quite long.Keep aside 3-4 hours. Keep in mind they are trying to select you - not reject you. So as long as you know basic things you should be okay.",
        "questions": [
            "Spring framework features  "
        ],
        "date": "Oct 2, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "1 phone interview, 6 hours of interview onsiteDecent interview..Focus on C, memory concepts, Distributed systems , O.S , algorithms.1 interview with manager, rest with with tech lead..took entire day..Flow in from south Ca, to north CA,Decent experience",
        "questions": [
            "questions on operating systems, c, c memory management,  "
        ],
        "date": "Sep 10, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "written apti+tech , personal interview and a hr interview. interview was a kinda easy one . you just needd to stay calm. your approach to the problem matters a lot , even if you dont give exact answer its k",
        "questions": [
            "scheduling in linux  "
        ],
        "date": "Aug 22, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "Cisco Systems visited our campus. The interview process was fairly straightforward. There was a Written test of 1 hour. It had 20 questions from aptitude and 30 questions from Technical (C,DS,Basic Electronics Concepts). Then there was a Technical round and HR Round. The technical round were mainly based on C,DS and Networking Concepts. You need to be clear with basics. And have good communication skills",
        "questions": [
            "Aptitude was difficult  "
        ],
        "date": "Aug 23, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "Firstly Written round was dere containg 50 questions.20 ques.of aptitude and 30 technical ques.covering core electronics as well software questions.After this students were shortlisted for the interview.The ques.asked in the interview belonged to data structure and networking mainly.Then the HR round was there in which normal puzzles were asked and ques like \"why i want to join cisco,where i see myself after 10 years,etc\" were asked and the interviewer told…  me about the company.",
        "questions": [
            "I didn't find any part to be very difficult or unexpected.  "
        ],
        "date": "Aug 11, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "Aptitude+technical test followed by 2 interview rounds. Technical round has standard questions on C, few questions from digital electronics, aptitude had a lot of time consuming questions. If you have attended the same company before for another profile, few questions repeat. Concepts tested are the same",
        "questions": [
            "Aptitude questions were heavy on probability, most of them difficult and time consuming  "
        ],
        "date": "Jul 29, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "Took a daywritten test had aptitude , c programming,data structures , basic electronics and networking.2 technical interviews. Majority of the questions in both the rounds were based on programming and networking. Basic electronics questions were also asked.",
        "questions": [
            "Print all permutations of your name.  "
        ],
        "date": "Jul 28, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "-",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "This was for an internship. Submitted my resume at a campus career fair and was invited to speak to an engineer for a 1-1. Spoke with the engineer about my project and explained what Fourier Transform is.",
        "questions": [
            "Explain what Fourier Transform is and what it does.  "
        ],
        "date": "May 1, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "First, there was a written aptitude + technical screening test. It had 50 questions- 20 aptitude + logical reasoning questions and 30 technical questions mainly from topics- Computer Networking, Analog and digital communication, Digital Electronics, Data Structures, OS.Then, there were 2 technical interview rounds followed by HR round. In technical round, they asked about project/internships and gave coding questions to solve.",
        "questions": [],
        "date": "Mar 9, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Difficult Interview",
        "difficulty": "-",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "3 Rounds1st - Technical,MCQContained questions form Microprocessors, Aptitude, Operatng Systems, Networks, C/C++,Algorithms.2nd - Technical Interview3rd - HR Interview",
        "questions": [
            "17 nodes from a node, how will you make a tree.  "
        ],
        "date": "Mar 6, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "There was no technical question. The interview was very simple. There was only one interview. It was a phone interview. I was asked for reference, I provided 2 references and after 2 hours I got the offer. It took more time till get the paper work and sign the offer.",
        "questions": [],
        "date": "Feb 5, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "phone interview ---> online interview ----> onsite interview",
        "questions": [
            "two years ago interview , do not remember now  "
        ],
        "date": "Feb 1, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Software Engineer",
        "details": "I was interviewed by the hiring manager. The interview was carried on online and lasted about 30 minutes. The manager was an experienced software engineer that checked mostly the kind of person I was since he was already working with a former university colleague of mine.",
        "questions": [
            "Database generic questions  ",
            "Design patterns  ",
            "Background  "
        ],
        "date": "Oct 10, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "Hiring process is very organised. Will have medium numbers of rounds. Technical strength is what they check. HR is mere a formality. Should be technically strong in the areas they expect for that particular job. Type of questions and generosity depends on the interviewer. There can be 2-5 tech rounds and one HR round.",
        "questions": [
            "In my interview, it was all about data structures and they check for strength in data structures like linked lists, hash tables and search optimization.  "
        ],
        "date": "Jan 6, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "Overall, I went through a process of 4 interviews with HR and technical people",
        "questions": [
            "Cannot disclose  "
        ],
        "date": "Dec 18, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "a written test followed by 4 rounds of interviews which included questions from my project, basic programing, puzzles and the last round was a HR round. In HR round they asked mostly about why i want to join cisco etc",
        "questions": [
            "none all questions were avg level  "
        ],
        "date": "May 7, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Campus Recruitment",
        "questions": [
            "How would you fix a D-Dos attack?  "
        ],
        "date": "Oct 20, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "Written round20 questions-Apti30 questions-Tech1 tech interview1 hr",
        "questions": [
            "1 DC (multiplexing) 1 CCN(numerical) 1 number representation DS(binary trees only) microprocessor DMA memory mapped a lot of OS questions1hr  "
        ],
        "date": "Sep 23, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "-",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Oncampus recruitment. Written round followed by 2 technical and a HR round.",
        "questions": [
            "Read or write a word in a memory where read/ write can be done only in sector-wise  "
        ],
        "date": "Sep 20, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Average Interview",
        "difficulty": "-",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "Phone Interview and then face to face interview",
        "questions": [
            "Technical round of questions. Could be from anywhere from resume  "
        ],
        "date": "Sep 9, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "I was hired from university. The panel visited the campus. There was a presentation about the company followed by a written test having 30 technical and 20 aptitude questions. If shortlisted, 2 technical interviews followed by 1 HR interview",
        "questions": [
            "The interview questions were around basic networking. Since it was an entry level positions, no touch questions were asked.  "
        ],
        "date": "Sep 3, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "I was selected in campus hiring program. It was 1 day process. First round was multiple choice round. After that had 3 one to one technical reviews and one HR interview.",
        "questions": [
            "Lots of networking and oops questions  "
        ],
        "date": "Dec 10, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "It was part of campus recruitment. 1 written test plus 3 set of interviews were conducted. 2 technical plus 1 hr interview. The roles offered included SE, IT and NC.",
        "questions": [
            "some questions relating to my projects and trying to relate with real world scenarios to analyze and code.  "
        ],
        "date": "Feb 11, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "Campus recruitmentFirst round was aptitude test-20 quant questions and 30 technical questionsThere were two technical interviews,and one HR interview",
        "questions": [
            "Some questions on linked lists and some puzzles  "
        ],
        "date": "Aug 23, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Campus interview.1, Tech- apti2. One to three tech interview. it goes easy to difficult.3. If technical round is cleared, HR round will be there for one or two times.Mainly focused on the projects and area of interest. They drive more questions.",
        "questions": [
            "How will you implement a floor of a mall where entry and exit are done.  "
        ],
        "date": "Aug 6, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "The interview process started with the ubiquitous written round. This round had two sections viz technical and aptitude. The aptitude questions were witty and a bit confusing but were solvable. The technical questions were more concentrated on logic design and basic electronics with a bit of networking. There were 50 questions (30 aptitude +20 technical). The selection for the next round was based on some relative cutoff.. Around 250-300 people…  wrote the first test and 60 of us got selected for the next round. The second round was panel interview which the recruiters started immediately after declaring the results of the first round. My interview was conducted by a 2 member panel. My first round score was good as were my academics scores which aided gain some comfort in the interview. We had to submit the resumes before the interview started. My main subject of interest is networks, so they routed me to a panel which had an interviewer well versed in networks. I told my subjects of interests as networks and OS( operating systems). The panel members grilled me tested my technical knowledge relating to these fields. They asked me some questions on the projects that I had mentioned in my resume.The technical questions ranged from basics to specifics. The interview went on for around 30-35 minutes. I answered most of the questions (about 80-85%) with detailed explanation wherever needed but could not answer some of the questions for which my answer was a plain \"I don't know, Sir\". After the first round of interviews , they called me again and asked about my final year project and my plans on future studies and career. This lasted for 10-15 minutes after which all of us had to wait for around 3-4 hours meanwhile they completed the interview rounds for all the first round selects. Then there was a casual HR interview. The questions were also casual testing my soft skills.All these interview processes were carried out on a single day. After all processes and procedures they declared the names of the final selects at 12 in the mid night! They selected 13 people from our college out of them 8 were recruited for software engineering profile ( I was one of them :) ) and others for IT profiles.",
        "questions": [
            "1. How to delete the content of a file without opening the file in linux?2. How does the transport layer provide secure and reliable communications ? ( I was familiar with those services in Data link layer, so had to extrapolate that knowledge to transport layer )  "
        ],
        "date": "Mar 25, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "1st round: technical test, which included questions regarding C,Electronics,Communication systems and aptitude2nd,3rd rounds: interviews based on C language basics, OS basics, Data structures and a few puzzles were asked4th round (optional) : HR round",
        "questions": [
            "Dynamic programming  "
        ],
        "date": "Oct 3, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Difficult Interview",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "Firstly there was a written round consisting of general and technical aptitude.50 questions in one hour.Then 36 students were shortlisted.The interviewers were looking for learnings in networking and data structures.being from a circuits backgroung I lacked the knowledge.Dint get rhrough",
        "questions": [
            "Traverse a linked list from the end ten places  "
        ],
        "date": "Sep 10, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "First round was written test, which consisted question from signal processing, sql, aptitude, programming, computer architecture, data structure, operating systemSecond round was interview for selected people, I was among selected persons,The interviewer was a very friendly person, although I could not get selected because of not being efficient at coding, but he did not put me down, but tried to have pleasant interview",
        "questions": [
            "Given a automated parking lot, try to think what will be the problem can arise  "
        ],
        "date": "Sep 10, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "1 written round + 2 tech interviews + 1 HR",
        "questions": [
            "I was asked to write the most difficult code I had written ever.  "
        ],
        "date": "Sep 14, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Average Interview",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "First round was apti which mostly consisted of quant and digital electronics questions and few OS and C questions too.. it was easy and i cleard it..nxt round was technical interview in which he mostly asked me abt Computer organisation and Microprocessors",
        "questions": [
            "what does 32 and 64 bit mean in specs of comp  "
        ],
        "date": "Jul 31, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "It was an on-campus hire.The questions were textbook questions on Operating Systems, Algorithms and Datastructures.",
        "questions": [],
        "date": "Jul 31, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "After the online test, I got a call from an HR manager, who asked me about my life like hobbies and so on. After that, I went to Lisbon to have two video interviews (about tech stuff) with people from London and after that I was asked to go to London and spent a whole day in a room with different people from different areas coming in and interviewing me.",
        "questions": [
            "What was the biggest challenge you faced and how did you overcome it?  ",
            "Tell me how you would improve this specific device  "
        ],
        "date": "Aug 26, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "5 days",
        "role": "Software Engineer",
        "details": "i saw the job posting HR guy contact me a week later although i have received an email that i have been rejected",
        "questions": [
            "your field of study was not related to this job why you have applied for it  "
        ],
        "date": "Jun 25, 2013"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "First round had aptitude as well as technical questions.Technical questions were from computer organisation and microprocessors.2 technical round of interviews were there.Last round was hr round which was easy.Nearly 60 students cleared the first round and 8 students cleared the whole process",
        "questions": [
            "data structure realated questions  "
        ],
        "date": "Sep 20, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Campus Placement.Written test followed by one round of technical discussion and one round of HR discussion. Mostly project related questions in technical round.",
        "questions": [
            "Design a sensor to predict if a person is hungry or not.  "
        ],
        "date": "Apr 10, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Software Engineer",
        "details": "Telephonic round followed by 3 face to face technical rounds , followed by a managerial and hr round. The process took place over a span of month and was a good experience. Interviews were of average difficulty level. The opening was for a Java developer. And the questions asked were based on Java, OS, Design Patterns and Data structures and algorithms. Managerial round was focussed on domain knowledge.",
        "questions": [
            "Write a code to find shortest path between pairs of cities given a graph represnting connection between cities.  "
        ],
        "date": "Apr 11, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "I was referred by my supervisor in graduate school to the engineering manager of the Cisco team I was applying for. Then I went to the company and had a chat with the engineering manage to get to know each a little bit. A few days later, I got an onsite interview. I was asked something about my resume, a few design questions and two easy coding questions. Everything went…  smooth. I got an offer the next day.",
        "questions": [
            "a design problem about the project they've been working on. I was asked to provide my solution based on my own research experience.  "
        ],
        "date": "Feb 20, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "HR -> 4 technical rounds - Manger round - HR interview",
        "questions": [],
        "date": "Jan 21, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "3 weeks",
        "role": "Software Engineer",
        "details": "The first interview was through phone and it was mostly going through my resume, while trying to focus on the areas related to telecomunication and problem solvingThe second interview was a 3:30 hour long and was done by two people. It was a very technical interview, quesitons about C++, how to write functions ( recursion, deleting and adding to linked lists ) , microprocessor behaviour, registers, and they ask what…  I follow to stay up to date with the latest tech-related news",
        "questions": [
            "How to check the precision of the values registered in the hi and low parts of the register !  "
        ],
        "date": "Jan 9, 2013"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "2 technical rounds.1 HR round . .questions related to Data structures and algorithms were asked.Also some related to computer networks.Easy one, and an enjoyable experience .The interviewer made me feel comfortable.Overall a nice experience.2nd round was a bit challenging one. the initial aptitude test is an easy one covering basic aptitude and coding.",
        "questions": [
            "Merge sort,Quick sort , SYN,ACK,3-way handshake etc.  "
        ],
        "date": "Jun 14, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "There was a written test which had questions from aptitude, C, Data Structures, Operating Systems(Deadlocks), analog electronics and basic electronics. 150 people attended and 38 were shortlisted. Then there was technical interview and questions on C and operating systems were asked. shortlisted people had another technical interview and and questions from linked lists were asked. Then there was a HR interview just for formality.",
        "questions": [
            "Questions on linked list were only asked. They are easy :)  "
        ],
        "date": "Feb 20, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "number of intervies 1 written 2 technical and then technical and hr interview.interviewers were cool and supportive",
        "questions": [
            "computer network management  "
        ],
        "date": "Dec 13, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "Three interviews - one with the HR, one with three managers and one - with three employers from the team.",
        "questions": [
            "Questions were not difficult.  "
        ],
        "date": "Dec 12, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "campus recruitment. 2 technical 1 HR.",
        "questions": [
            "how to find when 2 linked lists are merged.  "
        ],
        "date": "Dec 7, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Cisco came to our college..- There was a written test of around 1-1.5 hrs. Questions were on Aptitude, Quant, Data Structures, C Programmng, Microprocessors, Communication Networks, Embedded Systems, Some semiconductor details were also asked. No negative marking .- 20-30 students were shortlisted for interview.  Interview Questions were :   He gave me a C Code and asked me to find errors in it Errors were due to passing by value and passing by…  reference types of args to functions..  - Difference between RISC and CISC type of architectures...  - Nyquist Sampling theorem  - Shannon's 2nd channel source coding theorem.  - Principles of CDMA operation/ encoding formulas etc.  - Questions related to Network layer in OSI Model. (IP DataGram etc.)  - Questions Related to Ethernet address and Broadcast routing.  - Questions related to domain name and DNS servers, NAT,DHCP etc..",
        "questions": [
            "About DNS Servers.. The interviwerer kept asking me questions about this topic  "
        ],
        "date": "Dec 26, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "A written test, which covers a vast number of topics ranging from transistors to operating systems. it is a multiple choice exam and followed by technical round of interview and a HR.Technical round is important and they mainly concentrated on algorithms and Data structures",
        "questions": [
            "give an algorithm/write a program to find out the intersection node in two linked lists, which are in a shape Y. given length of linked lists  "
        ],
        "date": "Oct 6, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Round 1: Written test. Which includes questions on fundamentals of electronics, communication, C language etc.Round 2: Technical interview-tested knowledge on C, digital electronics, wireless protocols etcRound 3: Technical interview- tested knowledge on algorithmsRound 4- HR interview",
        "questions": [
            "Q. Design mod-10 counter with optimal number of flip-flops?  ",
            "Q. Explain RSA algorithm and how it is different from symmetric key cyptographic algorithms?  "
        ],
        "date": "Feb 14, 2016"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Initial round of written test (aptitude and technical)3 technical rounds1 HR roundThis was a college hiring process.Had to prepare on Data strcutres, Networking, Alogirthms , Programming Langauges , OS , inux",
        "questions": [
            "Explain your previous projects  "
        ],
        "date": "Apr 11, 2016"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "6 weeks",
        "role": "Software Engineer",
        "details": "Good process and fair if followed correctly! Procedure driven and rather lengthy.",
        "questions": [],
        "date": "Nov 29, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Wirtten test will be very easy and then two rounds of interview one technical and other HR,technical round will be major elimination round",
        "questions": [],
        "date": "Nov 25, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "4+ weeks",
        "role": "Software Engineer",
        "details": "little tough and with several levels of interview you need to pass through...",
        "questions": [
            "how many lines are there in cisco logo... lol...  "
        ],
        "date": "Nov 6, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "written has objective questions and was pretty easy. they had come for campus placements to our campus.- there were 2 technical rounds and 1 hr.- first technical lasted approximately for 40mins. but mine was 1hour.- it wasnt very difficult, basic stuff was asked.- more on c , c++ and networking were asked",
        "questions": [
            "-static functions applications.  "
        ],
        "date": "Nov 2, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Easy Interview",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "Written test - 1, technical - 2, HR - 1",
        "questions": [
            "unexpected fundamentals of digital electronics like diode, transistors that are no where related to IT  "
        ],
        "date": "Oct 31, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "They have a good interview process but since hiring was going on at a very fast pace at the time I joined, I had troubles with interview setup, knowing about teams / job description etc.The interview consisted of a lot of questions on the projects done by me. There were very to the point questions based on C language and networking concepts.",
        "questions": [
            "none of the questions were too difficult and I was well prepared.  "
        ],
        "date": "Oct 26, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "2 Technical rounds and 1 HR. Technical round was mostly on networking on Java and Database questions. There were 4 to 5 people in the panel, Different department people have interviewed me.",
        "questions": [
            "Few networking questions and Java questions  "
        ],
        "date": "Sep 5, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Initial round was a written test consisting of 20 Aptitude and 30 Technical (Networks, Digital Logic mostly) questions. Next round was a Techhical Interview. Questions asked ranged from explaining about previous Projects undertaken to explaning some algorithms (search/sort etc). Some also involved about the programming language you were mostly familiar with (for ex: C). There were some questions on Networks, OSI layer, switches, routers etc. Math puzzles may be asked.…  Round following this would be HR.",
        "questions": [
            "Asking puzzle was a bit unexpected. It was the water jars puzzle.  "
        ],
        "date": "Sep 21, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "Round 1 was an Aptitude test and technical test. The topics asked were Digital Electronics, Microprocessors, basic C and certain apti questions. Some questions asked:1.Interrupts2.nmos, pmos channel length3.output displayRound 2 Interview : Technical Main focus on your coding skills. Also asked about computer networks. various protocols etc. How does a server work? What happens when you sign in on multiple browsers with different usernames. how this is achieved?",
        "questions": [
            "Fourier Transform, Fast Fourier Transform, Matlab  "
        ],
        "date": "Sep 8, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "The interview panel was very friendly . They made me comfortable and less tensed . The best thing about this company is that, if u have talent even though in some other field , not just software side ,they will hire you for sure. I have attended many interviews , but as far as i know this company interviewing method is the best",
        "questions": [
            "Explain the working of ping command ?? I am an ECE student , so this seemed a but difficult .  "
        ],
        "date": "Oct 6, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Easy Interview",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "Came on campus.Had a written round after the ppt. The written round consisted of around 15-20 aptitude, 15 electronics based questions, 15-20 C/DS/OS/Networking questions. In total there were 50 questions.Dint clear the written round. There were three rounds of interviews. The interviews are not very tough from what i heard.",
        "questions": [
            "Electronics questions were not expected in the written round.  "
        ],
        "date": "Aug 31, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "aptitude 20 + 30 technical questions in written test...technical interview was on C, basic electronics, microcontrollers, networkin related subjectsHR was simplw...",
        "questions": [
            "none... be well prepared...  "
        ],
        "date": "Aug 25, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "You will have 5 to 6 technical rounds. Then you will have to meet the manager if you are through. Mostly they will announce the results on the same day.Then you will be called for a HR round.",
        "questions": [
            "There were no difficult questions as such. They just test your basics in the interview and if you are well prepared you will get through.  "
        ],
        "date": "Aug 23, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "This was through the campus placements in my university. There was a written test first, from which around 40 people were selected for the next round.. then i had 2 technical interviews and one hr interview.. the details are as follows1) Written Test : had 20 aptitude and 30 technical questions.. aptitude had a lot of questions from permutations, combinations and probability.. technical had a mixture of os, microprocessor, digital…  electronics, c, comp arch etc..2) First Tech Interview : was asked to speak about my projects.. then few basic questions from networks.. like different protocols and their functions, layers etc.. was asked to code for a logical puzzle..3) Second Tech Interview : this was with a different panel.. again spoke about my projects.. then questions based on computer architecture (pipelining, interrupts etc), microprocessor (8085, 8051 based qns)4) HR interview : typical stuff.. tell me about urself.. talk about some non technical activity you have done in college.. strengths, weakness , family etc..",
        "questions": [
            "Explain the architecture being used in today's latest processors...  ",
            "What happens when you ping a device? explain at the layering level..  "
        ],
        "date": "Aug 31, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "written and interview",
        "questions": [
            "Design and write a code for a cyclic buffer used in routers.  "
        ],
        "date": "Apr 5, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "it was under campus placement.it consisted three rounds1. written test 15 aptitude ,15 Electronics, DCS topics based,15 c/c++ based questions2. technical round :- basic DS que like reversing a linked list, DLL to BST etc. OS and ACA will be pretty handy to crack it !!3. managerial round:- why cisco? future plans and project details",
        "questions": [
            "using pthread delete the linked list in optimized manner!!! buzz sigh...  "
        ],
        "date": "Jan 26, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "2-3 technical Interviews, 1 HR round. Interviewers were very friendly and comforting and dont let you feel nervous.First they gave presentations about working at Cisco and how can it be a career boost.Then we had our first interview round where some general questions about algorithm design were asked.Second interview was more about networking and its fundamentals, and some puzzles, which i was notable to solve.Usually people were having only two…  interviews, but i was the only one who had three interviews, where they asked me questons about graphs.Fourth was HR round, where he asked me general questions about working there at cisco.",
        "questions": [
            "even-though graph theory was to be taught in a course which was supposed to be studied after the interview process, but still they asked me to design djikstra's algo.  "
        ],
        "date": "Oct 11, 2015"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "Got the call by employee referral, Steps included phone interview, 5 1-1 interviews",
        "questions": [
            "Expected C programming questions, Operating Systems and Networking basics  "
        ],
        "date": "Jul 18, 2012"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "there were one written test of 1 hr comprising of 50 questions.20 questions from quantitative aptitude and LR 30 question from tech which consisted of digital electronics operating system digital communication (PCM) and some c questions.interview was of three rounds 1st was technical round C,DS,networking ,OS and digital electronics were asked.",
        "questions": [
            "XNOR to NOR gate  "
        ],
        "date": "Aug 10, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Average Interview",
        "difficulty": "-",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "1. Aptitude test with C program outputs2. GD3. Technical/HR Interview",
        "questions": [
            "Hardest problem was to reverse a linked list.  "
        ],
        "date": "Jul 17, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2+ months",
        "role": "Software Engineer",
        "details": "1. Telephonic round -- Brief discussion about my skillset and the requirement detail2. In depth Telephonic round - In depth discussion on the subject3. Face to Face round -- Formal managerial round4. HR round - Salary and other disscussion",
        "questions": [
            "About your last project in detail.  "
        ],
        "date": "May 27, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "We had a written round in college. There were around 50 questions which included questions from broad range of topics from C programming to networking. I was then called for an onsite interview which included 3 technical rounds, and a HR round. The questions mainly tested the knowledge in networking and algorithms. The questions were simple enough though.",
        "questions": [
            "Well most of the questions were quite simple if you had prepared well enough.  "
        ],
        "date": "Oct 27, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "I did my summer internship at Cisco this year, for Internship there were two telephonic rounds. First one was technical round, all questions were from Data Structures and Object Oriented Programming Principles; second round was an HR Round where they asked me about my interests, family, etc.During the internship I applied for Full time job, where they took one written round, which had 50 questions (20 Math/MAT, 30 Technical) and…  was supposed to be done in one hour. Technical questions were from Digital Electronics, Computer Architecture, and Microprocessors/Microcontrollers.After written round there were technical, manager and HR rounds. In Technical round they asked me questions from my Projects, Data Structures and Sockets, Manager round had few technical questions and brain teasers, and HR round had questions like why I want to join Cisco, etc.",
        "questions": [
            "Technical Round was ok, HR asked some tricky and direct questions like why I want to work for a company rather than joining my family business  "
        ],
        "date": "Jul 25, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "The interviewer (hiring manager) called me on time. At first he asked me to introduce my background, and then asked questions related with my background. Actually, there are about 12 qualifications in their job description in which 11 qualifications I am very strong on. However, finally he said the remaining 1 qualification (1 front end programming language) is critical for the job. So I knew there wouldn't be an offer.",
        "questions": [
            "Describe the singleton design pattern, and the factory pattern.  "
        ],
        "date": "Jun 16, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "Ask about couples of C and OS questions. (function pointer, const, static...etc)",
        "questions": [
            "What is different between static variable and global variable  "
        ],
        "date": "Jun 8, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Average Interview",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "I had a phone interview with general questions about my backgraound, the next round was a phone+web interview; the guy type programming questions and you fill out the designated space",
        "questions": [
            "Constructing, Sorting and reversing singly linked list, doubly linked list  "
        ],
        "date": "Oct 12, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2+ weeks",
        "role": "Software Engineer",
        "details": "I applied via employee referral. The process took 4+ weeks.I got a phone interview last about 30 mins, I was asked some projects I did in the past, and some general questions. Then, I did onsite interview.",
        "questions": [
            "some general data structure questions, such as sorting, searching, linked list.  "
        ],
        "date": "Jan 2, 2016"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "webex interview with mgr",
        "questions": [],
        "date": "Apr 29, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "The interview consisted of two technical and one HR round. First round was just a background check of the basic programming knowledge mainly all about c programming and datastructures. Second round included just one or two questions but were tricky. Finally the HR round which was just similar to other formal interviews",
        "questions": [
            "How to reverse a linked list?  ",
            "How to create linked list without using pointers?  "
        ],
        "date": "Jul 8, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "I first got a phone call and the my availability was asked after which a day for interview was fixed. interview lasted for around 50min. I was asked to code on a shared screen with webcam on. The interviewer was one of the member from the same team which had an open position.The interview started with a walk-through of my resume, and my interests. THe interviewer then narrated to me,…  what the team does.I was asked just one question and was allowed to code in the lang i preferred, though he told he would appreciate if it was C. I chose C itself as that was the language I was comfortable with. He put forward a problem which was more of a data-structure, design question and I tried solvin it slowly. He gave few tips me whenever and wherever i got stuck.It took 3 weeks, after which they responded with a reject.",
        "questions": [
            "If there are 1000 websites and 1000 users, write a program and Data-structure such that i can query for the followin at real time:1. Given any user, I get the list of all sites he/she has visited2. Given any website, I get the list of all users who have visited it.  "
        ],
        "date": "Jun 15, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "written test was the 1st round.they allotted 9to12 time slot for me.it was crowded and simply they were unable to handle the situation.atlast by 12.30pm we entered into the company.the question paper included questions from 4 sections1.logical reasoning and english 2.general aptitude and c pgm 3.networking(unix and linux commands)4.software testing basics.it was tough and they alloe=wed only 80 mins.",
        "questions": [
            "In the following code segment what will be the result of the function,value of x , value of y{unsigned int x=-1;int y;y = ~0;if(x == y)printf(\"same\");elseprintf(\"not same\");}  "
        ],
        "date": "Jun 6, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "I asked a friend at Cisco to pass on my resume. I got a phone call from a recruiter who asked me some questions about my experience and scheduled a screening interview.I then came in for a 1 hour interview, all technical questions not too difficult.That same day I was told I passed and we scheduled a full day on interviews.The interview day was made up out of 5 one…  hour interviews each with a different interviewer, one had an additional engineer observing the interview as part of their interview training process.",
        "questions": [
            "How would you implement the try/finally construct in C++?  "
        ],
        "date": "Feb 28, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "Very well planned interview and hiring process. We can use internal facilities during interview process. Interview will be based on your previous experience and some questions related to programming and OS.",
        "questions": [
            "What Cisco should expect from you and what are you expecting from Cisco?  "
        ],
        "date": "Jan 21, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "1+ week",
        "role": "Software Engineer",
        "details": "There was a telephonic screening round, after which there were 5 rounds of technial rounds.All of them are around C programming, data structure, networking , and problem solving.I would say its neither difficult nor easy. In all the rounds there was a puzzle asked.And datastructure questions involved linked lists and Trees.",
        "questions": [
            "None of it was so difficult.  "
        ],
        "date": "Mar 5, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Talked a little about myself and current projects.He then asked me to code up factorial. I did it recursively, he then asked me to do it iteratively.I coded it up perfect, and he said that was all the coding i needed to do.Not sure why they didnt ask me harder questions, especially since i did it perfectly and didnt get an offer. I was one of the first interviews of…  the day, so i think he may have under estimated the level or interviews he was giving or something.",
        "questions": [
            "Factorial?  ",
            "Factorial iteratively, since i did it recursively first?  "
        ],
        "date": "Feb 8, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "They had 3 rounds of personal interviews once I cleared the written test. First interview was totally based on computer Networks. He asked me some basic concepts of Networking. Second interview was based on my CV. He asked me few questions on data structures, about my projects etc. and the third was the HR interview and the main questions were why cisco? and would you like to go for masters…  or not??",
        "questions": [
            "HR question: your academic skills are excellent. Why don't you go for masters?? I would suggest you to go for masters!  "
        ],
        "date": "May 6, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "it was a campus recruitment. my interviewer was cool, gives you time to think, so don't be tensed.",
        "questions": [
            "How do you rotate a 8-bit integer?  ",
            "What is kernel/user mode  "
        ],
        "date": "May 14, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "I got hired on-campus. There was a written test first. Then, two-rounds of technical interview followed by a HR-interview. In the written, questions were from Computer Science, Mathematics, and Electronics. In the technical round, they asked me about the basics of C, OOP, data Structure, Operating Systems and Networking. In the HR round, general questions such as why do you want to join the company, etc.",
        "questions": [
            "Almost all the questions were on expected lines  "
        ],
        "date": "Oct 19, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Tele presence 4 to 5 rounds of interviewsnot very toughif you are coming from a good product company and a good institute it definitely helps.mostly technical.question based on C, operating system and networking.",
        "questions": [
            "Distributed Network Process management  "
        ],
        "date": "Dec 12, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Software Engineering",
        "details": "The interview was mainly behavioral in nature. We spoke about what was on my resume and I had explain some of my past projects and was then thrown a couple of cases to analyze and comment about.",
        "questions": [
            "Describe past incidents where you've had a conflict with co-workers and how you handled it.  "
        ],
        "date": "Oct 27, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "The recruiter was really nice and he just asked a puzzle. Given 8 balls, 7 of them is 10g and the 8th one is .9g, you can use a balance scale, how can you find the lighter ball if you can use the balance scale only two times. I think the puzzle is very common. But I have not solved it during the interview. Sorry about that.",
        "questions": [
            "Find the only lighter ball from 8 balls using a balance scale only two times.  "
        ],
        "date": "Sep 27, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "5 days",
        "role": "Software Engineer",
        "details": "Basics is expected from freshers",
        "questions": [
            "Everything will be simple if you are strong in basics  "
        ],
        "date": "Sep 21, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "Apti/Technical RoundTechnical interview - 2 roundsHR interview (could be telephonic)Be prepared with Basic C questions. Dont try to over expressive. Interviewers will help you to get the solution. Just be patient.Written test pattern changes with time. Just Google for the latest pattern. As far as mine was concerned it was a combination of Electronics(Digital)+C lang+Basic Apti ones.",
        "questions": [
            "Question on Dummy pointers and also volatile variables.  "
        ],
        "date": "Nov 25, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "3 days",
        "role": "Software Engineer",
        "details": "i was asked to come at 10 and interview took place for 3 days , first day was a general HR type of test and second day was the skill test and 3 was a day they were satisfied to map me to a project where i was asked my [reference to be in a software side and i declined and was later given business unit support team activities and…  was very happy with that .",
        "questions": [
            "Why did you use MANETs in your security detection systems?  ",
            "Where to you see yourself in 5 yrs ?  "
        ],
        "date": "Jul 11, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2+ weeks",
        "role": "Software Engineer",
        "details": "I got the news about the vacancy in this company online then applied for it.After which candidates were shortlisted on the percentage basis for written exam.Then there was selection on the basis of written exam for technical interview.After which there was final selection.Interview was in three round and with each round difficulty level increased but overall it was nice.",
        "questions": [
            "my background details.  ",
            "technical questions on networking  "
        ],
        "date": "Jun 26, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "1+ week",
        "role": "Software Engineer",
        "details": "phone interview, on-site one on one interview with lots of technical questions.",
        "questions": [
            "how to prevent looping in layer-3  "
        ],
        "date": "Aug 7, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Pretty simple interview yet thorough. All sorts of questions ranging from DSA to Networking to OS. (all basics, nothing fancy) A good resume helped.HR interview was quick, I guess the technical interview went well so they just quickly brushed it up.",
        "questions": [
            "Write code (on paper) to count number of words in a sentence.  "
        ],
        "date": "Apr 19, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "Flew candidates out to Cali. Went through three rounds of interviews 45 mins each. Went over what was on my resume, some basic programming questions like linked lists, and also some intelligence questions like how many weighs do you need to know what is the bad ball out of 8 balls.",
        "questions": [
            "how many scale measurements does it take to know which ball out of 8 balls weighs more? Then how many does 28 balls take?  "
        ],
        "date": "Feb 22, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "The first round was a shortlisting multi choice objective type test consisting of 50 questions. Half of them were general aptitude questions while the rest were from various fields like computer programming, microprocessors, database and basic electronics. Around 50 candidates were shortlisted. After that I had 3 rounds of 1:1 interviews. The first round was technical consisting of various questions from linked lists, threads, semaphores and a few basic networking…  questions. The next round was mainly a resume walk through where I was evaluated on my various projects and responsibilities and my strengths and weaknesses judged. The last round was a HR round and was more like an informal chat.",
        "questions": [
            "How would you code a stack using linked list?  "
        ],
        "date": "Apr 4, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "1+ week",
        "role": "Software Engineer",
        "details": "First phone interview with the hiring manager, then interview for like half a day with like 7 different people, mostly senior engineers and two managers. Lots of technical questions with the senior, so you better know your stuffs. The managers would ask you more about your past work experiences.",
        "questions": [
            "What is an interrupt routine?  "
        ],
        "date": "Sep 9, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "1. introduce myself2. review the resume3. the interviewer picked one of the project she was interested and talked more about it.4. some extra questions about personality.",
        "questions": [
            "why you didn't do this way...?  "
        ],
        "date": "Apr 6, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "I contacted a person inside cisco, whom I don't know.He reviewed my resume and contacted me to have a short phone interview.It was roughly 30 minutes long interview,he mainly asked questions oriented to software development, which I don't know much about.",
        "questions": [
            "How to efficiently implement log function using C?  "
        ],
        "date": "Jan 19, 2011"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "For screening they conduct a written test 50 Questions in total, 20 Aptitude types and 30 Engineering.In this 30 Questions 60% Electronics, and 40% in CS.After that 3 F2F Technical Interviews and 1 HR Interview.They will ask about your Projects.C,(In Depth)Data Structure(Mainly Trees and Linked List)Algorithm(Basic)OS(Baiscs More than Average.)Networking (Basics College Level)",
        "questions": [
            "Where is string constants stored in Memory?Ex: char * a = \"Hello\" ;  "
        ],
        "date": "Aug 7, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "On campus preliminary interview, waiting for result. Typical resume, coursework walkthrough. Short question on data structure and algorithm. A couple basic networking questions. Interviewer was very nice and helpful. There is an on-site 2nd round after.",
        "questions": [
            "What does a router do?  "
        ],
        "date": "Oct 13, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "3 weeks",
        "role": "Software Engineer",
        "details": "Very detailed and competitive interview process",
        "questions": [
            "Throwing egg from maximum floor such that it doesn't break  "
        ],
        "date": "Jun 19, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "I submitted the resume online on their web site. Also it was referred by an alumni from our university.In a 1 and a half hour interview.ask some c questions: like what is the functionality for a static variable and a static function in c. and write some c programs like binary searche.",
        "questions": [
            "what is the functionlity for a static variable and static function in c  "
        ],
        "date": "Jul 7, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "2 phone interviews and a full day of onsite interview. General programming questions, data structures, networking were asked.",
        "questions": [
            "Write code to see if a string is a sub string of another?  ",
            "What do you know about memory leaks in C?  "
        ],
        "date": "Mar 4, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2+ weeks",
        "role": "Software Engineer",
        "details": "The hiring manager called me up on phone and asked reasonable technical questions. Priority Invertion, Deadlock, Mutexes. Keep in mind that this was probably for a position which required very good OS concepts. I gave satisfactory answers and he arranged for a 1:1 the next week. The onsite interview had about 5 people. First one was hiring manager himnself. Gave a C test. Simple sorted array merging. I had rusty…  hands. Followed by another enginner who grilled me on OS concepts. How is executable format stored and loaded. Where are variables stored. How are interrupts handled etc. Majorly OS related stuff. Also recursion C questions. This was followed by another round of hard core questions on OS, threads and non amskable interrupts followed by a simple question on linked list. Need to know basics about datas tructures and algorithms. Which one is more efficient etc. After this a member from different team came by, asked some questions on my earlier work and another tree recursion program. This followed by the hiring manager of another team, asked basic question on my previous work and other problem solving scenarios when two processes are communicating with each other(IPCs). I was asked to come by for a second round after a week. The first 1:1 was difficult for me. Some questions on semaphores, mutexes. C programming question specifically targeting your knowledge of bitwise operators and memory management. Did not do so well. This followed by simple rounds by 2 other persons. Previous work. Multiple processor programming etc.. Overall, I probably needed more experience in the area that they wanted. Did not get the offer.",
        "questions": [
            "depth of a tree program  ",
            "common elements in two linked lists  "
        ],
        "date": "May 19, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "They asked general questions. Very meaningful interview to test your knowledge and aptitude. Very few tech questiosn",
        "questions": [
            "analytical  "
        ],
        "date": "Aug 17, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "was finished in a day, not at all tough.",
        "questions": [
            "DS related questions  "
        ],
        "date": "Jul 31, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "one round of written test, 1:1 and hr interviewwritten test contained questions on C , DS, OS and networkingTechnical interview started with basics and covered mostly on operating system concepts and networking concepts, ending with couple of questions on data structures",
        "questions": [
            "questions were simple and basics on networking and operating systems  "
        ],
        "date": "Jun 24, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Average Interview",
        "difficulty": "-",
        "length": "a week",
        "role": "Software Engineer",
        "details": "Cisco mainly look for your knowledge on networking side, and should be good in C/C++ or whichever language you're being interviewed for.Also you should be good on operating system concepts.",
        "questions": [
            "I didn't prepare much on networking when I went for the interview, so I found it difficult to answer some of the questions related to TCP/IP and networking.But I was able to question properly on C programming and all and was able to clear the interview.  "
        ],
        "date": "Oct 12, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "6 rounds of technical interview and 1 round of HR interview",
        "questions": [
            "questions related to EMS domain  "
        ],
        "date": "Nov 4, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Campus placements:1. Aptitude + Technical Test2. Tech Round 13. Tech Round 24. HR Round( Written text- Aptitude was ok-ok. Technical part included very few computer related questions.Mostly they were digital/analog electronics.Interview-I had only 1 Tech+1 HR .If you perform very well in tech round 1, you will have direct HR round.)",
        "questions": [
            "Design a system which should be able to create only one object instance at a time . No other object instances should be allowed to create.  "
        ],
        "date": "Oct 3, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "INterviewed by 3 people. ALL senior professionals. Pure technica... DS & Algo asked",
        "questions": [
            "Desging CE and CB circuit  "
        ],
        "date": "Oct 29, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "was very exciting to interview with them for this position. Hr was very helpful and really enjoyed the experience.",
        "questions": [
            "explain difference between tcp n udp?  "
        ],
        "date": "Nov 18, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 days",
        "role": "Software Engineer",
        "details": "There was a written test which had topics from the standard computer science subjects + some electronics basics like gates etc. Also mathematical/logic puzzles type qs.Shortlisted candidates had to go through one technical interview (2 interviewers) and one HR interview (1:1) In the tech interview apart from usual puzzles and cs qs, the stress was on networking concepts as well. HR interview was also pretty thorough",
        "questions": [
            "They asked to describe how a message from one computer system reaches another over the internet.  "
        ],
        "date": "Sep 1, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "5 days",
        "role": "Software Engineer",
        "details": "Had phone interview first where basic questions related to background wer asked. After that I was called for 1:1 interviews. There were 6 interviews ~30 mins each. Some were technical & some were more personality tests. Got an offer within a week. Salary was negotiable.",
        "questions": [
            "None of the questions asked were difficult or unexpcted.  "
        ],
        "date": "Aug 11, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Average Interview",
        "difficulty": "-",
        "length": "2+ weeks",
        "role": "Software Engineer",
        "details": "First a phone interview. Followed by 7 people interview 1:1 . There were questions about networking, previous company projects about design, programming questions.",
        "questions": [
            "Explain sliding window.  "
        ],
        "date": "Jul 18, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2+ weeks",
        "role": "Software Engineer",
        "details": "Employee referral, 1 telephonic interview and 3 personal interviews all technical. then one round of HR interview.Looked like a bunch of smart people who are proud to be with Cisco",
        "questions": [
            "They asked a few puzzles and C programming and data structures questions  "
        ],
        "date": "May 31, 2012"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "Phone call from Human resources to chat. Phone call from Human resources to set up interview time.Phone call from Human resources to confirm. conference call with interviewer.Phone call from Human resources to set up on site interview. 7-8 interviews on site. Exhausting and boring questions. Interview ended later than was set to and had little time to catch the plane.",
        "questions": [
            "Why do you want to work here as a software engineer?  "
        ],
        "date": "Jul 10, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Collage interview process it is simple.",
        "questions": [
            "more about C and data structure generic Q  ",
            "puzzle  "
        ],
        "date": "Jun 10, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "The interview process started with the on-campus screening interview. The questions were on data structure and on the projects I was working on. Then they invited me for the second round of on-site interview. The on-site interview took a whole day with three interviews and the lab tour. All interviews were technical questions and usual questions such as reverse the linked link, why do you want to work for Cisco.",
        "questions": [
            "How the watchdog timer is implemented?  "
        ],
        "date": "Jun 13, 2009"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "INterviewed by 3 people. ALL senior professionals. Pure technica... DS & Algo asked",
        "questions": [
            "Desging CE and CB circuit  "
        ],
        "date": "Oct 29, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "was very exciting to interview with them for this position. Hr was very helpful and really enjoyed the experience.",
        "questions": [
            "explain difference between tcp n udp?  "
        ],
        "date": "Nov 18, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 days",
        "role": "Software Engineer",
        "details": "There was a written test which had topics from the standard computer science subjects + some electronics basics like gates etc. Also mathematical/logic puzzles type qs.Shortlisted candidates had to go through one technical interview (2 interviewers) and one HR interview (1:1) In the tech interview apart from usual puzzles and cs qs, the stress was on networking concepts as well. HR interview was also pretty thorough",
        "questions": [
            "They asked to describe how a message from one computer system reaches another over the internet.  "
        ],
        "date": "Sep 1, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "5 days",
        "role": "Software Engineer",
        "details": "Had phone interview first where basic questions related to background wer asked. After that I was called for 1:1 interviews. There were 6 interviews ~30 mins each. Some were technical & some were more personality tests. Got an offer within a week. Salary was negotiable.",
        "questions": [
            "None of the questions asked were difficult or unexpcted.  "
        ],
        "date": "Aug 11, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Average Interview",
        "difficulty": "-",
        "length": "2+ weeks",
        "role": "Software Engineer",
        "details": "First a phone interview. Followed by 7 people interview 1:1 . There were questions about networking, previous company projects about design, programming questions.",
        "questions": [
            "Explain sliding window.  "
        ],
        "date": "Jul 18, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2+ weeks",
        "role": "Software Engineer",
        "details": "Employee referral, 1 telephonic interview and 3 personal interviews all technical. then one round of HR interview.Looked like a bunch of smart people who are proud to be with Cisco",
        "questions": [
            "They asked a few puzzles and C programming and data structures questions  "
        ],
        "date": "May 31, 2012"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "Phone call from Human resources to chat. Phone call from Human resources to set up interview time.Phone call from Human resources to confirm. conference call with interviewer.Phone call from Human resources to set up on site interview. 7-8 interviews on site. Exhausting and boring questions. Interview ended later than was set to and had little time to catch the plane.",
        "questions": [
            "Why do you want to work here as a software engineer?  "
        ],
        "date": "Jul 10, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Collage interview process it is simple.",
        "questions": [
            "more about C and data structure generic Q  ",
            "puzzle  "
        ],
        "date": "Jun 10, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "The interview process started with the on-campus screening interview. The questions were on data structure and on the projects I was working on. Then they invited me for the second round of on-site interview. The on-site interview took a whole day with three interviews and the lab tour. All interviews were technical questions and usual questions such as reverse the linked link, why do you want to work for Cisco.",
        "questions": [
            "How the watchdog timer is implemented?  "
        ],
        "date": "Jun 13, 2009"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "INterviewed by 3 people. ALL senior professionals. Pure technica... DS & Algo asked",
        "questions": [
            "Desging CE and CB circuit  "
        ],
        "date": "Oct 29, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "was very exciting to interview with them for this position. Hr was very helpful and really enjoyed the experience.",
        "questions": [
            "explain difference between tcp n udp?  "
        ],
        "date": "Nov 18, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 days",
        "role": "Software Engineer",
        "details": "There was a written test which had topics from the standard computer science subjects + some electronics basics like gates etc. Also mathematical/logic puzzles type qs.Shortlisted candidates had to go through one technical interview (2 interviewers) and one HR interview (1:1) In the tech interview apart from usual puzzles and cs qs, the stress was on networking concepts as well. HR interview was also pretty thorough",
        "questions": [
            "They asked to describe how a message from one computer system reaches another over the internet.  "
        ],
        "date": "Sep 1, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "5 days",
        "role": "Software Engineer",
        "details": "Had phone interview first where basic questions related to background wer asked. After that I was called for 1:1 interviews. There were 6 interviews ~30 mins each. Some were technical & some were more personality tests. Got an offer within a week. Salary was negotiable.",
        "questions": [
            "None of the questions asked were difficult or unexpcted.  "
        ],
        "date": "Aug 11, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Average Interview",
        "difficulty": "-",
        "length": "2+ weeks",
        "role": "Software Engineer",
        "details": "First a phone interview. Followed by 7 people interview 1:1 . There were questions about networking, previous company projects about design, programming questions.",
        "questions": [
            "Explain sliding window.  "
        ],
        "date": "Jul 18, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2+ weeks",
        "role": "Software Engineer",
        "details": "Employee referral, 1 telephonic interview and 3 personal interviews all technical. then one round of HR interview.Looked like a bunch of smart people who are proud to be with Cisco",
        "questions": [
            "They asked a few puzzles and C programming and data structures questions  "
        ],
        "date": "May 31, 2012"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "Phone call from Human resources to chat. Phone call from Human resources to set up interview time.Phone call from Human resources to confirm. conference call with interviewer.Phone call from Human resources to set up on site interview. 7-8 interviews on site. Exhausting and boring questions. Interview ended later than was set to and had little time to catch the plane.",
        "questions": [
            "Why do you want to work here as a software engineer?  "
        ],
        "date": "Jul 10, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Collage interview process it is simple.",
        "questions": [
            "more about C and data structure generic Q  ",
            "puzzle  "
        ],
        "date": "Jun 10, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "The interview process started with the on-campus screening interview. The questions were on data structure and on the projects I was working on. Then they invited me for the second round of on-site interview. The on-site interview took a whole day with three interviews and the lab tour. All interviews were technical questions and usual questions such as reverse the linked link, why do you want to work for Cisco.",
        "questions": [
            "How the watchdog timer is implemented?  "
        ],
        "date": "Jun 13, 2009"
    }
]