[
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "a week",
        "role": "Software Engineer",
        "details": "It is a Skype meeting and all behavior questions. In the very end I asked \"It seems a lot companies ask very technical questions but why Dell do this differently?\" He answered \"Since the technology changing very fast, and you GPA seems fine, so we did not ask for that\".",
        "questions": [
            "What is your past project?  ",
            "Do you like teamwork and how to overcome disagreement during teamwork?  ",
            "Why do you apply Dell?  "
        ],
        "date": "Nov 19, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Very quick interview. Interviewers were nice but hard to read. I don't believe they thought I was a good candidate from the start but I currently have no idea how the interview actually went.",
        "questions": [
            "Favorite sorting algorithm?  "
        ],
        "date": "Oct 3, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Software Engineer",
        "details": "Mainly behavioral. The interviewer asked me to code a simple program and then asked mainly about my undergraduate coursework and projects. He also asked some basic aptitude and logical questions which I answered correctly. It was a good interview but later they messaged me saying that there were no positions open as of now (which I found a bit strange).",
        "questions": [
            "Nothing specific. Asked me which software languages had I worked on and what courses have you taken.  "
        ],
        "date": "Oct 30, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Software Engineering",
        "details": "Invited to interview after attending speaking to a recruiter during my university career fair. I interviewed on my school's campus the following day and received an offer later that afternoon. Very quick process.",
        "questions": [
            "Tell me about one of your project experiences from your resume.  "
        ],
        "date": "Oct 6, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Easy Interview",
        "length": "2+ months",
        "role": "Software Engineer",
        "details": "Campus interview, applied through university career center.The interviewer was kind and patient. We talked about my past projects and he also asked some design pattern question. I think I did a good job but no response after the interview even though I emailed the recruiter twice. After 2 months, I received a short email saying they would not move forward my candidacy.",
        "questions": [
            "past project, design pattern  "
        ],
        "date": "Feb 24, 2015"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "5 days",
        "role": "Software Engineer",
        "details": "Apply on Dell job, had a on campus interview. Two engineering managers asked me questions about my project. Interviewing with Dell is honestly the best interview experience I've ever had. Much better than Google, Microsoft. The people who interviewed me made me feel like they really care, and they are actually trying to see if I am a good fit for a job in Dell. Overall it's a great experience",
        "questions": [
            "Nothing special, very easy question  "
        ],
        "date": "Nov 3, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "I was asked for technical interviews with two different groups, no HR part involved so far. Applied through university. Interview invitation sent by email. We got a free dinner (dell networking event) the night before interview day.",
        "questions": [
            "Basic data structure, string manipulation, pointers. Since I learned about these during freshmen year, I pretty much forgot most of these when I was interviewed. I didn't review because I thought first round should be HR, but I was wrong...  "
        ],
        "date": "Oct 13, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "2+ months",
        "role": "Software Engineer",
        "details": "The whole process takes an awful lot of time! 5 weeks and then a generic message saying it will take longer. Interview questions are easy. 2:1 for full time positions. There was a networking event the night before the interview was scheduled. Felt good to meet with the recruiters and talk to them about their experience working at Dell.",
        "questions": [
            "Mostly behavioral questions. The technical questions were related to data structures  "
        ],
        "date": "Nov 19, 2014"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Applied with my resume through the career center of my school. I honestly did expect they were going to call me, however somehow got an interview a or so week later. The interview took place at my University and was about 30 min. all technical questions. After that I received an offer a few weeks later.",
        "questions": [
            "Simple data structures questions (diff. between stack and a queue) and questions about my school projects  "
        ],
        "date": "May 8, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "Was flown in for college interviews along with 50 or so other people. First we were taken out on the town and treated to dinner. We spent the night on the Hyatt by the river, which was nice.On the day of the interview, we first talked to the HR recruiter, then we were interviewed in a large room where there were many hiring managers present. What happened next was very…  similar to speed dating.Each interviewee had an assigned seat, where they were interviewed by their assigned potential manager to be. Every 30 minutes, the managers would all rotate seats (musical chairs style) and talk to their next potential candidate.Each manager had hiring authority, so if one guy liked you, you were in. I had 3 interviews that day, so in theory could have gotten 3 separate offers.",
        "questions": [
            "The manager that hired me just wanted to know what I like to do on the weekends b/c my resume already showed that I had technical knowledge. Other managers asked me to tell them everything I knew about BIOS programming, which was zero.  "
        ],
        "date": "Nov 23, 2013"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Software Engineer",
        "details": "one phone interview asking all the details on the resume.get response inviting for onsite in one week.On site interview:interviewed with five engineers. All technical questions. not so difficult.",
        "questions": [
            "Linux kernel details  "
        ],
        "date": "Oct 27, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "6 weeks",
        "role": "Software Engineer",
        "details": "The interview process was lengthy and thorough. Interviews with several managers and technical leads. Asked questions about my experience and expertise. Met individually with each person on the interview panel. Some of the questions were very technical and some were just general interview questions on work experience and past employers.",
        "questions": [
            "What types of debug tools have you used?  "
        ],
        "date": "Aug 17, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "I was interviewed by an older hiring manager. The only thing resembling a technical interview was him asking me to rate myself on various programming languages. He then spent the rest of the time talking about how he was overbooked for the day and that he had lunch in my hometown once.",
        "questions": [
            "Rate yourself from 1-10 on &lt;insert programming language&gt;?  "
        ],
        "date": "Oct 25, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Was asked about previous work experience, about the details of the previous projects. Then was asked some general questions about object-oriented design and principles. Also, had several questions about algorithms and data structures, was asked about implementation of various trees. Then was asked about software development lifecycle.",
        "questions": [
            "Object-oriented design  ",
            "Algorithms and data structures  "
        ],
        "date": "Nov 4, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "I received a call for a phone screen 3-days after posting to a position. The manager did a skills interview and a review of the position. A week later a group interview was scheduled. First couple of interviewers were standard, with no goofy questions. The third interviewer was from another department that had absolutely no involvement with the group I was interviewing for, and he had no questions for me.…  I questioned him about his position and how this group would help his group, but he had no feedback. We spoke about the company culture and wrapped up the whole thing in 10 minutes. The third person would have been a peer. His stated concern was that this position was created to eliminate other positions in the department.",
        "questions": [
            "So you are here to eliminate our jobs?  ",
            "I don't work with these guys and have no idea what I am doing in this interview, so I don't have any questions for you.  "
        ],
        "date": "Apr 29, 2009"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "a week",
        "role": "Software Engineer",
        "details": "Was invited to on-site interview by a Recruiter.Got a paper exam on-site. I received an exam with no coding questions, only ordinary object oriented definition questions. Was asked about common data structure and design pattern. Included also theoretical multithreaded questions.Was told that my exam wil be revised together with other candidates answers and the best will be invited to the next round.",
        "questions": [
            "Describe composite design pattern  "
        ],
        "date": "Mar 7, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "2+ weeks",
        "role": "Software Engineer",
        "details": "4 rounds of interview two technical round ( telephonic & F2F), third is the Managerial and fourth is the Hr for salary negotiation and told offer letter will be rolled out in 2-3 days, after that they didn't turned simply waste of time,The whole interview process took 3 weeks.",
        "questions": [
            "Questions related to your resume  "
        ],
        "date": "Mar 11, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "This was a phone screening interview - the first stage in interview process. I was told that if I passed this stage than I would be called in for a face to face interview. I will know within a week if I have an opportunity to progress.",
        "questions": [
            "Why do you want to work for Dell?  "
        ],
        "date": "Nov 11, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "On campus ,one-aptitutde of english ,quant ,logical and dbms ,os ,ds questions2 techical interviews and one h r interview. Interviewer is quite good and friendly I messed up witheverything .I should have prepared more",
        "questions": [
            "resume  "
        ],
        "date": "Aug 30, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "The interview process started at 2pm and went on till 2am :( they went too slow at d start and started selecting people in a lackadaisical manner at the end. I didn't even get a chance to show my technical skills as the interviewer asked me only non technical topic and then rejected me",
        "questions": [
            "I was asked only non technical questions as it was getting late and they had a lot other people to interview  "
        ],
        "date": "Aug 1, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Software Engineer",
        "details": "1, Technical interview2.Technical interview 23. HR DiscussionIt was a good experience with lot of new learning.It was a good experience with lot of new learning.It was a good experience with lot of new learning.",
        "questions": [
            "Basic questions on DOtNet, Programming and OOPs  "
        ],
        "date": "Jun 25, 2015"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1+ week",
        "role": "Software Engineer",
        "details": "1 technical round,1 managerial,1 Hr Round, 1st technical round was a bit tricky but others were cakewalk. Managerial was to check the attitude and Hr was salary negociation.Mostly the checking the basics and skimming the resume and skills mentioned on it.",
        "questions": [
            "java basics , Boomi Integration scenario&amp;#039;s  "
        ],
        "date": "Jul 16, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Software Engineer",
        "details": "3 interviews1. Technical phone call. No problems, good casual conversation with the interviewer.2. Panel interview. Challenging interview, but seemed interesting. Tough but fair questions.3. Technical phone call with the head office. The interviewer was a half hour late and asked me frankly irritating and contradictory questions such as defining that I wouldn't be working with databases in this position, but then following that by a question about database joins.",
        "questions": [
            "Explain SOLID principles.  "
        ],
        "date": "Jun 3, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "i went through 3 subsuquent interview after one written test.i was quite smooth and well. HR and Managers are just Awsm and well behavioed people.they felt me very comfort.they are very humble",
        "questions": [
            "Some basic programming, swapping .Operating system,Logical question  "
        ],
        "date": "Mar 4, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "it went on two days first day they ask the basic c,c++ questioNs and the second day they asked the aptitude,logical reasoning AND they asked how to convert 20 digit no to 10 digit how will encrypt 20 digit number into a 10 digit and they ask few puzzles",
        "questions": [
            "what is semaphore..?? what is context switching..?? how to eliminate duplicates from array??  "
        ],
        "date": "Dec 15, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "Interview process for dell was simple.First round was telephonic technical round interview . Second round was skype round of interview with general managerial questions.Finally there was a basic HR interview before offering the letter.I was satisfied with the package offered.",
        "questions": [
            "nothing as such  "
        ],
        "date": "Nov 24, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Average Interview",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "Written test, followed by 3 technical rounds, 1 hr round. Written test was online, questions were from operating systems, software engineering, networks, computer architecture, aptitude. In technical rounds questions were to test your basic understanding of computer subjects, coding questions were asked.",
        "questions": [
            "a question based on assembly language code  "
        ],
        "date": "Apr 12, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Average Interview",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "interview consists of two rounds1st round written test. got selected in the written test.2nd round face to face interview. interview gone well but didn't got offer letter.",
        "questions": [
            "No such questions  "
        ],
        "date": "Jul 29, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4 weeks",
        "role": "Software Engineer",
        "details": "Through campus placement-written test-Technical round-Hr round",
        "questions": [
            "name parts Of CPU and their locations,installation of java,NERO software versions,RAM n ROM differences,Diff btw 32 bit and 64 bit, diff btw windows XP and 7  "
        ],
        "date": "Aug 28, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "3+ months",
        "role": "Software Engineer",
        "details": "All candidates go to classes for a couple months to gain the base required knowledge in Java, software testing and databases. After a month, candidates get to pick from a more specific track (advanced development, advanced testing or advanced database administration). When the classes are over, students take an exam and then are interviewed based on the track they chose. The interview is pretty straightforward: you are asked about your…  previous experiences (or lack thereof, which was not a problem), familiarity with agile methods, English language fluency.",
        "questions": [
            "Why did you choose the track you chose?  "
        ],
        "date": "Sep 23, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "It was an on-campus placement for M.E people. There was a direct technical interview round and then a HR round.Technical- mostly about strucures, linked lists, const char *p and char const *p difference, big endian and little endian, etc.",
        "questions": [
            "difference between \"const char *p\" and \"char const *p\"  "
        ],
        "date": "Mar 18, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Campus recruitment : Firstly there was a written test consisting C and Aptitude, then technical round and finally HR",
        "questions": [
            "Question was on general C and Operating Systems  "
        ],
        "date": "Jun 16, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "First round was aptitude. 3 sections quant, verbal, programming aptitude. each section has separate cutoff. Very few ppl could clear apti round due to sectional cutoff. verbal was easy. quant and prog moderate difficulty.Second round was technical 2:1 interview. Took an hour. Questions picked from technologies and skills mentioned in resume. General awareness questions (eg. on god particle, father of computer etc.). Asked to write program on fibbonacci series, quick…  sort. Asked various questions on project undertaken and to write few lines of code of the project.Final HR round had typical HR questions plus few puzzles. Be confident.",
        "questions": [
            "questions on general awareness  "
        ],
        "date": "Nov 3, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "IT was good and the questions were from SQL and Core Java, since i worked in the Java, J2EE Platform the questions were shooted from Core Java and J2EE. And few were from the PL/SQL.",
        "questions": [
            "There few algorithms and query optimizations questions shooted with few programs with optimization logics..  "
        ],
        "date": "Sep 24, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "6 days",
        "role": "Software Engineer",
        "details": "Aptitude, technical round where some programs are asked and logic was to be written and explained.Algorithms are generally asked to be explained Finally an hr round to discuss about the package.",
        "questions": [
            "general questions  "
        ],
        "date": "May 30, 2015"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Submitted ResumeSet up interview onlineInterview",
        "questions": [
            "Sum up integer array?  "
        ],
        "date": "Feb 18, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "fast and easy to the process. one day i made the interiwe by phone, i completed and answered all question, technical questions and normal question from your life. afterward i received by email the contract, I accepted offer and I began after 3 days.",
        "questions": [
            "is not so dificult  "
        ],
        "date": "Oct 15, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Initially asked about my projectthen asked few basic questions...",
        "questions": [
            "How to track back Subfile record position  "
        ],
        "date": "Jul 30, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "5 days",
        "role": "Software Engineer",
        "details": "I was selected and appeared for the Interview through campus placements . The first round was a written test with multiple C/C++ and Quant based questions.Second round was technical followed by a HR Interview",
        "questions": [
            "Questions mainly on projects we did in college  "
        ],
        "date": "Jan 27, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "The interview consisted of several rounds. Aptitude and other rounds.Technical round was the most interesting and finally the HR round to just tell you that you are through and we are happy to have you work for the organization. :)",
        "questions": [
            "analytical  "
        ],
        "date": "Jun 27, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "I joined Dell Services 2 years before through a Walk in Drive. First of all there was a written test that consist of 3 parts Technical, Logical Reasoning and English.Followed by that there were 2 rounds of interview which comprises of Technical, Logical Capability and mainly checking of your ability to cope up with difficult situation and presence of mind.",
        "questions": [
            "At what angle will you throw a ball so that it will come back to you?  "
        ],
        "date": "Jul 10, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Average Interview",
        "difficulty": "-",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "One online test very basic and one one interview with manager",
        "questions": [
            "Non  "
        ],
        "date": "Oct 28, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "3+ months",
        "role": "Software Engineer",
        "details": "Kind of OK OK. Not so great or bad.",
        "questions": [
            "Questions were more technical like How well do we know concepts in the technology  "
        ],
        "date": "Jul 5, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "3 days",
        "role": "Software Engineer",
        "details": "3 rounds, all were technical. At the end spent 15 mins with HR reg. sal.",
        "questions": [
            "IIS logs and management  "
        ],
        "date": "Dec 15, 2012"
    }
]