[
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "the interview was very friendly. the questions asked in the interview by the interviewer were questions that were mostly about basics of the field I was applying for, that you must already know was for software engineer. The interview which was for two hours was split into sections of 1 hour each. The 1st one hour was taken by one person, and the second hour was taken by another person.…  At the end of each interview session I was given opportunity to ask questions. This was great. strait forward. Technical. Data Structure Programming skills Algorithms Word Count Space",
        "questions": [
            "project workbasic questions on data structure  "
        ],
        "date": "Mar 5, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "a week",
        "role": "Software Engineer",
        "details": "First round was HR round, where mostly behavioral questions were asked, like, why you want to work for HP, Describe your favorite project etc. Then, second round was on-site, where 3 rounds were conducted. Mostly questions were based on Resume and projects discussion. Other questions were logical and behavioral.",
        "questions": [
            "Questions from resume  "
        ],
        "date": "Feb 2, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "submitted resume in career fair. was asked basic questions in java and networking and about the things written in resume.then got the call from the recruiting team. Next week they came to campus. Then had an interview for 1 hour. Then called to onsite interview.",
        "questions": [
            "asked basic java, networking questions and data structures and algorithms.  "
        ],
        "date": "Oct 31, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "It took 1 week. In one day I attended 3 calls. HR called me first asked few details about me, my status, Location preference, travel. Then Team Lead called me and It went 50 mins. Its a pure technical interview and then Manager called me and asked few technical questions and discussed about the team and project they are working on. Next day I got call from them confirming the…  job.",
        "questions": [
            "Server tuning, Performance issues, Profile usage KVM logs, Datasource connection issues, Identifying memory leaks. and many other technical questions.  "
        ],
        "date": "Nov 5, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "I interviewed with 3 engineers, a manager, and an HR person. I started with an interview at school. Then they flew me out onsite. The interview was an all day long process followed by dinner with the hiring manager. The interview was fairly standard based on other interviews I have done in the past.",
        "questions": [
            "They asked questions about previous projects.  "
        ],
        "date": "Jul 24, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "It started with a technical phone screen. Within few weeks, I was brought onsite for an one-on-one interview with the team and to meet with the manager. The interview lasted perhaps 1 hour and was technical.",
        "questions": [
            "Describe how Java Servlets work  "
        ],
        "date": "May 16, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "3 days",
        "role": "Software Engineer",
        "details": "Interview was a simple lunch meeting with the team. No hard technical questions were asked. The team asked about previous projects at school and how I would handle team based projects.",
        "questions": [
            "What do you want most out of this internship?  "
        ],
        "date": "Jun 2, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Software Engineer",
        "details": "Applied online. Contacted a week later. Set up phone call to describe the position and gauge my interest. Then set up phone interview 2 days later. Lasted about an hour.",
        "questions": [
            "Interface vs Abstract class. Just know OO basics.  "
        ],
        "date": "Mar 24, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "Took a week to start the hiring process. Scheduled phone interview after a week. Phone interview was easy. Asked a coding question and java technical skills. The whole interview experience was good. The interviewer was very particular on java fundamentals.",
        "questions": [
            "Java fundamentals, String related coding  "
        ],
        "date": "Apr 18, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Software Engineer",
        "details": "Applied through Career Fair, got a call from the senior software engineer in three weeks for a telephonic interview. he asked me about my projects and skills. Asked me about the availability and interested role.",
        "questions": [
            "All In-depth questions on Java and C++, Algorithms and problems solving without using standard libraries.  "
        ],
        "date": "Apr 15, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Software Engineer",
        "details": "The team manager called for a pre-qualifying interview, a combination of a minimum level of technical knowledge and soft skills. I was then invited on site, where I met with five other members of the team, one after another rather than facing a panel. Each team member had their own set of questions. Amongst them, they covered the entire final two years of the curriculum at my university. There were…  also more behavioral questions.At each stage, I was given the opportunity to ask my own questions.While the questioning was more comprehensive than any other interview I've had, the expectations were reasonable, and many questions were phrased so I could see direct applicability of my coursework to the project I'll be joining. When I didn't know something, they moved on without shaming me; when I did know, they'd probe to see how deeply I knew it.",
        "questions": [
            "What is a deadlock?  "
        ],
        "date": "Mar 23, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "2+ months",
        "role": "Software Engineering",
        "details": "I had interviews with Dell, Lockheed Martin and Microsoft last Winter and Hewlett-Packard's interview process was the best by far! There were only two interviews, the first was with an HR manager and a software engineer and the second was with a group of software engineers. Both conversations were very open and polite, They were much more interested in what I wanted to do more than what I could do…  for them",
        "questions": [
            "Where do you expect to be in five years? How do you approach testing complex software, and typical behavioral interview questions  "
        ],
        "date": "Jun 23, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "a week",
        "role": "Software Engineer",
        "details": "Phone interview and then asked to come in for on site interview...phone interview asked what inheritance was, the manager was nice, he said that he had worked for the company for a long time in new jersey...he did not seem to be very computer knowledgeable he was the product manager..",
        "questions": [
            "they showed me a java script and then had me decipher it  "
        ],
        "date": "Aug 3, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Average Interview",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "Applied through university career fair, and got the on-campus interview on the next day. I was waited for 35 mins after the original schedule time, then an Indian guy asked me about the basic knowledge of Java. After that, he asked me several brain teaser questions. The whole interview was no coding at all!!! Such a surprise.",
        "questions": [
            "Several brain teaser questions  "
        ],
        "date": "Jan 27, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "a week",
        "role": "Software Engineer",
        "details": "It was very laid back. It consisted of a number of phone calls then an on site interview batch. The phone calls were more about projects I did in the past and how those projects can scale. Then some simple pseudo code questions that's all.",
        "questions": [
            "print the items in a list that can contain lists (recursively)  "
        ],
        "date": "Oct 20, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1+ week",
        "role": "Software Engineer",
        "details": "Very minimal, very astonishing for a big company. Only phone interview. The company being big did not invest time and effort in the interview as they have a 6 month probation period and also can remove with few days if necessary. They prefer seeing person on job especially if at a client site and if client has no issues. The interview was mainly technical to match the client specifications. There…  was no verification of the resume other than a background check.",
        "questions": [
            "It was mostly technical and how many skills experienced in. No cognitive or team dynamics questions.  "
        ],
        "date": "Dec 3, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "2+ months",
        "role": "Software Engineer",
        "details": "I applied to this position as a new graduate (BS in computer science) few months before I got a call from a recruiter. She spoke to me and got inputs about my background and experience. Then I was called in to do a 2 hour coding test onsite at the Sunnyvale campus. You are left in a conference room alone with scratch paper and pens. There were 4 questions and…  it was all based on C and C++. A current software engineer will be administering the test by walking in every few mins to make sure everything is okay and to see if you have any questions. I took a picture of the test and I'm sharing the questions below.",
        "questions": [
            "Merge two sorted lists. You can choose the structure in which they are represented, and briefly state in the comments. You may rely on the two lists being sorted at the start.  ",
            "strncpy() is a function in the C standard library. Here is the description of it from the linux manual page:char * strncpy (char * destination, const char * source, size_t num);Copy characters from stringCopies the first num characters of source to destination. If the end of the source C string (which is signalled by a null character) is found before num characters have been copied, destination is padded with zeroes…  until a total number of num characters have been written to it.No null-character is implicitly appended at the end of the destination if source is longer than num. Thus, in this case, destination shall not be considered a null terminated C string (reading it as such would overflow).destination and source shall *not* overlap (see memmove for a safer alternative when overlapping)Return value: strncpy() function returns a pointer to the destination string dest.IMPLEMENT IT.  ",
            "Write an efficient function to return the number of days since the January 1st for the current year given the month (1-12) and day (1-31) as parameters (assume non leap year to keep it simple). Here's the function prototype:int DaysInYear (int month, int day);For example, DaysInYear (1,1) should return zero. April, June, September, and November has 30 days, February has 28 and the rest have 31 days.  ",
            "The operating system typically allocates memory in pages such that the base address of the page are 0, 4K, 8K etc. Given two addresses (pointers), write a function to find if two pointers are on the same page. Here's the function prototype:int AreOnSamePage (void * a, void * b);  "
        ],
        "date": "Nov 24, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "I got two skype interviews and one onsite interview. All of the interviews were very nice. They asked some basic questions on programming languages, algorithms, databases and computer systems.",
        "questions": [
            "Just some basic java knowledge, like the difference between HashMap and HashTable in Java.  "
        ],
        "date": "Nov 14, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "On Campus interview after I submitted my cv at the job fair. I was asked to appear for the interview the very next day. I was asked one technical question and other questions were about my past work.I talked about my masters thesis. I also talked about the past projects I had done when I worked for different companies. Some questions were asked about that work too. Like what is…  the goal of your thesis.",
        "questions": [
            "Given a string find the count of all the characters in the string.Given a file with comma separated values how will you read the data.  "
        ],
        "date": "Feb 18, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "I was contacted by the hiring manager via email about 1 week after giving them my resume at a university job fair. I then corresponded (via email) with a software engineer to set up a phone screening. We set aside an hour (but in the email he told me it should only take about half an hour). We began with some standard behavioral questions (tell me about a situation in…  which you disagreed with a coworker about how to solve a task, etc.). Then he asked me about some things on my resume (which language was my favorite and why, etc.). The next few questions were about software development (specifically interested in my understanding of agile programming and some of the benefits of agile over waterfall). Then came the more technical part of the interview. I was asked to tell him what I would ask a customer (to determine requirements) about a tic-tac-toe game they want me to make. Then I was asked what kind of design I would use and what languages I would use to do it in. Finally I was asked how I would test it. I thought the interviewer was very friendly and although I don't think I will get an invitation for an on-site interview (because the interview was based around web development which I don't have much experience in yet) it was one of the better phone screenings I've had (I've had non-technical people try to screen for technical positions which is a disaster).",
        "questions": [
            "What design pattern would you use to build tic-tac-toe web application?  "
        ],
        "date": "Oct 16, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "I applied through the job fair in my college and had an on campus interview. The interviewer is nice and questions are simple. The whole process is about 1 hour. I feel that the interviewer cares too much about my GPA, rather than my skill and capability.",
        "questions": [
            "no  "
        ],
        "date": "Nov 2, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "8 weeks",
        "role": "Software Engineer",
        "details": "Met at a career fair with a recruiter. It was a get to know you interview with some very basic conceptual questions. The interview lasted about 30 minutes and was not difficult at all.",
        "questions": [
            "What is inheritance?  "
        ],
        "date": "May 14, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "Phone interviews are not interesting by nature. Coordinating a call from west to east coast alone is painful, add the fact that phones just take away the benefits of body language, and just make it harder to hear, and you've got a recipe for disaster.phone interview and questions related to behavioral HR questions and some technical questions.",
        "questions": [
            "something related to thread  "
        ],
        "date": "Sep 25, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Average Interview",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "Phone interview. The interviewer is nice, I was ask a several basic programming questions first. And then a algorithm, then something on my resume, then asking some questions about the company. We share a link for easily typing words during the interview.No behavior questions.Nothing unusual expected. I definitely didn't get passed because I' not sure about some of the questions.",
        "questions": [],
        "date": "Sep 29, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "Contacted by e-mail by a recruiter, had a phone interview with a possible second interview. After keeping contact with the recruiter, I received an e-mail that I wasn't fit for the position.",
        "questions": [
            "What are your greatest weaknesses?  "
        ],
        "date": "Jan 20, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "On campus interview at a university. I was interviewed by two employees, an HP recruiter and an HP manager. They looked through my resume and derived behavioral questions from them. For example, \"Tell me about a time you had to deal with a difficult person?\" or \"What is your ideal job?\" ...etc.",
        "questions": [
            "\"Tell me about a time where you messed up or did something wrong?\"  "
        ],
        "date": "Jun 16, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Software Engineer",
        "details": "I applied to an open requisition and was contacted by an admin. We setup a one on one phone screen with the hiring manager. The team had a definite need and my skills were a direct fit. The phone screen largely consisted of a conversation about my work history. There was definitely personality probing happening. I was quickly contacted for a face to face interview. I arrived on site and…  was warmly welcomed and escorted to an meeting room. I had a series of one on one interviews with an engineer who would become my teammate, a developer who I would support and the hiring manager. The questions were focused on approaches to handling problems and ability to deal with changing parameters while problem solving. All the interviews were conducted with absolute professionalism. After the interviews I was told I'd be contacted shortly.Several days later the admin called me and extended an offer. I was happy with the offer and accepted.",
        "questions": [
            "\"What's your favorite design pattern?\" -- This was asked by the developer after we'd already had a conversation about software design approaches. I'm pragmatic and most of my experience is from application rather than books.  "
        ],
        "date": "Jun 5, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "a week",
        "role": "Software Engineer",
        "details": "first round was the on-campus interview, around 1 hour. The leader just ask about some basic java programming algorithms, and a designing question for OOdesign, and asked one my course project.second round was phone interview by HR, just some behavior questions, and talk about compensation.last was on-site, there're 7 rounds, 4 hours, each round is 30 minute, with one or two programming question and some question about jvm, operating system.…  the coding questions are easy, but I didn;t prepare too much for jvm internals...and I think this is optional, but they made me to prepare a presentation to discuss my master thesis, there're 6 developers on board and keep asking you questions..",
        "questions": [
            "how to divide an array to 3 stack, and any optimizations  ",
            "can you think of 5 scenarios that same program and same input, bu different output returned  "
        ],
        "date": "May 1, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Average Interview",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "Was asked to write algorithms for string manipulation, basic question on java script",
        "questions": [
            "No unexpected question.  "
        ],
        "date": "Apr 1, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "They didn't interview me at all. I was contacted by a staffing agency for a contract position based on a resume I had posted online. H-P needed a person with my skills; the staffing agency submitted my resume. Next thing I knew, I got a call from the agency saying that I was hired, and they gave me a start/report date.",
        "questions": [
            "There were no questions, since I wasn't interviewed.  "
        ],
        "date": "Mar 23, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2+ weeks",
        "role": "Software Engineer",
        "details": "I applied through my University job fair. I got a call for a initial phone screen with a HR who asked the usual question to judge you. Then I had a phone technical interview which was again focused on my basic technical knowledge. Then I had a onsite interview day where 4 people interviewed me one by on asking almost similar questions",
        "questions": [
            "Basic questions on Java.  "
        ],
        "date": "Oct 28, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "a week",
        "role": "Software Engineer",
        "details": "First is HR interview. Just want to make sure your resume and your skills. Second is technique interview. What is OOP,what is JAVA features and explain these. Muttiple thread questions. What is dead lock, how to solve that. DATABASE questions,like what difference between 3 kinds of join.",
        "questions": [
            "Because I apply the position is JAVA development position, I did not expect she could ask some questions about hibernate and spring MVC,so I did not answer very well.  "
        ],
        "date": "Jun 4, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 days",
        "role": "Software Engineer",
        "details": "I was contacted by a recruiting manager, who asked me about my preferences for a position.After the initial call, I got 1 HR call asking about the usual team-synergy stuff.The technical interview was over the phone, and with some general Data Structures questions, asked me to follow a link to a collaborative editing website, where I can write code and he can watch in real time. There were about 4…  different coding questions, not too difficult.",
        "questions": [
            "What is a deadlock? How does it apply to hardware.  "
        ],
        "date": "Mar 12, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "4+ months",
        "role": "Software Engineer",
        "details": "I was initially contacted by a recruiter who got my resume through the university portal. There was a short phone interview that was mostly behavioral, asking to tell about myself and things I've done. I was scheduled for an interview through the university, but because of snow it was conducted via phone. It was mostly about my professional interests, with a small bit of technical questioning. I am still waiting…  to hear back from them.",
        "questions": [
            "I was asked how you would sort an integer list from a file that was so large you couldn't hold the entire thing in an array.  "
        ],
        "date": "Feb 26, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Software Engineering",
        "details": "Phone call, then job offer extended. We talked about technical experience and challenges that I have overcome in programming projects in the past. After being extended an offer I began at the beginning of summer.",
        "questions": [
            "Basic technical experience questions, easy technical questions.  "
        ],
        "date": "Oct 14, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "Initial phone screening and one on one with 6 team members. Questions on algorithms, data structures, threading.Find the duplicate values in an array.String operations - substring, reverse.Is a given number palindrome?Tree search - Breadth first v/s depth first search.Explain a thread process and how to use it in a given scenario.",
        "questions": [
            "Interest level of writing white papers and the submission process.  "
        ],
        "date": "Jan 5, 2014"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Average Interview",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "First interview was on-site in the Chicago office. Talked to 3 people. Then had a phone interview with one of the heads of R&D a couple of weeks later. Received the offer a couple of weeks later. Everyone was nice and encouraging. Mostly behavioral questions for the on-site and technical questions for the phone interview.",
        "questions": [
            "What is the difference between merge sort and quick sort?  "
        ],
        "date": "Oct 15, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "First contact was with the hiring manager. Answered a few behavioral and basic technical questions over the phone. Established a time for a Skype interview. Skype interview involved the manager and several senior engineers. There were more basic behavioral and advanced technical questions. This was followed by a phone interview with an HR rep which I believe is just a formality.",
        "questions": [
            "Explain the architecture of the CPU.  "
        ],
        "date": "Oct 3, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "Theory concepts and design problems - not much coding",
        "questions": [],
        "date": "Sep 16, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "I was contacted by a hiring manager at HP for a position at HP Autonomy. I had a phone interview with the manager for some basic information. After that, I had an in person interview at my university campus during the Fall career fair.",
        "questions": [
            "Compare the performance between multicore and many core CPU ?  ",
            "Compare C++ and Java  "
        ],
        "date": "Jun 11, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Average Interview",
        "difficulty": "-",
        "length": "3 weeks",
        "role": "Software Engineer",
        "details": "My first interview was straight to the point. I was asked general programming questions. My second interview was behavioral and had questions about specific experiences. There have been two phone interviews and now I have an in person interview. I didn't get a response after my 2nd interview for a long time.",
        "questions": [
            "What is the hardest thing you have ever done?  "
        ],
        "date": "Sep 5, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "Met at career fair from University, hit it off. Got a phone call the same night, scheduled an interview for a few days later. I seemed to be a good fit for what they wanted, but I did not hear back from them. The interview was purely behavioral.",
        "questions": [
            "Most of the questions asked were quite straightforward. I did not have any particularly surprising or difficult questions. Overall they were behavioral though.  "
        ],
        "date": "Oct 7, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Average Interview",
        "difficulty": "-",
        "length": "4+ weeks",
        "role": "Software Engineer",
        "details": "Was referred through a professional contact and scheduled for interview almost immediately. Interview appeared to go well - did miss out on some technical details - as it was not my background. Interviewing team completely missed out on evaluating my strengths. Took forever to get interview feedback. In retrospect, I am happy I was not offered the position.",
        "questions": [
            "Something to do with Threads in Java  "
        ],
        "date": "Aug 11, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Software Engineer",
        "details": "1 on campus inter view with recruiter.2 phone interview         - one with manager - mostly behavioral question         - one with senior engineer - basic technical question: data structures, algorithms, oo design.1 onsite interview with the team         -test methodology         -several design question         -brain teaser         -oo design         -threading",
        "questions": [
            "-test methodology         -several design question         -brain teaser         -oo design         -threading  "
        ],
        "date": "Aug 12, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "a week",
        "role": "Software Engineer",
        "details": "Interview was a conference phone call interview with about 4 people. They spent 45 minutes asking fairly detailed technical questions about C, Unix, and SQL to make sure I actually knew that stuff. Plus I took online assessments in C and SQL so that they had fairly objective measures of my understanding of those. (I got high scores on both.) Then when I arrive at the job, it turns out…  that all of that is about 99% irrelevant. The job itself is mostly production support. Have to keep large batch data processing procedures that run day and night going. And almost no training in their overly complex and confusing technical/bureaucratic systems and controls. Training consisted of a two-hour session in a conference room where a senior technical person kept going \"Oh, and one more thing I forgot to mention. Oh, and here's something else I should have mentioned already.\" There is extensive online (on their internal network) documentation and training materials for this project, however most of it is from years ago and is completely out of date and inaccurate. Communication is done almost entirely through PCs (IMs and E-mail through their internal network) and conference phone calls. This is largely because about half of my immediate team (4 out of 8 people) are not located here but in other cities and states. Even people who sit in adjacent cubicles usually communicate electronically rather than talking face-to-face. My own cubicle feels like a solitary confinement cell in a prison. I am a contractor who is paid by the hour, and not much, either. As a contractor I get paid only for time that I'm physically in the office (even though regular employees work remotely or from home over the Internet all the time). I get no time off (when there is a day off for a holiday I have to work extra long shifts the rest of the week to make up my billable hours) and no benefits, and still have to be available to support production runs 24/7, which makes it hard to look for other employment or take a part-time job or or take a training class off-hours (since I can be be interrupted by a phone call about a production glitch at any time), not to mention the effect this schedule has on one's family life. I do not get any feeling that I am contributing to anything that matters in the long run. The only motivation is not to screw up so as to at least keep the paychecks coming.",
        "questions": [
            "How the batch jobs run (e.g. how input files get to where they appear, what naming conventions are, etc.) is extremely confusing and unexplained. Same for the system to develop, test, and install new software or changes to software. Everyone acts like it's so obvious that it needs no explanation (even though it is extremely confusing to newcomers), plus they are so busy that no one has time to be…  bothered.  "
        ],
        "date": "Sep 10, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "Met current manager at career fair. Talked to her and her colleague for a few minutes, she encouraged me to apply for an internship to work for her. Interviewed with her the next day. Overall positive experience, took a few weeks to hear back. After internship was over, was offered a full-time position.",
        "questions": [
            "Basic questions about development experience, knowledge about the company, etc. Nothing too technical or difficult.  "
        ],
        "date": "Jan 16, 2016"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "initial phone screen followed by an interview by 4 people.Except for 2 engineers, other two engineers did not have a clue. Far less experienced. Initial phone screen by the manager simply explained the product background etc. This was followed by a team interview, after almost 2-3 weeks' delay.",
        "questions": [
            "Some networking related questions. Some programming questions.  "
        ],
        "date": "Feb 8, 2016"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "6 days",
        "role": "Software Engineer",
        "details": "Technically Phone interview with 3 engineers. Each focused on one area and technology related to the job. Asked to describe approach, algorithm, data structures, etc. each 1:1 interview was about one hour.",
        "questions": [
            "Can you describe how to tell if Pi 3.14159265...... includes a given number sequence, like 6783356?  "
        ],
        "date": "Sep 7, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "I had two rounds of phone interview. The first round covered mostly basic algorithm questions on trees and other data structures like stacks, queues etc. i choose C# so lot of questions asked on C#.NET. Also lot of questions from Object oriented programming stuff as well",
        "questions": [
            "How to automate testing? Explain a real time scenario in your previous projects.  "
        ],
        "date": "Jul 27, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1+ week",
        "role": "Software Engineer",
        "details": "Phone screen by a manager, onsite interview with 2 people who are an engineer and a senior manager. Phone interview was done by a group of managers who are interested in my resume. One of them is to proceed further if interested, Onsite interview was set a few days later. It took about 1 ~ 2 hours. It was a medium level of technical questions.",
        "questions": [
            "Describe the design patterns  "
        ],
        "date": "Jul 31, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "Phone interview first if your selected from your resume, make sure to post any project details in your resume and how the app worked this helps get your first call. person to person interview consists of two developers maybe a project manager and direct team leader or manager of that team.",
        "questions": [
            "Describe the project you&amp;#039;ve worked on that you&amp;#039;re most proud of. What did you do that worked out particularly well?”Describe the project you&amp;#039;ve worked on that you&amp;#039;re least proud of. What would you do differently?”  "
        ],
        "date": "Sep 3, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "There was an informal phone interview, a technical phone interview then an onsite technical interview. The phone interview was very pleasant since the conversation was casual and the interviewer wanted to get to know me as a person and my background. At the end of that interview the person told me somebody would be contacting me about for a technical phone interview. That was more formal and consisted of only…  technical questions. Then I had the onsite interview where 4-5 different people asked me essentially the same questions, which I've written below. It was like an oral exam and became annoying.",
        "questions": [
            "There were four interviewers who went through the same types of questions: several short answer and one to two \"write a method that does\" this.  "
        ],
        "date": "Nov 23, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Software Engineer",
        "details": "I originally handed them my resume at a university job faire. I was then invited to a brief interview the next day. It was short and we just quickly went over my resume, and they asked some question about JAVA and development to get an idea on my experience and knowledge. I was then later invited to another interview on location done by some other team members to get to…  know me more. I was offered a position about a week later. From start to finish, it was just under a month.",
        "questions": [
            "Questions on polymorphism and singletons.  "
        ],
        "date": "Aug 17, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "3 rounds of interviews all on the same day. All of them based on C, C++ and algorithms. Final round was based on just logic. Got offer. Excellent work culture and very good experience.",
        "questions": [
            "Logic based question.  "
        ],
        "date": "Nov 4, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Software Engineer",
        "details": "Started with phone call. Then there was a telephone interview with a personnel person. They asked the typical interview questions about previous background and past jobs and what I was looking for in the position. I interviewed at the location with the hiring manager and several sw engineers. It was a pretty standard interview. General technical questions and much discussion about previous job experiences. I cannot remember any specific coding…  questions.",
        "questions": [
            "I cannot remember a specific question about coding. It was more about my background.  "
        ],
        "date": "Mar 13, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "3 days",
        "role": "Software Engineer",
        "details": "Interview process began with a phone interview. After that, a full day onsite interview was conducted.",
        "questions": [],
        "date": "Sep 30, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "I met with HP at the career fair. The interview consisted of mostly technical questions from a computer science and computer engineering standpoint. I suggest reviewing some programming in C and also simple state machines and digital logic questions.",
        "questions": [
            "What is the purpose of this circuit. (A D flip flop with Q not connected back to the input, and Clk connected to Clk)  "
        ],
        "date": "Feb 17, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "1+ week",
        "role": "Software Engineer",
        "details": "Describe your most challenging project. Time complexity again, balancing binary trees, find the depth of a tree.",
        "questions": [
            "On-site interview: Describe your most challenging project. Time complexity again, balancing binary trees, find the depth of a tree.  "
        ],
        "date": "Apr 20, 2010"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "Applied online through college career site. Had a phone interview about a week later with one of the managers. It was mostly behavioral, but some technical questions. I was invited to another phone interview with the actual hiring manager for the position soon after. HP's interview process is kind of strange because you have a phone interview with someone, and then if they like you, they tell you to apply…  to the Req's you like online... and that they'll be your \"representative\" and go talk to the actual hiring manager for you. Anyway, I had a phone interview with the hiring manager, it was half technical and half behavioral. I received an offer without visiting the office onsite.",
        "questions": [
            "Why are you interested in HP?  "
        ],
        "date": "Apr 13, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "I interviewed with my manager, the guy who I'd be replacing (he was retiring) and another manager.I was mostly asked questions related to the job I'd be doing. The guy I was replacing asked my suggestion in how I'd implement software versioning in build code. I guess he liked my answer enough for me to get the job offer.The hardest part of the interview was with the other manager. He…  asked some difficult behavioral-type questions. At this point, I don't remember what those questions were. But I got the job anyways.",
        "questions": [
            "In writing build scripts, how would you add versioning to the C# DLLs and executables produced?  "
        ],
        "date": "May 14, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Two phone interviews before the on-site interview. It took all day for the on-site interview. There were 4 subsets interviews. The hiring manager and three other staff. They asked general questions such as what was my gaol and the technique questions including writing a short program and correcting the bugs.",
        "questions": [
            "How to delet a link list with C++? What's is the most efficient way to solve the problem?  "
        ],
        "date": "Jul 20, 2010"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "a week",
        "role": "Software Engineer",
        "details": "I am an internal candidate that is on the WFR list. I was called for a position in texas but it was not a good fit.",
        "questions": [
            "What is the difference between Java and C++?  "
        ],
        "date": "May 5, 2009"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "A few technical questions... Testing methodologies. Software design methods. Favorite programming language. Took a few days for them to send out the official offer letter. Offer was competitive. Did include a high salary, signing bonus, full relocation. A few technical questions... Testing methodologies. Software design methods. Favorite programming language. Took a few days for them to send out the official offer letter. Offer was competitive. Did include a high salary,…  signing bonus, full relocation. A few technical questions... Testing methodologies. Software design methods. Favorite programming language. Took a few days for them to send out the official offer letter. Offer was competitive. Did include a high salary, signing bonus, full relocation. A few technical questions... Testing methodologies. Software design methods. Favorite programming language. Took a few days for them to send out the official offer letter. Offer was competitive. Did include a high salary, signing bonus, full relocation.",
        "questions": [
            "What is test-driven development?  "
        ],
        "date": "Apr 18, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "1+ week",
        "role": "Software Engineer",
        "details": "The interview is for a software development position in the storage business. It consists two one on one interview with your future managers and 3 technical interviews, each with two of your future colleagues. The interviews have a lot of technical questions as well as personality questions. Kind of makes you feel how serious they took it. I did get the offer in the end but it was the most…  official interview process i have gone thru.",
        "questions": [
            "Gave you a question and 6 UML diagram, the question is which design is most suitable and flexible for future expansion. They keep adding new requirements to see how familiar you are with UML and OO.  "
        ],
        "date": "May 29, 2009"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "interviewed for a software engineer positionInterview consisted of design pattern questions, java questions, and analytical questions.If you know your basics you should have no problem with answering the questions.Interview took half of the day and consisted of 4-5 separate short interviews.",
        "questions": [
            "Find a missing integer on an array that has 10000 numbers unsorted  "
        ],
        "date": "Oct 1, 2009"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "1+ week",
        "role": "Software Engineer",
        "details": "The interview process was simple and question asked where also easy.The director round was fun though.But sometimes you will find interviewers who are really tough and getting through them will be challenging",
        "questions": [
            "more on System Programming, C and Linux  "
        ],
        "date": "Feb 28, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "There are about two rounds, the first is written examination with two parts. First part is basic C knowledge and the second part is about real-time system.The second round is interviewed by team manger and a team member. They will ask you basic question and decide whether u could get into next round.",
        "questions": [
            "1.Please brief introduce yourself.2.Tell me your projects in your CV with details.  "
        ],
        "date": "Apr 8, 2016"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Software Engineer",
        "details": "phone interview and on-site interview, general questions and experience about the previous projects, some technical questions and behavioral questions. phone interview and on-site interview, general questions and experience about the previous projects, some technical questions and behavioral questions.phone interview and on-site interview, general questions and experience about the previous projects, some technical questions and behavioral questions.",
        "questions": [
            "soft skills with customer support  "
        ],
        "date": "Oct 16, 2015"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Aptitude test followed by Program Execution round followed by Technical and Finally HR, The first round contains the general aptitude including train, Blood relation, time and distance and number systems.",
        "questions": [
            "How many types of Cartesian Product in SQL available?Types of Inheritance?Interfaces?  "
        ],
        "date": "Dec 14, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "There was a test- had questions on general aptitude, coding, networking, Operating Systems, Data Structures. It was an MCQ test of 1 and half hr with sectional time limits with no negative marking. Aptitude was a bit tough and lengthy.",
        "questions": [
            "He asked about few puzzles- 1: you have 5 litre milk can and 3 litre milk can now you want to have 4 litres in a milk can2: 3 boxes that have apples oranges and mixture of both in another box but you label them incorrectly now you can take atmost 1 fruit from a box. Label these boxes correctly3: Gave me a triangle and asked me to create 4…  triangles of equal area4: Asked questions about compilers, Threadings, Semaphores  "
        ],
        "date": "Jan 0, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "I was a fresh graduate and I attended their fast track event for university hiring.t was a very light interview, the HR asked some o the basic questions such as shifting schedule and afterwards, some behavioral questions.",
        "questions": [
            "Why HP needs you?  "
        ],
        "date": "Sep 1, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "The hiring process was about 2 weeks, it was fast because the project was under fire. There are 5 interview questions, all of them are about logical and math questions to test your thinking. After you has passed the test, there would be another round of interview, It was HR interview.",
        "questions": [
            "how to count to the height of the buildings, provide at least 5 ways  "
        ],
        "date": "Aug 26, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "-",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Cleared the intial online mcq round. Consisted of 3 parts, 1)Technical - where they asked questions pertaining to Operating Systems, Networking etc. 2)Aptitude - math and puzzles. 3) Coding - you pick a language of your choice and there is code given, you have to pick the correct output or identify the error etc.",
        "questions": [
            "The interview was very theoretical. Asked about difference between mutex and binary semaphore. How ping works in the background, difference between router and switch.  "
        ],
        "date": "Aug 31, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Process is simple.But had to wait for long time which is unnecessary.There is no proper procedure has been followed.It happned as first come first serve basis. The result is fully based on the intrviewer that you go.",
        "questions": [
            "Current projects  "
        ],
        "date": "Jul 21, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Software Engineer",
        "details": "I was a fresh graduate and I attended their fast track event for university hiring.t was a very light interview, the HR asked some o the basic questions such as shifting schedule and afterwards, some behavioral questions.",
        "questions": [
            "Why HP needs you?  "
        ],
        "date": "Jul 23, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "I applied on one of their online portals and got my interview scheduled. First round was a face to face. The interviewer asked me couple of question which I answered correctly and then what happened is mentioned ahead.",
        "questions": [
            "difference between a java war file and a spring war file ?  "
        ],
        "date": "May 4, 2015"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Software Engineer",
        "details": "Got contacted by email by a hiring manager, asked for a good time to have a conversation over the phone. He asked the usual stuff about past experience and type of work I was looking for. After that, someone else contacted me over the phone with screening questions. I was contacted again by the hiring manager to schedule an on-site interview. The on-site interview took about four hours, and I…  talked with two engineers and two managers, about one hour each. The first three interviews were simple programming questions and a couple of programming exercises and the last one was about dealing with different work situations. One of the managers was playing a game of \"tell me what I'm thinking\" with me, this was very annoying. The two engineers were good but nothing extraordinary, asking very basic questions.",
        "questions": [
            "What's the difference between a class and an object?  ",
            "What's the difference between the stack and the heap?  ",
            "Basic function overloading  ",
            "What is a tree, what is a balanced tree, what is an unbalanced tree?  ",
            "How can you share information between two programs?  "
        ],
        "date": "May 23, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "The interview consisted of 5 rounds - 1.JAM, 2.Written Test, 3.Technical round, 4.Managerial round, 5.HR round..1.JAM : 1st round was an easy round , you need to talk about any topic for one minute , their will be less elimination in this round2.written test : 2nd round included 20 marks aptitude questions and remaining 35 were from C,C++,DBMS..if you are good in C,C++,DBMS you can easily clear this round ..their…  was mass elimination in this round3.Technical Round : In this round they asked C,C++,JAVA,DBMS and some core related questions4.Managerial Round: In this round they mainly asked about our Project work5.HR round: This round was the easiest of all they asked general HR questions to test our communication skills",
        "questions": [
            "Q. Tell me the difference between C & C++?  "
        ],
        "date": "Mar 5, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "I attended HP off campus in Hyderabad.First round was written test. This is a bit difficult than the following rounds. It contains 3 sections.1. Aptitude(maths and logical) - 10 questions2. English - 10 questions3. Technical (C,C++,SQL) - 35 questionsFor the written test follow any book for aptitude and English. As for technical focus more on C, C++ and SQL . Practice topics like bitwise operators and bit shifting. For C++…  don't leave anything follow any book( I forgot to work out templates and there were questions on this) and basic SQL queries.Now luckily I passed the written test and the next round was technical interview. He asked me questions on my project and some basic questions on java and the skills I put on my resume. After 1 hour I was pushed to next round.HR is the final round and they will ask questions on relocation and verify your marks and basic questions on personality. They are very friendly but try to keep the conversation as professional as possible.",
        "questions": [
            "what are oops concepts.  "
        ],
        "date": "Feb 22, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "5 roundstechnical written all subject wisegDtechnical interview 1 based on c and DStechnical interview 2 based on dbms and Oshr interview followed by document verificationoffer was released after 1 month as it was campus hiring and joining letter once issued after completion of degree",
        "questions": [
            "Write the code for binary searchcreate a password less authentication ssh  "
        ],
        "date": "Feb 21, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "I have applied through college/university. The selection process includes aptitude and technical(combination) followed by technical/Hr interviews. In this first round, there were total of 55 questions 12-Quantitative/Logical,8- verbal and 35 technical and time allocated for 55 questions was 75 minutes. This was most difficult round that i have ever seen. The reason was to be made it difficult C coding or programs that was far away from the expectations. Guys…  you need to be very good in c if you want to clear 1st round in HP.",
        "questions": [
            "They mostly asked questions in technical section from C code snippet or programs  "
        ],
        "date": "Mar 25, 2015"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "Applied via some reference, walk-in interview.. Around 1200 people attendedthere were four rounds1 written round (general BTech Computer Science stuff, os, networking, ds, algo)Tech Round 1(OS, Data Structures)Tech Round 2(On- Resume Project Details)HR Round",
        "questions": [],
        "date": "Jan 6, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "First round was written and it consisted of quant + English + technical. The technical question were from c, mainly for operators and C++ and DBMS.After clearing the it immediately it was technical interview.The questions were from the topics mentioned in resume.Study well...Tell about yurselfWhat is PolymorphismAll basic",
        "questions": [
            "Tell about yurselfWhat is PolymorphismAll basic  "
        ],
        "date": "Feb 25, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "2 parts; first one is a personal interview, asking you to write an answer for several questions ( 20 min)second part was more logical questions and algorithms, questions about network stuffs: DNS, TCP\\IP\\HTTP\\SSL\\OSI\\telnet\\Router\\Hub\\database\\LAN\\WAN",
        "questions": [
            "find the minimum times you need to find a different ball among other 149 (the 149 are the same weight)using a scale.  "
        ],
        "date": "Aug 28, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "Hello everyone, this is one of my friend's experience...In HP there are four rounds.1. Aptitude.2. Technical HR.3. Managerial HR.4. Personal HR.1) Aptitude Round :- Nearly 6000 candidates were attended the interview process for First round in Written test- There are 55 mcq.- 12 from maths.- 8 from English.- 35 from Technical (C, C++, DBMS).- Only 600 candidates were cleared this round.2) Technical HR :HR: Hi, how are you?Me: Fine sir,…  What about you?HR: Fine. Tell me about yourself.Me: said.HR: What is difference b/w Structure and Union?Me: Said.HR: What are the storage classes in C?Me: Auto, Register, Extern, Static.HR: Ok, i'll give a program show me the output.Me: Said.HR: Write a program for Sorting an Array.Me: Wrote.HR: What is the time complexity of this program.Me: Said.The he goes to OOPS concepts.HR: What are the methods available in a class.Me: Said only 3 methods.HR: There are 5 methods it's ok. How do call the constructor in c++;Me: Delete method.HR: What is the difference b/w free() and delete().Me: Told and i said i'm not strong in C++ but i'm strong in Java.HR: Ok, what is final, finally, finalize?Me: Said.HR: Write a program for Overriding.Me: Wrote.HR: what is Runtime polymorphism.Me: Overriding sir.HR: You are good in Java but you need to be strong in C and C++. Are you compatible with any language?Me: yes sir.HR: You are cleared this round i'm moving you to next round all d best.Me: Thanks sir.3) Managerial HR :In this round they asked me in projects, they I'll give a situation you need to handle this.He asked about my family.4) Personal HR :It's just for formality.HR: Tell me about your native?Me: Said.I hope you clear the interview.",
        "questions": [
            "The technical question on C and C++ in written test were quite tough.  "
        ],
        "date": "Nov 12, 2014"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "3 days",
        "role": "Software Engineer",
        "details": "The process begin with a presentation where they told everyone about the company, it was a university pool placement so there were about 16000 people for the job.After the presentation there was a written test, which was fairly simple, consisted of 55 questions, 12 from Quantitative Ability, 8 from English, 6-7 of Database and rest of them were C programming.After the written test few were selected for the Technical Interview…  and in the end there was a HR interview, both were fairly simple.",
        "questions": [
            "All the questions were pretty basic and should be easy to answer  "
        ],
        "date": "Oct 22, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Easy Interview",
        "length": "a week",
        "role": "Software Engineer",
        "details": "Applied through 104 Taiwan website. Contacted via email for a brief interview with the manager (no hr). The interview was 15min; talked about previous experience, no interview questions. The manager said he will reply within a week but no response after 1+week. I followed up with an email, still no response",
        "questions": [],
        "date": "Oct 27, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "Staffing agency found me and introduce me to HP, I am not applying to this job originally. But the offer is attractive. There is only 1 interview at HP facility. 1:1 interview with the principal engineer. I think he will be my future manager as well. He asked a lots of technical question to test out my fundamental understanding and algorithm of programming (especially in Perl). Also asked about my…  working experiences. I have a very good experience in this interview session, very impress with the interviewer.",
        "questions": [
            "Algorithm of programming.  "
        ],
        "date": "Nov 4, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "written test, technical interview , HR. written is based on 2 sections one is aptitude, another is techical technical interview they asked to write programs also be prepared, c with data structures,java,small programs but logical ones.",
        "questions": [
            "writing a quiery  "
        ],
        "date": "Sep 12, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "After giving out my resume in person, I was contacted by email to schedule an in person interview. I was also asked to submit my profile and apply online on HP's job website. The interview lasted 50 minutes or so. The interview was mostly going over my resume and talking about my experience and skills.",
        "questions": [
            "There was no unexpected or technical question other than what was on my resume.  "
        ],
        "date": "Oct 4, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "1. aptitude(normal questions u can solve and 5 programs u can solve in c or java)    programs are average2. technical 2 rounds(c arrays,while loops and projects)3. hr round(normal as usual)l",
        "questions": [
            "implement stack using queues  "
        ],
        "date": "Aug 16, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "The aptitude round was the first round which was conducted by aspiringminds. The second round was technical round. There was another technical/HR round. Those who were shortlisted attended a final HR round.",
        "questions": [
            "No such unexpected questions.  "
        ],
        "date": "Oct 28, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "It was a pooled campus.There was an initial presentation round where they told us about the company and our role in brief.Then the 1st round was JAM where we could speak about the topic of our choice for a minute.Almost 90% of the people cleared it.Next round was written apti,english and tech.Tech questions were mainly on c,c++ and sql.After that the people who cleared it went through 2 rounds of…  technical face to face interview followed by an hr interview.The questions were fairly easy in the tech interviews since they test your basic programming skills and knowledge of the subjects like c,c++,dbms,se and so on.",
        "questions": [
            "Questions were straightforward.  "
        ],
        "date": "Jul 23, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "There are 3 rounds, first and second with technical interview, last one is manager interview, it is a entry level so not too difficult. it lasts for half hour, 1 hour of the first 2 interview. After all pass, manager call you again for the offer things.",
        "questions": [
            "how many things you need to considering testing a can.  "
        ],
        "date": "Jul 10, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "The interview consisted of 5 rounds - 1.JAM, 2.Written Test, 3.Technical round, 4.Managerial round, 5.HR round.. 1.JAM : 1st round was an easy round , you need to talk about any topic for one minute , their will be less elimination in this round 2.written test : 2nd round included 20 marks aptitude questions and remaining 35 were from C,C++,DBMS..if you are good in C,C++,DBMS you can easily clear this…",
        "questions": [
            "DBMS, normalisation, pointers and data srtructure  "
        ],
        "date": "Aug 17, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Software Engineer",
        "details": "First time went for experienced position and did not pass on the first interview. Then tried a year later for experienced position with success. Two technical reviews for non experienced engineer. Went very well the team manager was more than nice and helping neither gave discounts for answers.",
        "questions": [
            "Level 1. List of 2 colored balls need to sort.Level 2. List of 3 colored balls need to sort.  ",
            "Combine two list in single sorted list.  ",
            "Describe status polling system from computers network.  ",
            "Describe a auto-complete dictionary algorithm.Improve search time.  "
        ],
        "date": "Jun 23, 2015"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Negative Experience",
        "difficulty": "Easy Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "I had a very bad experience. They called me for a F2F Technical Interview.When I reached there, they took one written test explaining they gotta eliminate some people as they cannot take interviews of so many people who had come for the job. They called 200 people for 10 vacancies.They themselves didn't know what kind of questions were there in the written test. The written consisted of questions on C,C++,…  Java and networking. Are you serious? All the languages plus networking?When we said the paper has the questions from all C,C++ and Java the interviewers were like Oh! Is it? We don't know.Anyway, I got through the written round. Then one after the other they took 6 technical interviews. I luckily got through all the rounds. In the 6th round, they told me I am selected and my HR round will be on the phone and it will only be about the negotiation of the salary. In the 6th round itself, they asked me my expected salary. I think they don't pay the salary I expected.And I never received a call for the HR round from them for the negotiation.The overall experience was bad. The interviewers had no plan in mind how to go with the interviews of 200 people.I also didn't contact them because after this bad overall experience, I didn't want to work there. Moreover, I had got a job in some other company.",
        "questions": [
            "No difficult question.  "
        ],
        "date": "May 28, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "There was two rounds : Technical and HR. Technical round was tough . HR round was easy.Technical wen t on for 1 hour. After clearing technical round you have to wait for HR round.Technical round comprises of different types of questions on your subject.",
        "questions": [
            "Describe The Object Oriented Programming  "
        ],
        "date": "Oct 25, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "I applied through college and it was a pool campus.To start with we had a \" just a minute \"(JAM) session in which we had to speak on a topic for 1 minute.Topic was provided to us at the start of session.It was basically a selection round as most of them got selected.People who got through had to go through written test.It consisted of 12 quant ,10 verbal and 35…  technical questions which were basically on pointers and database.Those who got through written had technical interviews in which mostly questions based on JAVA and object oriented concepts were stressed.Also they asked database and operating systems.Technical round selects then went through Managerial round in which they checked the overall personality of the candidate.Almost All the people who got through managerial were selected and had a formal HR round.The process went on for 2 days including midnight .The process was mainly for HP India-Enterprise Services Division",
        "questions": [
            "As i was from Electrical and Electronics background I was finding some questions unheard of.  "
        ],
        "date": "Jan 21, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "Interview was a 1/2 day long and was interviewed by 4 ppl with out the engineering Mgr",
        "questions": [
            "Questions related to CMM process during SW engineering cycle  "
        ],
        "date": "Jan 19, 2014"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "two phone interviews and one panel interview",
        "questions": [],
        "date": "Jan 7, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "1st round was group discussion.2nd round was written test comprising some around 81 questions with 50-60 questions as technical.It was followed by 3 Interviews.1st interview was Purely Technical where in you are covered about every aspect that you mention in the resume and also about projects.2nd interview was Technical and Managerial.3rd was HR Interview.",
        "questions": [
            "Mostly questions were asked from the projects  "
        ],
        "date": "Apr 29, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "6rounds:1 aprtitude test then1 Just a minute seesion, they give list of 3 topics and 10min need to select one and present on it then2 interviews for Software Developer and Software Testing then1 Management round and1 HR RoundBe confident and relaxed.Enjoy",
        "questions": [
            "Apptitude: English and maths is fine, Technical is bit hard.Just a minute seession: only checks ur confidenceinterviews: learn basic concepts of dev and testing  "
        ],
        "date": "Jul 9, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Skype interview,technical as well as HR,after the aptitude round. Was pretty basic, since i guess they didn't have technical people available at that moment.Aptitude round consisted of computer science as well as quant and english questions, the level was tough but the cutoff went low too. But it was okay overall, they took a lot of freshers in our batch,maybe that's why",
        "questions": [],
        "date": "Aug 5, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "4 days",
        "role": "Software Engineer",
        "details": "there were 5 rounds of face to face interview in which 3 were technical interviews + 1 managerial + 1 HR round. But they took around 4-5 days to send the offer letter. After that there was background verification which took around 20-25 days , after which i got the final offer letter.",
        "questions": [
            "C C++ related questions mainly  "
        ],
        "date": "Aug 8, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "1. aptitude2. Technical3. Manager round4. HRAll the rounds were went well. There are no such difficult in questioning.",
        "questions": [
            "I have not asked any difficult question. Only testing point of view and some puzzles  "
        ],
        "date": "Dec 16, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "This was a scheduled event held at HPThe whole process went like this:1. Screening and verification of the documents2. Written Test :This test was having 3 sections : -Aptitude -Verbal -Technical-> Aptitude: The problems were on Mixtures , Profit and loss , Trains , Data interpretation etc.. and I found all of them VERY tough ( maybe I wasn't well prepared)-> Verbal: This was the easiest section->Technical(35 questions) :This section had questions based…  on C , C++ and MySql. I found MySql the easiest one they gave basic queries based on the tables eg. Schema of two tables with a question and the query was in one of the options. It was quite easy.C++ : most of the questions were on C++ they give you a code snippet and you need to find the output I found it a little tedious. You have to be really good at C++.C : It was not as tough as C++ and not too easy also. The problems were again on code snippets.( I wasn't able to clear the 1st round but one of my friend got through it and that person was selected for this position so I am sharing the further rounds acc. to my friend's experience. I must say they would have kept the cut off really high since they selected 2-5 candidates from the batch of 150-200 people. So if you are reading my review I request you to study well in all the subjects. May you succeed in your interview)3. Technical Round ( Elimination round 45 mins ):This round went like this :Tell about yourself and then explain your project on a board.They asked about basic concepts of C,C++,DBMS,JAVA like-Inline Functions,-Function pointer,-Pointers,-Reversing a string without using strrev() ,-Reversing a linked list ,-Program to find factorial of a number,-Swings ,-Servlets ,-JDBC,etc.,-A scenario to write DBMS query- Puzzles4. Managerial Round ( Elimination Round 30 mins ) :This contained both the Technical and HR questionsTell about yourselfDifference between fault and defectCompilation stepsPrimary key and super keyDifferent Ways of sending a piece of dataAlternate method to replace a sequence of pointersDifference between TCP and UDPAbout IP addressFew questions from your resumeMost frustrating moment in your lifeYour short term and long term goals5. HR Round ( NO Elimination 5 mins ):Again brief about yourselfWhat do you know about HP?Why HP?Are you ready to relocate?Your package expectation?How long will you stay in HP?",
        "questions": [
            "There were few random numbers(like 0987654321) given in the question and there are \"n\" friends and each of them calls the other from their number which is \"x\" digits similar to other friend's number. ( I am sorry I cannot recollect the exact question I am just trying to give some idea about it)So there was a huge paragraph providing such details and 5 questions based on the information provided.…  ( I found it the trickiest one )  "
        ],
        "date": "Jan 2, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "1+ week",
        "role": "Software Engineer",
        "details": "Applied through online Job Portal. I got a phone call saying that I am shortlisted and also they asked few questions related to job skills to check whether I had prior experience. Then had a face to face interview. To my surprise, there were 4 interviewers (the team). I have been offered a job.",
        "questions": [
            "How would you make computers to communicate each other? I felt little difficult as I am not from Communications background.  ",
            "Scenario based question: \"Your manager asks you to complete a task by this week and he suggests a way. You feel that the idea has a flaw! But he is not in a situation to hear your advise. How would you handle this?  "
        ],
        "date": "Jan 29, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "6+ weeks",
        "role": "Software Engineer",
        "details": "First phone screen with HR for English level assessment, legal condition and availability.Management interview on site for checking previous experience, salary expectation, travel availability, and reason why the company should hire the candidate.Third round for a technical evaluation, asking theoretical questions and writing code.",
        "questions": [
            "Writing and reading code.  "
        ],
        "date": "Jun 10, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "There were multiple rounds of interviews. There were two technical rounds. And one HR round. Technical was just making sure that fundamentals are clear. HR was very generic, what do you know about HP etc.In the technical round, they asked stuff like what are virtual functions. How does BGP work? (networking software role).",
        "questions": [
            "Do you know about The Machine?  "
        ],
        "date": "Jun 27, 2015"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "Hopeless interviews . They never asked technical questions .",
        "questions": [
            "scenario based questions  "
        ],
        "date": "Sep 13, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "I got interviewed for HP's Imaging and Printing group R&D division. The interview was pretty interesting and difficult",
        "questions": [
            "Internal architecture of Spring coreSome puzzles  "
        ],
        "date": "Sep 9, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1+ week",
        "role": "Software Engineer",
        "details": "The interview process was not too long. The interviewer were nice and friendly.They do ask some easy technical questions which can be found online. Most of them are definition type of questions to test how well you understand certain concepts.There is a hands on test to quickly build a shopping cart.After all that, there is also a short behaviour interview.",
        "questions": [
            "What is the most stressful situation you faced in previous jobs, and how did you handle it?  "
        ],
        "date": "Apr 6, 2016"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "Two initial phone calls with recruiter, questions about my experience and what I would like in a new job. Pressed home that I should brush up my knowledge on HP and its values.Then a technical interview. And finally a face to face interview with a manager. All was relatively easy and straight forward.",
        "questions": [
            "Describe an action you took in your previous job where you took action to improve things, could be improvement in code, process management or anything like that.  "
        ],
        "date": "Nov 11, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "First there will be an hour of face to face interview followed by a technical interview followed by another face to face interview.",
        "questions": [
            "They will provide you a impossible question to be completed in an hour.  "
        ],
        "date": "Feb 24, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Best Interview process among IT Companies",
        "questions": [
            "Why should I hire you , When you are not an BE Graduate.  "
        ],
        "date": "Jun 17, 2013"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "Communication and for realtime problems they tested my skill",
        "questions": [
            "Write a program for a game  "
        ],
        "date": "Apr 17, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "Was easy..had to face the aptitude test,technical round and hr round..recruiters were very friendly",
        "questions": [],
        "date": "Jun 3, 2013"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "It was a employee reference for the software developer and the interviewer was knowledgeable and good experienced and was asking questions relevant to the job and to know about the expertise .",
        "questions": [
            "It would not be difficult if you are not making up things things as they ask about the work done and projects.  "
        ],
        "date": "Sep 8, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "5 days",
        "role": "Software Engineer",
        "details": "Multiple rounds of interviewTechnical in-depth interviews",
        "questions": [],
        "date": "Jan 19, 2013"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "easy and straight forward. nice people, but have specific non-technical requirements/",
        "questions": [],
        "date": "Dec 4, 2012"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "initially test was conducted and then on the basis of the test.i was shortlisted for the initial interview which went very well and then i was called for final interview and then finally selected.",
        "questions": [
            "Tell us about anything that you were not qualified but you did it  "
        ],
        "date": "Nov 19, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "three interviews. two Hr and one technical. Data Structures and Algorithms in detail",
        "questions": [
            "Only usual data Structures asked nothing special  "
        ],
        "date": "Oct 1, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "Fairly good.Interviewers checked your insight into your subject.",
        "questions": [
            "Explain computers and its uses to a layperson.  "
        ],
        "date": "Sep 16, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "- Application- Written test- 4 rounds of technical interview- HR interview",
        "questions": [
            "Write a c program to parse a string for tokens using array. Then modify the program to use stack and linked list.  "
        ],
        "date": "Aug 27, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "-",
        "difficulty": "-",
        "length": "-",
        "role": "Software Engineer",
        "details": "Good hiring process. Telephonic interview followed by 3 rounds of technical interview. Then interview with senior manager then HR. Reasonable offer",
        "questions": [
            "All questions were expected  "
        ],
        "date": "Aug 23, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "I was hired through S.I. Systems. The hiring process consisted of meeting with 2 senior team members, followed by the VP (manager) of the team. On my second interview, I was given a test to complete, and more questions to answer.",
        "questions": [
            "Stack sizes after allocating 1KB in a recursive function (not that difficult actually). Security questions, which didn't make sense to me (unfamiliar terminology). What they meant was weaknesses in programming (size of a static 10 byte buffer, would you buffer[10] = NULL?).  "
        ],
        "date": "Jan 13, 2014"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2+ weeks",
        "role": "Software Engineer",
        "details": "Hiring was well coordinated. The first round was a telephonic screencovering past projects, some basic operating systems, synchronization, multi threaded application concepts. This was followed by three rounds of technical interview focusing on core java , spring, mysql.Overall the questions were mostly knowledge based and some focused on problem solving skills.Finally hiring manager spoke for few minutes about regular topics : team work , interests, goals etc",
        "questions": [
            "How do you implement a solution to bounded buffer producer consumer problem.  "
        ],
        "date": "Jul 9, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Very easy. Basic C and C++ and Java questions. If you took part in programming competitions in college this should be a piece of cake and practice some basic question and go for the interview,",
        "questions": [
            "Design a sample web login page, describe a few projects in your undergrad and a few questions on Finite automata. Blah blah just completing the 50 word limit here!! Blah blah j Blah blah just completing the 50 word limit here!!ust completing the 50 word limit here!!Blah blah just completing the 50 word limit here!!  "
        ],
        "date": "Mar 2, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Got 1:1 interview with 4 persons from different country. Failed coz my working experiences are different with the position it opened.",
        "questions": [
            "algorithm, data structure, mul-tasking vs mul-threading  "
        ],
        "date": "Mar 30, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "It was 3 round process. First round was written test which was completely based on aptitude,technical and English. After the written test the second round was technical interview and it was all good questions related to database, OOPS concept and pointers in C. After the technical round it was HR round.",
        "questions": [
            "It was 3 round process. First round was written test which was completely based on aptitude,technical and English. After the written test the second round was technical interview and it was all good questions related to database, OOPS concept and pointers in C. After the technical round it was HR round.  "
        ],
        "date": "Jan 28, 2016"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "Moderate. Not very hard. They were driving questions well. Gave various hints to steer to correct solution. Eased the situation, and turned out to be good experience",
        "questions": [
            "Tell about situation where you excelled and feel proud.  "
        ],
        "date": "Dec 8, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4 days",
        "role": "Software Engineer",
        "details": "the first interview was with one member of the team. he asked technical question about my background and gave few problems to solve. The second interview was with the group leader, how ask about my preferences. after this interview an HR interview is supposed to be, but i didn't make it",
        "questions": [
            "How to write XML parser  "
        ],
        "date": "Jun 13, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "Interviews with multiple people in one day. Felt very comfortable. No very difficult questions but was exhausted by the end of the day. Interview started at 10am and didn't finish up until 3pm. Had lunch in between.",
        "questions": [
            "Questions regarding my college thesis  ",
            "What was the question you were asked?  "
        ],
        "date": "Feb 22, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "very simple and straight forward",
        "questions": [
            "why is hp good to work  ",
            "Is hp a good pay master  "
        ],
        "date": "Apr 27, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Negative Experience",
        "difficulty": "Easy Interview",
        "length": "6 weeks",
        "role": "Software Engineer",
        "details": "easy, 10 questions about administration, THERE WERE A LOT OF SCENARIOS QUESTION ABOUT CUSTOMER SATISFACTION AND HOW TO MAKE THE CUSTOMER ALWAYS HAPPy. it seemd much more customer than technical oriented.",
        "questions": [
            "how to copy software from one server to another  "
        ],
        "date": "Sep 15, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "the company came to my college. The HR team took too many rounds like Group Discussion, Technical Round, Written Test etc. After that HR shortlisted some Students and Took personal interview & told them Call him after some time to get their joining letter. After going There HR never called any shortlisted candidate because HR asked money to recruit shortlisted candidates.",
        "questions": [
            "no question is as so much difficult. asked mostly about project, subjects and check your communication skills.  "
        ],
        "date": "May 27, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Software Engineer",
        "details": "emailed on my mail. sceduled for f-f on telephonic round after face -to face round cleared hr round",
        "questions": [
            "i dont know much of pl/sql and they told me about pl/sql. what wii you do when no response from your ticket from next level u escalated a ticket, when total communication is impossible?  "
        ],
        "date": "Aug 12, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "One and a half hour for a phone interview with a project manager and technical lead.",
        "questions": [
            "What is the difference between interface and abstract class  ",
            "Tell me about your experience in handling a difficult situation with your coworker.  "
        ],
        "date": "Apr 25, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "First interview was with the direct supervisor, then i was asked to come again for a second interview and for computer test, then interview with manager and final interview with HR. A lot of questions about my previous experience and technology knowledge.I did try to get information regarding the process and job position.",
        "questions": [
            "Print content of tree  "
        ],
        "date": "Apr 3, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "written test with 2 rounds of interview",
        "questions": [
            "nothing in particular  "
        ],
        "date": "Apr 30, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "5 weeks",
        "role": "Software Engineer",
        "details": "First of all they conducted Aptitude test. Once we cleared it, they called for technical interview. In that all technical questions like C, C++, .NET. After that final HR round One to One. After that they announced the result after one hour. Then got call letter after 5 weeks.",
        "questions": [
            "Most difficult questions are about . NET programming.  "
        ],
        "date": "Jun 28, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Software Engineer",
        "details": "Standard Java questions. Three different interviews with Software Engineers of different departments. In the end I did not get the job because they were looking for someone with more experience.",
        "questions": [
            "What is Java VM for?  "
        ],
        "date": "Mar 4, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 days",
        "role": "Software Engineer",
        "details": "interview was quite easy in the offices in sheffield. Had a technical interview first with one of the project manangers, he seemed pretty clueless and was just reading from a sheet. Once he heard his keyword he wasnt interested in anything else. Then the second part of the interview was with a line manger. Nice guy who offered me the job there and then.",
        "questions": [
            "i was asked general C programming questions, whats the command to free up memory that sort of thing.  "
        ],
        "date": "Jul 10, 2015"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Asked basics of Computer Languages like C, C++, Java, VB and Databases. Also asked questions on Operating System. Some questions on my 1 month training.",
        "questions": [
            "Polymorphism with Example.  "
        ],
        "date": "Jun 20, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "An online test cosist of technical question (Networking,C,OS) included with aptitude for 1:30 hours.Then technical interview will be taken.After that if you clear all HR will be there.",
        "questions": [
            "Describe difference between C & C++.  ",
            "Why we use macro?  "
        ],
        "date": "Apr 4, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "The interview process for HP was very smooth.they dont make wait for long hours and most of the details about the company and the offer are given in PPt only.The salary offered is average.",
        "questions": [
            "Delete from a singly linked list in a single travesal using one pointer only.  "
        ],
        "date": "May 31, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "first, i gave telephonic round which was technical round. after clearing that i was called for face to face interview with my manager and third round with HR manager.",
        "questions": [
            "On Database  "
        ],
        "date": "Jun 24, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "The interviewer asked a lot of in-depth Java questions.",
        "questions": [
            "What is the difference between virtual class and interface in Java?  "
        ],
        "date": "Oct 15, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Software Engineer",
        "details": "great!",
        "questions": [
            "how do you like HP  "
        ],
        "date": "May 2, 2012"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "I found the position via a job board, once I applied online and submitted all the required personal information, then I was called by the receptionist for a phone interview, I answered basic background and qualification questions. We then scheduled a phone interview. I answered more job specific technical questions. Then we scheduled a face to face interview where I talked with 4 managers.",
        "questions": [
            "What do you consider a weakness?  "
        ],
        "date": "Oct 3, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "-",
        "role": "Software Engineer",
        "details": "Written round followed by 3 technical rounds. Mainly everything was on data structures and Operating systems concepts",
        "questions": [],
        "date": "Dec 30, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Very Smooth interview process, very friendly interviewers, one day process, two technical and one hr round.",
        "questions": [
            "It was mostly high level technical questions  "
        ],
        "date": "Jul 9, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Software Engineer",
        "details": "1. phone interview, describe work experience, design pattern, etc2. paper test3. 1:1 interview, write one program to get maximum length string in one give string",
        "questions": [
            "write one program to get maximum length string in one give string  "
        ],
        "date": "Jun 6, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1+ week",
        "role": "Software Engineer",
        "details": "Interview went very well as the managers interviewed were in same technical field.",
        "questions": [
            "Regex for IP address match ! And questions deeply with that !  "
        ],
        "date": "Sep 15, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "1+ week",
        "role": "Software Engineer",
        "details": "I was scheduled a phone interview for 2pm. He (the interviewer) did call at 2pm and for one hour, he asked only technical questions. I thought they would ask why I was planning to leave my current job, but no... He asked questions on SQL, Java, and so on...",
        "questions": [
            "How can you solve an infinite loop in a program ?  ",
            "Describe a design pattern  "
        ],
        "date": "Aug 11, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2+ weeks",
        "role": "Software Engineer",
        "details": "The hiring process was very professional and person who took the interview was very technical. The manager was also very professional had several technical questions and asked more indepth.",
        "questions": [
            "What are you dislikes about your previous job ?  "
        ],
        "date": "Mar 4, 2014"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "1.Asked me to tell about myself2.Gave me three programming questions.   1.to do Object Oriented Design for system with 3 (or more) elevators    2.to suggest optimal data structure to save and search in it 1 million strings    3.to sort an array. The array has data of 3 types.One should suggest method for sorting data by single passing on the array.",
        "questions": [
            "..to suggest optimal data structure to save and search in it 1 million strings .  "
        ],
        "date": "Jan 15, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Aptitude test,Written Technical(C,Unix,Database)Group discussionInterviewHR",
        "questions": [
            "why do you want to join us  "
        ],
        "date": "Jan 13, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "1st phase: phone interview2nd: 1:1 with some soft. implementation questions",
        "questions": [
            "What would you do if you were off for a month and you come back in the office and you have 1000 e-mails? How would you organize yourself in order to manage this efficiently?  "
        ],
        "date": "May 29, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "4+ weeks",
        "role": "Software Engineer",
        "details": "1 round telephonic1. technical1 managerial1 HR",
        "questions": [
            "Almost all questions are standard tech industry standards questions, stree is to see if you can learn on your own and work independently in a team  "
        ],
        "date": "Dec 28, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2+ weeks",
        "role": "Software Engineer",
        "details": "Two rounds of technical interview.One round of HR interview.",
        "questions": [
            "Very indepth interview on C, data-structure, algorithm.  "
        ],
        "date": "Dec 21, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 days",
        "role": "Software Engineer",
        "details": "First a phone interview then an all day interview process. Each consisting of a panel, one for technical, personality and one for abstract thinking with puzzlers",
        "questions": [
            "Describe an Orange  "
        ],
        "date": "Oct 13, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "2+ weeks",
        "role": "Software Engineer",
        "details": "A written round for about 350 people and shortlisted around 20. Followed by 2 rounds of technical interview. Mostly on databases and operating systems. 1 technical/HR round a week later.",
        "questions": [
            "What do you think is growing faster? Hardware or Software?  "
        ],
        "date": "May 12, 2013"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1+ week",
        "role": "Software Engineer",
        "details": "For Technical and manager round was good. But please be careful for HR round, because HR will influence you saying the Brand name as HP, and they will talk about lot of process and company policies. But in reality that is all fake. So just stick to your target.",
        "questions": [],
        "date": "Jun 29, 2011"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Software Engineer",
        "details": "4 interviews: 1 with one of the team members, 1 with the team leader, 1 with the group leader and 1 with Human Resources.Each interview was about 1 hour and 30 minutes long.The first 2 interviewers asked me general programming skills questions. The group leader asked me design questions.",
        "questions": [],
        "date": "Apr 8, 2013"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "First there was a telephonic round and where they inquired about the current job profile, past experiences and why am I planning to change. Then they called for 1:1 where they asked what contributions I have done to compiler groups and any other public forums.",
        "questions": [
            "Some questions related to optimizations (related to my projects)  "
        ],
        "date": "Oct 19, 2011"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Software Engineer",
        "details": "prepare the basic technology knowledge. don't be nervous. if you don't understand, it is fine.",
        "questions": [
            "what's your plan in ten years  "
        ],
        "date": "Sep 9, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "I got selected into HP via campus recruitment. They had an initial cut-off in the CGPA as an eligibility criteria for taking up the written tests. There were around 300 candidates who were eligible and took up the 4 round written test. Around 30 were short listed for interview. After first round of technical interview, around 15 left. Then after second round of technical interview, some 7 went for HR…  round. And after HR interview, 3 were offered! and Thank God that am one among them",
        "questions": [
            "They tested the basics and strong fundamentals will help in cracking the interview  "
        ],
        "date": "Sep 23, 2012"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "About 200 people from Circuit Branches - Computer Science, Electronics and Communications, Information Science, Electrical and Electronics and Instrumentation Technology wrote for the written test which tested Aptitude, C and C++ skills. 33 people were shortlisted. The interview process was composed of a 1:1 tech interview which lasted for about 45 minutes and 1 HR Interview was lasted for about 20 minutes. The position was related to the Networking division…  and hence questions were mainly based on Computer Networking - OSI model, Network Layer, Routing, Transport Layer, IPv4 and IPv6 header formats and QOS. HR Interview was mainly about the same type of questions - Where would you like to see yourself in two years?; What games do you play?; What are your hobbies?; Why don't you live on campus?; The Interviewer talked for most of the time.",
        "questions": [
            "What kind of scheduling is used in Real Time Operating Systems?  ",
            "Where would you like to see yourself after two years?  "
        ],
        "date": "Nov 26, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "2 weeks",
        "role": "Software Engineer",
        "details": "The interview consisted of a few easy programming problems.",
        "questions": [
            "How would count individual words in a Text?  ",
            "What is a deadlock?  "
        ],
        "date": "Oct 26, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2+ weeks",
        "role": "Software Engineer",
        "details": "It was long and boring but challenging.",
        "questions": [],
        "date": "Oct 13, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "5 days",
        "role": "Software Engineer",
        "details": "The interview process depends on team, usually it is algos, OS internals, programming knowledge.",
        "questions": [
            "binary search algo  "
        ],
        "date": "Nov 18, 2010"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "not too much to describe",
        "questions": [
            "Why are you not doing a masters  "
        ],
        "date": "Nov 25, 2009"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Questions on career goals, objective, answers on technical questions JAVA, MS , Servers, CISCO networks..CCNA CCNP, other relevant experience, character reference, how previous job exp match current. look at your portfolio...",
        "questions": [
            "How to do configutation in SAP  "
        ],
        "date": "Jun 16, 2009"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2+ weeks",
        "role": "Software Engineer",
        "details": "It was long and boring but challenging.",
        "questions": [],
        "date": "Oct 13, 2010"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "5 days",
        "role": "Software Engineer",
        "details": "The interview process depends on team, usually it is algos, OS internals, programming knowledge.",
        "questions": [
            "binary search algo  "
        ],
        "date": "Nov 18, 2010"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "not too much to describe",
        "questions": [
            "Why are you not doing a masters  "
        ],
        "date": "Nov 25, 2009"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Engineer",
        "details": "Questions on career goals, objective, answers on technical questions JAVA, MS , Servers, CISCO networks..CCNA CCNP, other relevant experience, character reference, how previous job exp match current. look at your portfolio...",
        "questions": [
            "How to do configutation in SAP  "
        ],
        "date": "Jun 16, 2009"
    }
]